// const lession = `[{"_id":{"$oid":"5e5ff26d5249600024d4d92a"},"group":"bhj-9","date":"2020-03-05","time":"19:00","teacher":"Владимир Чебукин","lecture":"Способы поиска нужного HTML-элемента","additional":"Мы узнаем о $0 в консоли, познакомимся с HTMLCollection и различными доступами к элементам. Ждем вас на вебинаре!","id":"5dbd0ba3-9af0-d5a9-69b6-08a86cc903fc","isSent":true},
//   {"_id":{"$oid":"5e5ff2f75249600024d4d92b"},"group":"bhj-9","date":"2020-10-11","time":"19:00","teacher":"Антон Варнавский","lecture":"Объект события","additional":"Мы узнаем окакие проблемы может вызывать использование свойства onclick, и как по-другому можно назначить и удалить обработчики событий элемента. Подробно рассмотрим объект события, содержащий подробную информацию об обрабатываемом событии, свойства событий и обработку событий клавиатуры. До встречи на вебинаре!","id":"afd64490-c9f5-f0ca-a01f-91afef38acfa","isSent":true},
//   {"_id":{"$oid":"5e5ff3245249600024d4d92c"},"group":"bhj-9","date":"2020-10-13","time":"19:00","teacher":"Илья Меджидов","lecture":"DOM","additional":"Мы познакомимся  и научимся работать с событиями  загрузки DOM, навигацией, различными атрибутами. Приходите, будет интересно!","id":"8c0a5f76-54bc-ec61-8885-50b140baf6d6","isSent":true},
//   {"_id":{"$oid":"5e5ff3c75249600024d4d92e"},"group":"bhj-9","date":"2020-10-18","time":"19:00","teacher":"Владимир Чебукин","lecture":"Изменение структуры HTML-документа","additional":"На ней мы познакомимся с содержимым HTML-документа, узнаем о представлении элемента и научимся управлять различными элементами. Не пропустите вебинар, чтобы задать интересующие вопросу лектору лично. Ждем вас на вебинаре!","id":"94fad5e7-fe26-2ded-259b-ad9cd232ab13","isSent":true},
//   {"_id":{"$oid":"5e5ff4265249600024d4d92f"},"group":"bhj-9","date":"2020-10-20","time":"19:00","teacher":"Михаил Кузнецов","lecture":"Асинхронные запросы","id":"52ca6434-e2a1-0807-7daa-be83e08b5acb","isSent":true},
//   {"_id":{"$oid":"5e6e30eebec59500170ad2cc"},"group":"html-49","date":"2020-10-16","time":"19:00","teacher":"Евгений Корытов","lecture":"Введение в HTML и CSS","id":"6f12834e-3f17-dd3d-3ffd-1f680389e178","isSent":true},
//   {"_id":{"$oid":"5e6e3571bec59500170ad2cd"},"group":"html-49","date":"2020-10-18","time":"19:00","teacher":"Денис Ежков","lecture":"Контентные теги","id":"43ca595b-4a74-9456-4979-d8a3b9b30bdf","isSent":true},
//   {"_id":{"$oid":"5e6e387dbec59500170ad2d1"},"group":"ra-22","date":"2020-10-20","time":"19:00","teacher":"Константин Полянский","lecture":"Компоненты","additional":"Вы познакомитесь с библиотекой React, компонентами и инструментарием. Также узнаете о компонентном и декларативном подходе, JSX и PropTypes.","id":"355a2f78-f59c-83b3-afd8-4cd7f0c928b7","isSent":true},
//   {"_id":{"$oid":"5e6e3976bec59500170ad2d2"},"group":"bjs-10","date":"2020-10-20","time":"19:30","teacher":"Денис Ежков","lecture":"Базовый синтаксис","id":"5fb0a828-be7f-dc84-3cbf-e9b2be244ff1","isSent":true},
//   {"_id":{"$oid":"5e6f4409f4c6720017636d21"},"group":"pb-11","date":"2020-10-18","time":"19:00","teacher":"Алёна Батицкая","lecture":"Циклы","isSent":true},
//   {"_id":{"$oid":"5e6fcc658ced510017fa04d1"},"group":"html-48","date":"2020-10-18","time":"20:00","teacher":"Владимир Языков","lecture":"Позиционирование flex-элементов","id":"d5fb8347-fa30-9e4d-ab4f-40f366a927d7","isSent":true},
//   {"_id":{"$oid":"5e73302f83aca700177d253f"},"group":"pb-11","date":"2020-10-20","time":"19:00","teacher":"Алёна Батицкая","lecture":"Ассоциативные Массивы","id":"f2de9a2e-4b15-25f0-b251-7e9e3c918aae","isSent":true},
//   {"_id":{"$oid":"5e7755bba5044b0017898a15"},"group":"bhj-9","date":"2020-10-23","time":"19:00","teacher":"Михаил Кузнецов","lecture":"Асинхронные запросы","id":"bb0df822-df2e-d995-72cf-cc25b1136de5","isSent":true},
//   {"_id":{"$oid":"5e775699a5044b0017898a16"},"group":"bhj-9","date":"2020-10-25","time":"19:00","teacher":"Александр Русаков","lecture":"Хранение состояния на клиенте и отправка на сервер","id":"690a82a2-681f-8350-d95a-58cd0e44d4aa","isSent":true},
//   {"_id":{"$oid":"5e77570aa5044b0017898a17"},"group":"bhj-9","date":"2020-10-26","time":"19:00","teacher":"Татьяна Демьяненко","lecture":"Консультация по дипломной работе курса JS","id":"e8769718-98a4-e8cd-1978-0704cde0f0c8","isSent":true},
//   {"_id":{"$oid":"5e775b22a5044b0017898a1a"},"group":"bjs-10","date":"2020-10-27","time":"19:00","teacher":"Владимир Чебукин","lecture":"Функции, объекты в JavaScript","id":"da31f035-6b0c-4f49-6436-b3cec7cb1267","isSent":true},
//   {"_id":{"$oid":"5e775ba3a5044b0017898a1b"},"group":"html-49","date":"2020-10-24","time":"19:00","teacher":"Денис Ежков","lecture":"Теги для вёрстки структуры контента","id":"b34b2ff9-7fa3-4910-e7ef-b40496ae14a5","isSent":true},
//   {"_id":{"$oid":"5e775cb9a5044b0017898a1c"},"group":"html-49","date":"2020-10-26","time":"19:00","teacher":"Семён Бойко","lecture":"Позиционирование блочных элементов","id":"0d87d910-c92d-fa96-40bc-5864bbfa7e20","isSent":true}]`;
// export default lession;

// const lession = `[{
//   "_id": {
//     "$oid": "5e5ff26d5249600024d4d92a"
//   },
//   "group": "bhj-9",
//   "date": "2020-03-05",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Способы поиска нужного HTML-элемента",
//   "id": "5dbd0ba3-9af0-d5a9-69b6-08a86cc903fc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e5ff2f75249600024d4d92b"
//   },
//   "group": "bhj-9",
//   "date": "2020-03-11",
//   "time": "19:00",
//   "teacher": "Антон Варнавский",
//   "lecture": "Объект события",
//   "id": "afd64490-c9f5-f0ca-a01f-91afef38acfa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e5ff3245249600024d4d92c"
//   },
//   "group": "bhj-9",
//   "date": "2020-03-13",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "DOM",
//   "id": "8c0a5f76-54bc-ec61-8885-50b140baf6d6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e5ff3c75249600024d4d92e"
//   },
//   "group": "bhj-9",
//   "date": "2020-03-18",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Изменение структуры HTML-документа",
//   "id": "94fad5e7-fe26-2ded-259b-ad9cd232ab13",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e5ff4265249600024d4d92f"
//   },
//   "group": "bhj-9",
//   "date": "2020-03-20",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Асинхронные запросы",
//   "id": "52ca6434-e2a1-0807-7daa-be83e08b5acb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e60e655fe376b58444c2ae5"
//   },
//   "group": "unknown",
//   "date": "2020-03-28",
//   "time": "21:00",
//   "teacher": "Иван Васильевич",
//   "lecture": "Путешествие во времени",
//   "id": "5b970057-0d53-1fce-c0db-76bec779fcf4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e6e2febbec59500170ad2cb"
//   },
//   "group": "html-48",
//   "date": "2020-03-19",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе",
//   "id": "d4d6144b-ae37-5046-681c-a3526b78cfa2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e6e30eebec59500170ad2cc"
//   },
//   "group": "html-49",
//   "date": "2020-03-16",
//   "time": "19:00",
//   "teacher": "Евгений Корытов",
//   "lecture": "Введение в HTML и CSS",
//   "id": "6f12834e-3f17-dd3d-3ffd-1f680389e178",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e6e3571bec59500170ad2cd"
//   },
//   "group": "html-49",
//   "date": "2020-03-18",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контентные теги",
//   "id": "43ca595b-4a74-9456-4979-d8a3b9b30bdf",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e6e387dbec59500170ad2d1"
//   },
//   "group": "ra-22",
//   "date": "2020-03-20",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Компоненты",
//   "id": "355a2f78-f59c-83b3-afd8-4cd7f0c928b7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e6e3976bec59500170ad2d2"
//   },
//   "group": "bjs-10",
//   "date": "2020-03-20",
//   "time": "19:30",
//   "teacher": "Денис Ежков",
//   "lecture": "Базовый синтаксис",
//   "id": "5fb0a828-be7f-dc84-3cbf-e9b2be244ff1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e6f4409f4c6720017636d21"
//   },
//   "group": "pb-11",
//   "date": "2020-03-18",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Циклы",
//   "id": "6c74a3d8-fa43-278a-fd80-94c76c53c8e3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e6fcc658ced510017fa04d1"
//   },
//   "group": "html-48",
//   "date": "2020-03-18",
//   "time": "20:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Позиционирование flex-элементов",
//   "id": "d5fb8347-fa30-9e4d-ab4f-40f366a927d7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e73302f83aca700177d253f"
//   },
//   "group": "pb-11",
//   "date": "2020-03-20",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Ассоциативные Массивы",
//   "id": "f2de9a2e-4b15-25f0-b251-7e9e3c918aae",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e7755bba5044b0017898a15"
//   },
//   "group": "bhj-9",
//   "date": "2020-03-23",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Асинхронные запросы",
//   "id": "bb0df822-df2e-d995-72cf-cc25b1136de5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e775699a5044b0017898a16"
//   },
//   "group": "bhj-9",
//   "date": "2020-03-25",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Хранение состояния на клиенте и отправка на сервер",
//   "id": "690a82a2-681f-8350-d95a-58cd0e44d4aa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e77570aa5044b0017898a17"
//   },
//   "group": "bhj-9",
//   "date": "2020-03-26",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе курса JS",
//   "id": "e8769718-98a4-e8cd-1978-0704cde0f0c8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e775b22a5044b0017898a1a"
//   },
//   "group": "bjs-10",
//   "date": "2020-03-27",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Функции, объекты в JavaScript",
//   "id": "da31f035-6b0c-4f49-6436-b3cec7cb1267",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e775ba3a5044b0017898a1b"
//   },
//   "group": "html-49",
//   "date": "2020-03-24",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для вёрстки структуры контента",
//   "id": "b34b2ff9-7fa3-4910-e7ef-b40496ae14a5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e775cb9a5044b0017898a1c"
//   },
//   "group": "html-49",
//   "date": "2020-03-26",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование блочных элементов",
//   "id": "0d87d910-c92d-fa96-40bc-5864bbfa7e20",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e775d96a5044b0017898a1d"
//   },
//   "group": "mq-22",
//   "date": "2020-03-23",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Breakpoints",
//   "id": "fb890e7f-5659-54eb-1e95-f7b10ce32007",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e775df3a5044b0017898a1e"
//   },
//   "group": "mq-22",
//   "date": "2020-03-25",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивные изображения",
//   "id": "f31b8edf-5ab3-2692-a3aa-17ce1956a470",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e775e36a5044b0017898a1f"
//   },
//   "group": "mq-22",
//   "date": "2020-03-27",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе",
//   "id": "8a606748-41c1-32ff-b0ac-0f42a0e61f0c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e7868a12aa5800017fbbeb9"
//   },
//   "group": "pb-11",
//   "date": "2020-03-25",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Параметры и возвращаемое значение",
//   "id": "6a0f2362-67ac-a21f-5d96-3311f5bc5d21",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e7f99b39f74bf0017814d4e"
//   },
//   "group": "WM-abc",
//   "date": "2020-04-02",
//   "time": "19:00",
//   "teacher": "Тони Старк",
//   "lecture": "Миллионирование",
//   "id": "91dfc53d-fe72-8ef8-ea90-167cd1c24861",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e7faf6be7179a17e21d95e8"
//   },
//   "group": "WM-abc",
//   "date": "2020-03-29",
//   "time": "19:30",
//   "teacher": "Аль Капоне",
//   "lecture": "Как заработать много денег",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e806aef54668100179d2395"
//   },
//   "group": "bafe-8",
//   "date": "2020-03-30",
//   "time": "19:30",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Вводная лекция с координатором курса",
//   "id": "80e28659-ec07-b4af-7403-0a994a46935c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e806b5654668100179d2396"
//   },
//   "group": "bafe-8",
//   "date": "2020-04-01",
//   "time": "19:00",
//   "teacher": "Алексей Стегура",
//   "lecture": "Как замотивировать себя на учёбу",
//   "id": "5a84a794-96df-0092-c5c2-d5ee0db7819c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e806c1154668100179d2397"
//   },
//   "group": "bjs-10",
//   "date": "2020-03-31",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Прототип и конструктор объекта",
//   "id": "7d24994d-3198-6f23-b987-79b2ed7f69d1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e806c5054668100179d2398"
//   },
//   "group": "bjs-10",
//   "date": "2020-04-02",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "ООП в JS (ES6)",
//   "id": "ca7a97c9-9429-e775-01af-38c8d5d27f38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e806fd154668100179d2399"
//   },
//   "group": "html-49",
//   "date": "2020-03-30",
//   "time": "19:00",
//   "teacher": "Евгений Корытов",
//   "lecture": "Вёрстка форм",
//   "id": "2dc7c86a-d4d1-04b2-fabf-b0c5534388b1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e80703454668100179d239a"
//   },
//   "group": "html-49",
//   "date": "2020-04-02",
//   "time": "18:00",
//   "teacher": "Александр Фитискин",
//   "lecture": "Нестандартные элементы форм",
//   "id": "2933822f-7d4c-00e2-796a-040f1c440cab",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8070c654668100179d239b"
//   },
//   "group": "mq-23",
//   "date": "2020-04-03",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Верстка резинового макета",
//   "id": "6c9b0d6d-dd0d-ce16-dced-3df5dc973eb0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e80742f54668100179d239c"
//   },
//   "group": "ra-22",
//   "date": "2020-03-31",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Формы",
//   "id": "7a0fd59e-1a48-f260-9815-fbfa88bc8f83",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e80749854668100179d239d"
//   },
//   "group": "ra-22",
//   "date": "2020-04-02",
//   "time": "19:00",
//   "teacher": "Елена Семенова",
//   "lecture": "Композиция компонентов",
//   "id": "04c23102-c478-f2b8-1c0b-af61f8f26860",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e80757454668100179d239e"
//   },
//   "group": "ahj-6",
//   "date": "2020-03-30",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Рабочее окружение",
//   "id": "b6ffec89-98b7-be95-3ad3-2b8a6b22336a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8075d854668100179d239f"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-01",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Работа с DOM (объектная модель документа)",
//   "id": "a81ecb50-f4c0-3eb6-fc07-cbe5a06a1b2b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e80762954668100179d23a0"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-03",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Обработка событий",
//   "id": "5335e73f-5510-1186-e28f-357b16a4065e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8742baef1096001736f3c2"
//   },
//   "group": "java-12",
//   "date": "2020-04-06",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Первая программа на Java",
//   "id": "482dfab7-c0d6-6a85-09bb-f4a6b7796e27",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874322ef1096001736f3c3"
//   },
//   "group": "java-12",
//   "date": "2020-04-08",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структура программы",
//   "id": "a4944114-3667-322d-70bd-443f9b86f3aa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874396ef1096001736f3c4"
//   },
//   "group": "java-12",
//   "date": "2020-04-13",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Условные операторы и циклы",
//   "id": "0e1261cd-7b82-8cdf-f3b4-386e1f9407e5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8744f7ef1096001736f3c5"
//   },
//   "group": "java-12",
//   "date": "2020-04-16",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: примитивы",
//   "id": "a0c09540-1c22-5cb4-5632-3fedf057cfae",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874545ef1096001736f3c6"
//   },
//   "group": "java-12",
//   "date": "2020-04-20",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: объекты",
//   "id": "b66bc8b4-b69b-8d00-a491-1e435575c8cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8745bcef1096001736f3c7"
//   },
//   "group": "java-12",
//   "date": "2020-04-22",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач и основы работы в IDE",
//   "id": "a9da8718-6729-c062-8777-2de41f6e0976",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874b15ef1096001736f3c9"
//   },
//   "group": "and-9",
//   "date": "2020-04-09",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Верстка графического интерфейса в Android",
//   "id": "c46bc701-bb0a-e7c5-f1de-bc8cb5050799",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874b4bef1096001736f3ca"
//   },
//   "group": "and-9",
//   "date": "2020-04-14",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Другие Виды Layouts",
//   "id": "bd2bb268-53fb-449e-d1d9-2eed0307ae8f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874b7bef1096001736f3cb"
//   },
//   "group": "and-9",
//   "date": "2020-04-16",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "App resources, Config qualifier",
//   "id": "21fe4e89-734b-1481-b259-f676e38f2338",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874ba8ef1096001736f3cc"
//   },
//   "group": "and-9",
//   "date": "2020-04-20",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Android styles",
//   "id": "bdef4f6c-ac63-bc9a-4736-c6b6da2a02aa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874c1aef1096001736f3ce"
//   },
//   "group": "and-9",
//   "date": "2020-04-28",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Работа с конфигурируемым интерфейсом на примере списков. Классы Adapter, AdapterView",
//   "id": "5dc4b476-571f-3de4-36b2-254c736b4d18",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874c4cef1096001736f3cf"
//   },
//   "group": "and-9",
//   "date": "2020-04-30",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Разбор задач",
//   "id": "14d112a6-4eed-ec5b-852a-2ac853a2d282",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874d51ef1096001736f3d1"
//   },
//   "group": "kt-7",
//   "date": "2020-04-07",
//   "time": "19:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Консультация по дипломной работе",
//   "id": "095e579a-df35-0f5a-520f-b25bb2ab98a4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874f14ef1096001736f3d6"
//   },
//   "group": "javaqa-4",
//   "date": "2020-04-06",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Интерфейсы для организации малой связности. Обобщённое программирование (Generics)",
//   "id": "f5377af3-8780-1be6-8085-2f3b23be5c9f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874f2def1096001736f3d7"
//   },
//   "group": "javaqa-4",
//   "date": "2020-04-08",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Collections Framework. CRUD и тестирование систем, управляющих набором объектов",
//   "id": "bb3247af-5f41-fb3e-801e-da4c058340b4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874f96ef1096001736f3d9"
//   },
//   "group": "javaqa-5",
//   "date": "2020-04-07",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Выстраивание процесса непрерывной интеграции (CI): Github Actions. Покрытие кода с JaCoCo, статический анализ кода: CheckStyle, SpotBugs",
//   "id": "efb95078-3d3e-8a34-8498-ffe2124f7dcc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874fadef1096001736f3da"
//   },
//   "group": "javaqa-5",
//   "date": "2020-04-09",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Объектно-ориентированное программирование и проектирование",
//   "id": "6c6fab68-8728-12f5-5de4-7ea4b2d52236",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e874fcfef1096001736f3db"
//   },
//   "group": "javaqa-5",
//   "date": "2020-04-13",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Объектно-ориентированное программирование: ключевые принципы",
//   "id": "41a07574-301a-9ad9-989d-cc743c4f94c8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e875002ef1096001736f3dd"
//   },
//   "group": "javaqa-5",
//   "date": "2020-04-20",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Композиция и зависимость объектов. Mockito при создании автотестов",
//   "id": "cacb1a47-e1cb-af0b-2b38-ba9544ed5420",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e875019ef1096001736f3de"
//   },
//   "group": "javaqa-5",
//   "date": "2020-04-23",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Наследование и расширяемость систем. Проблемы наследования",
//   "id": "d09eda2f-fb18-b4c7-26a0-58dc1514cda2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e87502eef1096001736f3df"
//   },
//   "group": "javaqa-5",
//   "date": "2020-05-07",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Исключительные ситуации и их обработка. Тестирование исключений",
//   "id": "aecc11de-ecaa-052b-f51e-e0c9a0f3049f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e875043ef1096001736f3e0"
//   },
//   "group": "javaqa-5",
//   "date": "2020-05-13",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Интерфейсы для организации малой связности. Обобщённое программирование (Generics)",
//   "id": "e503930f-d643-e1be-a6d6-686941ab8936",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e875059ef1096001736f3e1"
//   },
//   "group": "javaqa-5",
//   "date": "2020-05-15",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Collections Framework. CRUD и тестирование систем, управляющих набором объектов",
//   "id": "646fd585-f4cd-fe0b-342e-5a5c2b72abfa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e87568bef1096001736f3e3"
//   },
//   "group": "aqa-3",
//   "date": "2020-04-06",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Docker и Docker Compose",
//   "id": "07b50c37-837a-3b59-57fc-1ecd4c280d6b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8756caef1096001736f3e4"
//   },
//   "group": "aqa-3",
//   "date": "2020-04-09",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "SQL",
//   "id": "f776b69e-8e6f-c491-33db-fa83aebbdbee",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e875715ef1096001736f3e5"
//   },
//   "group": "aqa-3",
//   "date": "2020-04-13",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Репортинг: Report Portal",
//   "id": "85bb62c4-d8eb-56d5-b952-4b65fd9f3b0f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e87574eef1096001736f3e6"
//   },
//   "group": "aqa-3",
//   "date": "2020-04-16",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Заключительная лекция",
//   "id": "25908a92-1a1f-e25c-4ed9-401c923dcec6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89b62bc03d6a0017e46801"
//   },
//   "group": "html-49",
//   "date": "2020-04-06",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Всплывающие элементы",
//   "id": "a062039e-9b10-8f5e-5761-26204f901c26",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89b6c1c03d6a0017e46802"
//   },
//   "group": "html-49",
//   "date": "2020-04-08",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование flex-элементов",
//   "id": "8e277c04-6b6c-5f8e-4411-07aff480766b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89b709c03d6a0017e46803"
//   },
//   "group": "html-49",
//   "date": "2020-04-10",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "id": "45febde6-0352-e61c-62b5-b0f1c926a9f4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89b7e6c03d6a0017e46804"
//   },
//   "group": "bafe-8",
//   "date": "2020-04-07",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "id": "37dd5bea-6f96-df32-1c17-9a99d76b8e1f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89b835c03d6a0017e46805"
//   },
//   "group": "bafe-8",
//   "date": "2020-04-09",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Путь frontend-разработчика",
//   "id": "dbaf1572-aec4-43d1-2a3a-941ab182c4c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89b9fec03d6a0017e46806"
//   },
//   "group": "mq-23",
//   "date": "2020-04-06",
//   "time": "19:00",
//   "teacher": "Евгений Корытов",
//   "lecture": "Резиновые изображения",
//   "id": "0ff4576a-3d61-c984-5506-cfdd74f61932",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89ba63c03d6a0017e46807"
//   },
//   "group": "mq-23",
//   "date": "2020-04-09",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Введение в медиа-запросы",
//   "id": "889171b9-9a4f-3499-eb7d-562d64f4d904",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89badcc03d6a0017e46808"
//   },
//   "group": "bjs-10",
//   "date": "2020-04-06",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Обработка исключений и замыкания",
//   "id": "65a67556-1335-8f05-b986-e9096a5ab434",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89bb12c03d6a0017e46809"
//   },
//   "group": "bjs-10",
//   "date": "2020-04-08",
//   "time": "18:30",
//   "teacher": "Евгений Шек",
//   "lecture": "Прототип массива, функции высшего порядка",
//   "id": "b529093e-989f-e2b6-b123-79bda497a354",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89bb75c03d6a0017e4680a"
//   },
//   "group": "bjs-10",
//   "date": "2020-04-10",
//   "time": "19:00",
//   "teacher": "Евгений Корытов",
//   "lecture": "Асинхронность",
//   "id": "abdff219-0ef4-bf4c-b58d-e2a1bf0efc9a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89bbdbc03d6a0017e4680b"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-06",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Организация тестирования (Unit, E2E)",
//   "id": "2e6e4b84-f62b-eb8a-ca7d-01f69d1c2ef3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89bc26c03d6a0017e4680c"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-08",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Работа с HTML-формами",
//   "id": "59c878df-0b8f-df23-ea21-4f4078431320",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89bc6dc03d6a0017e4680d"
//   },
//   "group": "ra-22",
//   "date": "2020-04-06",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Жизненный цикл и работа с HTTP",
//   "id": "67c6fddc-e4c9-8833-dd00-5c6f3193bc08",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e89bcafc03d6a0017e4680e"
//   },
//   "group": "ra-22",
//   "date": "2020-04-09",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "НОС",
//   "id": "90e9e8ba-4ebc-4973-178f-ca081e8cdad2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8b2d82a8fd6e00176c77ee"
//   },
//   "group": "java-11",
//   "date": "2020-04-09",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Массивы многомерные",
//   "id": "32be0e49-ef34-fe8f-bd26-742c5390b964",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8b2daca8fd6e00176c77ef"
//   },
//   "group": "java-11",
//   "date": "2020-04-14",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Структура класса",
//   "id": "f3d8d1aa-c132-b1a8-03b1-038da8c26e32",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8b2de2a8fd6e00176c77f0"
//   },
//   "group": "java-11",
//   "date": "2020-04-17",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Модификаторы доступа, наследование",
//   "id": "e970f6fc-2642-b838-04fb-51c8e9d501e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8b2e14a8fd6e00176c77f1"
//   },
//   "group": "java-11",
//   "date": "2020-04-21",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Полиморфизм",
//   "id": "90ab9703-7e1e-f801-daf7-24c643bb9a2b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8b2e40a8fd6e00176c77f2"
//   },
//   "group": "java-11",
//   "date": "2020-04-23",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Абстракции и интерфейсы",
//   "id": "4ff441e1-9982-88e1-66cb-fae7a350d2dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e8b2e65a8fd6e00176c77f3"
//   },
//   "group": "java-11",
//   "date": "2020-04-28",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Разбор задач",
//   "id": "04ee0374-3489-937f-da04-f6a303217a71",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e930d3e98a55178d0660bb0"
//   },
//   "group": "bjs-test",
//   "date": "2020-04-13",
//   "time": "19:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач и основы работы в IDE",
//   "id": "278ec4ae-a9a1-f51c-0aab-d794b36cac69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e932521448a2d6074a0ee67"
//   },
//   "group": "WM-abc",
//   "date": "2020-04-13",
//   "time": "22:50",
//   "teacher": "Алексей Вереин",
//   "lecture": "Другие Виды Layouts",
//   "id": "eaafd2ef-e86b-99d8-6a00-23e500c868f0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e933482258a6f0017505bca"
//   },
//   "group": "WM-abc",
//   "date": "2020-04-12",
//   "time": "18:31",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: объекты",
//   "id": "b4bb24fd-8eeb-298b-4116-9141777bcd64",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e935b7b818c590017ae42ac"
//   },
//   "group": "WM-abc",
//   "date": "2020-04-13",
//   "time": "18:30",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Разбор задач",
//   "id": "64730b2e-2728-f943-8207-71821762aed5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9371b5818c590017ae42ad"
//   },
//   "group": "bjs-10",
//   "date": "2020-04-13",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "id": "cd2eb47f-9201-4235-539b-7ece25cfa18d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e937220818c590017ae42ae"
//   },
//   "group": "html-50",
//   "date": "2020-04-14",
//   "time": "19:00",
//   "teacher": "Евгений Корытов",
//   "lecture": "Введение в HTML и CSS",
//   "id": "8052e8b0-465e-8e06-7739-7cf0eee885b7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e937265818c590017ae42af"
//   },
//   "group": "html-50",
//   "date": "2020-04-16",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контентные теги",
//   "id": "2c68ea29-80d0-4c3d-1954-4a01879ab50b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9372d5818c590017ae42b0"
//   },
//   "group": "mq-23",
//   "date": "2020-04-13",
//   "time": "19:00",
//   "teacher": "Антон Варнавский",
//   "lecture": "Медиа-функции",
//   "id": "86fe521b-577d-4063-2932-99053824e0e1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e937335818c590017ae42b1"
//   },
//   "group": "mq-23",
//   "date": "2020-04-15",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Особенности верстки графики для мобильных устройств",
//   "id": "fdd7617c-afd5-9548-5bef-aaf97140935e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e937396818c590017ae42b2"
//   },
//   "group": "mq-23",
//   "date": "2020-04-17",
//   "time": "19:00",
//   "teacher": "Дмитрий Рябов",
//   "lecture": "Верстка адаптивного макета",
//   "id": "7ebef500-b2b3-9c5d-aac4-524f617180ef",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9373ff818c590017ae42b3"
//   },
//   "group": "ra-22",
//   "date": "2020-04-13",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "hooks, Context API",
//   "id": "10c7c309-6b14-43a5-6ed1-853c135cb232",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e93758b818c590017ae42b4"
//   },
//   "group": "ra-22",
//   "date": "2020-04-16",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "React Router",
//   "id": "ccea0670-9681-2761-9377-6ef1958d7f30",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9375f0818c590017ae42b5"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-13",
//   "time": "19:00",
//   "teacher": "Евгений Корытов",
//   "lecture": "Drag & Drop, Работа с файлами",
//   "id": "20d158dd-1ad4-2da9-63d9-3b1ceb938bb8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e93763d818c590017ae42b6"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-15",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Работа с HTTP",
//   "id": "49cd55c4-91ee-a444-f35f-47be3989575a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9376af818c590017ae42b7"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-17",
//   "time": "19:00",
//   "teacher": "Евгений Корытов",
//   "lecture": "EventSource, Websockets",
//   "id": "0cb3b7e6-98b2-c144-5b0c-898f0eaed2f4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e941e58ec0fbd0017367586"
//   },
//   "group": "bhj-9",
//   "date": "2020-04-17",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Стандарты и рабочее окружение",
//   "id": "da7d3b2c-d29f-8546-d9bf-2026bb2f0831",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9568fd427aa40017fceb63"
//   },
//   "group": "my_for_test",
//   "date": "2020-04-15",
//   "time": "10:00",
//   "teacher": "Susanna",
//   "lecture": "testing anonce",
//   "id": "dc97ab54-f9a9-6aef-d22d-788d415af934",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e956970427aa40017fceb64"
//   },
//   "group": "my_for_test",
//   "date": "2020-04-15",
//   "time": "10:41",
//   "teacher": "Susanna",
//   "lecture": "testing anonce",
//   "id": "986d5244-22f9-cfbd-70e0-8029fd7d9808",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e956a2b427aa40017fceb65"
//   },
//   "group": "my_for_test",
//   "date": "2020-04-15",
//   "time": "10:45",
//   "teacher": "Susanna",
//   "lecture": "testing anonce",
//   "id": "a51ca4d1-b63d-76e9-e2c4-2c52387c049d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e956a9a427aa40017fceb66"
//   },
//   "group": "my_for_test",
//   "date": "2020-04-15",
//   "time": "10:46",
//   "teacher": "Susanna ",
//   "lecture": "test with image",
//   "id": "9eade825-c4a0-773a-d39d-0dd109dc08cc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e95cba1eb9363001740fd36"
//   },
//   "group": "pb-12",
//   "date": "2020-04-15",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Базовые понятия. Переменные и числа",
//   "id": "7f141556-6ffc-6a45-7b3f-bdd44c0336da",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e95cc55eb9363001740fd37"
//   },
//   "group": "pb-12",
//   "date": "2020-04-17",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Логический тип и ветвление",
//   "id": "c2b26fee-c053-687b-95b3-471dd10b680b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e974cb778ff8c00173bb3fb"
//   },
//   "group": "my_for-test",
//   "date": "2020-04-16",
//   "time": "17:00",
//   "teacher": "Сусанна",
//   "lecture": "проба номер два",
//   "id": "67e8068b-09ae-3ba4-467d-bccc7ed55047",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e98173f30e57c00174cf6f1"
//   },
//   "group": "my_for-test",
//   "date": "2020-04-19",
//   "time": "11:30",
//   "teacher": "Сусанна",
//   "lecture": "Проба номер два",
//   "id": "582a8663-922d-e58d-654d-f50a3e06330d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9835cf9652970017d5ccfa"
//   },
//   "group": "aqa-4",
//   "date": "2020-04-17",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Основы автоматизации",
//   "id": "75e698fb-5a19-77a8-5c71-ce296b874dd5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9839279652970017d5ccfc"
//   },
//   "group": "aqa-4",
//   "date": "2020-04-21",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Тестирование API, Continuous Integration",
//   "id": "f1655aeb-20dd-fe25-6c73-b8b83bbeba9c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9839a49652970017d5ccfd"
//   },
//   "group": "aqa-4",
//   "date": "2020-04-23",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Тестирование веб-интерфейсов, Selenium и Selenide",
//   "id": "c3f3edc3-4378-3a9b-eb40-6fbe68313154",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9839c29652970017d5ccfe"
//   },
//   "group": "aqa-4",
//   "date": "2020-04-27",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Selenide",
//   "id": "be1328c5-72d5-fbef-ac28-c1e55480f795",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e983a169652970017d5ccff"
//   },
//   "group": "aqa-3",
//   "date": "2020-04-17",
//   "time": "19:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Консультация по дипломному проекту",
//   "id": "4e52ddaa-f1d3-345d-2f2b-0a3716009cbc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e983d0d9652970017d5cd01"
//   },
//   "group": "and-10",
//   "date": "2020-04-20",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Введение в Android. Краткий обзор компонентов",
//   "id": "1e3817f2-2265-35d8-be24-2d712cc6bf48",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e983d269652970017d5cd02"
//   },
//   "group": "and-10",
//   "date": "2020-04-23",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Приложение Hello World",
//   "id": "e29e3e7e-c40f-16ad-e152-6deeab92e579",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e983d539652970017d5cd03"
//   },
//   "group": "and-10",
//   "date": "2020-04-27",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Проектирование интерфейса",
//   "id": "95908f20-34be-c7ad-b9c3-1fc06e9b612c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e983d6d9652970017d5cd041"
//   },
//   "group": "and-10",
//   "date": "2020-04-29",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Компоненты View. Иерархия Views",
//   "id": "0abe20ca-b5a1-3891-4e74-3406413d6ac4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e983d8a9652970017d5cd05"
//   },
//   "group": "and-10",
//   "date": "2020-05-06",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Компоненты ViewGroup. SharedPreferences",
//   "id": "c1f6f73b-89b4-5e47-bb8f-9254f0b43dbe",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e983da89652970017d5cd06"
//   },
//   "group": "and-10",
//   "date": "2020-05-08",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Разбор задач",
//   "id": "64ee2819-e6f4-ea9d-f0a8-19696ec7c518",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9841689652970017d5cd08"
//   },
//   "group": "kt-8",
//   "date": "2020-04-21",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Классы, объекты, наследование",
//   "id": "e808c478-34b5-ed4b-9551-5088256e0098",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9841859652970017d5cd09"
//   },
//   "group": "kt-8",
//   "date": "2020-04-23",
//   "time": "19:00",
//   "teacher": "Иван Лавров",
//   "lecture": "Первое Android приложение",
//   "id": "e1469d4b-bfeb-f9dd-c53d-f88bba43c776",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9841b59652970017d5cd0a"
//   },
//   "group": "kt-8",
//   "date": "2020-04-28",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Функции, лямбды, операторы и обработка событий в Android",
//   "id": "4d35aa24-84b5-a052-c636-4fd269c28e5a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9841c99652970017d5cd0b"
//   },
//   "group": "kt-8",
//   "date": "2020-04-30",
//   "time": "19:00",
//   "teacher": "Иван Лавров",
//   "lecture": "Коллекции, Generics, интерфейсы",
//   "id": "0d1563ab-861a-23cf-a66a-aa5747dd3412",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c26431f7ebf001771e1bc"
//   },
//   "group": "bhj-9",
//   "date": "2020-04-20",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Модули",
//   "id": "38f7ee97-1a08-bba8-15c1-48b0b4d506bb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c268e1f7ebf001771e1bd"
//   },
//   "group": "bhj-9",
//   "date": "2020-04-22",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Unit-тестирование",
//   "id": "1a1f7909-b64a-8ecc-b512-669964d6ee7a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c26e21f7ebf001771e1be"
//   },
//   "group": "bhj-9",
//   "date": "2020-04-24",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Синтаксические конструкции",
//   "id": "ec979181-5af7-5253-a4e5-d392d9a6be03",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c27391f7ebf001771e1bf"
//   },
//   "group": "bjs-11",
//   "date": "2020-04-21",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Базовый синтаксис",
//   "id": "32487488-aa04-25d3-32ad-20828341e4cd",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c278c1f7ebf001771e1c0"
//   },
//   "group": "bjs-11",
//   "date": "2020-04-23",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Расширенный синтаксиc",
//   "id": "8b7f327a-96fe-ebf2-ea45-101bc28ae714",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c27ce1f7ebf001771e1c1"
//   },
//   "group": "html-50",
//   "date": "2020-04-20",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "id": "1276e76d-68ea-ed2f-fc60-6e0d3dd233a8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c28b21f7ebf001771e1c2"
//   },
//   "group": "html-50",
//   "date": "2020-04-22",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для вёрстки структуры контента",
//   "id": "5aa1a4c5-ff9e-5496-41c2-3f673388eb9b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c28db1f7ebf001771e1c3"
//   },
//   "group": "html-50",
//   "date": "2020-04-24",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование блочных элементов",
//   "id": "42fe5a38-e74f-a687-a40f-3b4680032f0f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c29061f7ebf001771e1c4"
//   },
//   "group": "mq-23",
//   "date": "2020-04-21",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивная типографика",
//   "id": "94c3eefd-da86-a3a0-3b8d-ead69ce94f6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c294c1f7ebf001771e1c5"
//   },
//   "group": "mq-23",
//   "date": "2020-04-23",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Breakpoints",
//   "id": "ddbd7d6b-e741-be13-ba68-0b397213cf96",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c2a501f7ebf001771e1c6"
//   },
//   "group": "ra-22",
//   "date": "2020-04-21",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Redux",
//   "id": "93475af4-01fa-f777-f1b8-4f8eabb36688",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c2abe1f7ebf001771e1c7"
//   },
//   "group": "ra-22",
//   "date": "2020-04-23",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Redux и Redux Thunk",
//   "id": "a35195f6-cf72-092d-0644-b909d7893523",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c341f9ccff200175791bb"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-21",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Анимация и CSS",
//   "id": "d542c42d-a0a8-9dd3-ea73-a1ecd7246343",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c345c9ccff200175791bc"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-23",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Geolocation, Notification, Media",
//   "id": "44111e6e-bff4-f5bc-d304-2426c7c59d11",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c519a8cfba50017d486c6"
//   },
//   "group": "srk-2",
//   "date": "2020-04-20",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Модули ",
//   "id": "8fbe4528-26a4-05c6-423b-766fcfac43de",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c53d08cfba50017d486c7"
//   },
//   "group": "onec-1",
//   "date": "2020-04-21",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Элементы управления",
//   "id": "8260cbef-8929-58b4-7cf4-d86b5c93c16c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c54a78cfba50017d486c8"
//   },
//   "group": "srk-2",
//   "date": "2020-04-22",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Переменные и параметры сеанса",
//   "id": "4aa584d1-a6a3-bffc-a514-9c36d67d2222",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c54f38cfba50017d486c9"
//   },
//   "group": "onec-1",
//   "date": "2020-04-23",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Команды",
//   "id": "463d617f-07f0-f7d3-0fb4-59782c5d7896",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9c55c18cfba50017d486ca"
//   },
//   "group": "onec-1",
//   "date": "2020-04-24",
//   "time": "19:00",
//   "teacher": "Сусанна Алиева",
//   "lecture": "Консультация по дипломной работе",
//   "id": "7ee90512-3b93-36a1-5da3-42306e5ed9e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9d583fdf28370017b84c2b"
//   },
//   "group": "pb-12",
//   "date": "2020-04-20",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Строки. Алгоритмы. Как отлаживать код",
//   "id": "ae9df1df-35d0-390a-3402-f32fd7a0e817",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9d59addf28370017b84c2c"
//   },
//   "group": "pb-12",
//   "date": "2020-04-22",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": " Массивы и базовые методы работы с ними",
//   "id": "54ec20d2-18b4-99df-7f62-f9ed8abf5a97",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9d5a12df28370017b84c2d"
//   },
//   "group": "pb-12",
//   "date": "2020-04-24",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Циклы",
//   "id": "721282d9-d8db-c4f5-3683-a28218774db6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed23617d203001755d0b2"
//   },
//   "group": "sd-11",
//   "date": "2020-04-27",
//   "time": "19:00",
//   "teacher": "Ирина Хомутова",
//   "lecture": "Новое знакомство с компьютером",
//   "id": "2008fdf9-b0b4-1e37-8b39-c3202465b898",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed27317d203001755d0b3"
//   },
//   "group": "sd-11",
//   "date": "2020-04-30",
//   "time": "19:00",
//   "teacher": "Ирина Хомутова",
//   "lecture": "Общаемся с компьютером",
//   "id": "a41d9315-1eef-b96f-5052-3cc1aa4d4c8c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed31617d203001755d0b4"
//   },
//   "group": "sd-11",
//   "date": "2020-05-07",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Три кита веба: HTML, CSS, JS",
//   "id": "4665dac9-1b20-eb41-73d5-5e0609bd4024",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed33d17d203001755d0b5"
//   },
//   "group": "sd-11",
//   "date": "2020-05-12",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Интернет - большая библиотека",
//   "id": "30ab0998-6530-5cb8-5c89-6b06086703a6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed35a17d203001755d0b6"
//   },
//   "group": "sd-11",
//   "date": "2020-05-14",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Вся правда о профессии разработчика",
//   "id": "ca0bed5e-f798-9d0a-04e4-78edd9e3016e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed46317d203001755d0b8"
//   },
//   "group": "qa-8",
//   "date": "2020-04-27",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Введение в тестирование ПО. Методы и виды тестирования",
//   "id": "e1f65535-7fd6-d9f2-a976-10e1d2bd11ca",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed47a17d203001755d0b9"
//   },
//   "group": "qa-8",
//   "date": "2020-04-30",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "id": "faa195a9-863d-7db8-ad24-93a07a81074e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed5d117d203001755d0ba"
//   },
//   "group": "qa-8",
//   "date": "2020-05-06",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Тестирование ПО. Многообразие тестирования",
//   "id": "0eb3b091-8766-d9ac-c6d8-1b1ea5e0fb26",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed5e917d203001755d0bb"
//   },
//   "group": "qa-8",
//   "date": "2020-05-07",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "id": "f26c0417-e574-5917-06d2-5d84b9cedd0b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed6a417d203001755d0bc"
//   },
//   "group": "qa-8",
//   "date": "2020-05-08",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Артефакты тестирования",
//   "id": "620564fa-3487-43f7-de95-ab0069393490",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9ed76917d203001755d0bd"
//   },
//   "group": "qa-8",
//   "date": "2020-05-12",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Инструменты тестирования",
//   "additional": "",
//   "id": "0bb1a052-ff7a-d37b-6920-f19f954e3e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9edbcc17d203001755d0bf"
//   },
//   "group": "srk-2",
//   "date": "2020-04-27",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Типы данных",
//   "id": "fa27e444-1f8b-cca2-27ac-254b8ca191b9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5e9edc4117d203001755d0c0"
//   },
//   "group": "srk-2",
//   "date": "2020-04-29",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Даты и строки",
//   "id": "207061b0-53e3-d097-bfa8-4cbad3baaf5e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea191ab03edc900176bf878"
//   },
//   "group": "qa-6",
//   "date": "2020-04-24",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Введение в Java: JDK, JRE, JVM, IntelliJ IDEA",
//   "additional": "",
//   "id": "b2fa2179-2481-a6f8-0944-a692628746e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea191e803edc900176bf879"
//   },
//   "group": "qa-6",
//   "date": "2020-04-28",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Программирование на Java: переменные, операторы, работа с отладчиком",
//   "additional": "",
//   "id": "02eaa4a6-9d21-da0c-3adc-a906f93a191d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea191fd03edc900176bf87a"
//   },
//   "group": "qa-6",
//   "date": "2020-04-30",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Примитивные типы данных, условные операторы, выход за границы типов и погрешность вычислений",
//   "additional": "",
//   "id": "95d32a37-39bd-f571-5237-1277cf50daf1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea1921f03edc900176bf87b"
//   },
//   "group": "qa-6",
//   "date": "2020-05-06",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Testability, автотесты, введение в ООП: объекты и методы",
//   "additional": "",
//   "id": "00bebb63-c7d6-3b26-3284-8771ae971864",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea1923f03edc900176bf87c"
//   },
//   "group": "qa-6",
//   "date": "2020-05-08",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Система сборки Maven, управление зависимостями, автотесты на JUnit5",
//   "additional": "",
//   "id": "b6e3b289-6ceb-0b3f-58ea-413ea4366d6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea1925403edc900176bf87d"
//   },
//   "group": "qa-6",
//   "date": "2020-05-12",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Циклы, параметризованные тесты и аннотации",
//   "additional": "",
//   "id": "6f79bb2a-a0a4-0ba7-9736-8b3552a8d4ac",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea1926f03edc900176bf87e"
//   },
//   "group": "qa-6",
//   "date": "2020-05-14",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Выстраивание процесса непрерывной интеграции (CI): Github Actions. Покрытие кода с JaCoCo, статический анализ кода: CheckStyle, SpotBugs",
//   "additional": "",
//   "id": "19fcc54f-ac9f-218b-fe96-dedbaa938e33",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea1b0e19f120e0017252cf0"
//   },
//   "group": "srk-2",
//   "date": "2020-05-11",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Условия",
//   "id": "b3d65971-41f3-3bf4-c413-c5224c9c589d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea1b14e9f120e0017252cf1"
//   },
//   "group": "srk-2",
//   "date": "2020-05-13",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Циклы",
//   "id": "6f01c1a0-62b0-4694-6ebc-ec9ac92cc0fd",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea1b1c79f120e0017252cf2"
//   },
//   "group": "srk-2",
//   "date": "2020-05-15",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Универсальные коллекции",
//   "id": "0aa85409-05c6-c6d5-dfdf-8b5c913650ce",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea1b2249f120e0017252cf3"
//   },
//   "group": "srk-2",
//   "date": "2020-05-18",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Объекты платформы",
//   "id": "cda56bb3-9b59-fc9e-92b6-7542d1149f45",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea5845426b85b00176ad39d"
//   },
//   "group": "bhj-9",
//   "date": "2020-04-28",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Свойства объектов, обёртки для примитивов",
//   "id": "7674d057-5c6f-356d-cc77-bf0c002fd034",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea584a026b85b00176ad39e"
//   },
//   "group": "bhj-9",
//   "date": "2020-04-30",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Прототипы, конструкторы",
//   "id": "9a8b3a70-dea3-827b-8979-b19c28760360",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea58f3c7c0ffe0017638e60"
//   },
//   "group": "bafe-9",
//   "date": "2020-04-27",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Вводная лекция с координатором курса",
//   "id": "61ea139c-cba0-d79e-c88e-cf7729dfd226",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea58f637c0ffe0017638e61"
//   },
//   "group": "bafe-9",
//   "date": "2020-04-28",
//   "time": "19:30",
//   "teacher": "Алексей Стегура",
//   "lecture": "Как замотивировать себя на учёбу",
//   "id": "87925093-8d8e-a858-ed19-03de786b125d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea591b27c0ffe0017638e62"
//   },
//   "group": "bjs-11",
//   "date": "2020-04-27",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Типы данных",
//   "id": "c740173d-9819-5bee-8d18-532ff7352a81",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea591ec7c0ffe0017638e63"
//   },
//   "group": "bjs-11",
//   "date": "2020-04-29",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Функции, объекты",
//   "id": "b5600494-c47e-fcdb-3d90-d1de5f7af5e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea593837c0ffe0017638e64"
//   },
//   "group": "html-50",
//   "date": "2020-04-27",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Вёрстка форм",
//   "id": "f2f0aed1-1292-2f1c-162e-b1a5dbed0da9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea593ab7c0ffe0017638e65"
//   },
//   "group": "html-50",
//   "date": "2020-04-29",
//   "time": "18:00",
//   "teacher": "Александр Фитискин",
//   "lecture": "Нестандартные элементы форм",
//   "id": "adf33345-27eb-fa1d-7cbc-a64016159302",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea5941d7c0ffe0017638e66"
//   },
//   "group": "mq-23",
//   "date": "2020-04-27",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивные изображения",
//   "id": "e563e0f4-2d95-404a-aecf-0c30150e9173",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea594387c0ffe0017638e67"
//   },
//   "group": "mq-23",
//   "date": "2020-04-29",
//   "time": "18:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "id": "3f54f729-0439-3607-ddbb-ac537281a744",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea594b57c0ffe0017638e68"
//   },
//   "group": "mq-24",
//   "date": "2020-04-29",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Верстка резинового макета",
//   "id": "a4f0c0b3-f3cc-e49c-3cf5-f618d3cea85a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea597bb7c0ffe0017638e69"
//   },
//   "group": "ra-22",
//   "date": "2020-04-28",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Redux Observable",
//   "id": "0f11ca08-bab1-292f-57c2-40ac64fec9fe",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea598197c0ffe0017638e6a"
//   },
//   "group": "ra-22",
//   "date": "2020-04-30",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Redux Saga",
//   "id": "b5b8e1d7-1c85-c0de-7da2-6c17aebca18a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea598bc7c0ffe0017638e6b"
//   },
//   "group": "ahj-6",
//   "date": "2020-04-29",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "RxJS",
//   "id": "56ce7049-0e1e-a7cf-9e4c-6d6f7777483c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea69b8882898f00170ecc04"
//   },
//   "group": "java-12",
//   "date": "2020-04-29",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Массивы одномерные",
//   "additional": "",
//   "id": "fd3bebe8-17b2-ae13-bc3e-54c6c3023b31",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea69bb682898f00170ecc05"
//   },
//   "group": "java-12",
//   "date": "2020-05-06",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Массивы многомерные",
//   "additional": "",
//   "id": "976b8a6d-fc5d-4e1c-0b3f-0f938d0d3557",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea69bf982898f00170ecc06"
//   },
//   "group": "java-12",
//   "date": "2020-05-08",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структура класса",
//   "additional": "",
//   "id": "68731cc7-ec52-8a5b-983f-6833738baa7f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea69c1b82898f00170ecc07"
//   },
//   "group": "java-12",
//   "date": "2020-05-12",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Модификаторы доступа, наследование",
//   "additional": "",
//   "id": "5db7f791-93d5-9936-d802-c4b2a16761ac",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea69c4382898f00170ecc08"
//   },
//   "group": "java-12",
//   "date": "2020-05-14",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Полиморфизм",
//   "additional": "",
//   "id": "8f058617-8589-e0cc-f4f9-b4151a6cad35",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea69c6582898f00170ecc09"
//   },
//   "group": "java-12",
//   "date": "2020-05-18",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Абстракции и интерфейсы",
//   "additional": "",
//   "id": "77b62929-3181-cc36-7869-c86acc1c4c18",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea69c7e82898f00170ecc0a"
//   },
//   "group": "unknown",
//   "date": "2020-05-20",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Исключения, Stacktrace, регулярные выражения",
//   "additional": "",
//   "id": "6ec29b4f-3833-4c02-c99e-ce4061cd97e8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea69c9b82898f00170ecc0b"
//   },
//   "group": "java-12",
//   "date": "2020-05-22",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Разбор задач",
//   "additional": "",
//   "id": "b804b4eb-9b78-6317-b7a0-98d5429f00da",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea7d7aa96e1830017ca890b"
//   },
//   "group": "pb-12",
//   "date": "2020-04-28",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Ассоциативные массивы",
//   "id": "cd4f76f0-891f-11ea-a713-715b85e2dfdc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ea7d88c96e1830017ca890c"
//   },
//   "group": "pb-12",
//   "date": "2020-04-30",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Функция без параметров. Область видимости",
//   "id": "538ba180-8920-11ea-a713-715b85e2dfdc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb048383a28b10017a1fee1"
//   },
//   "group": "srk-2",
//   "date": "2020-05-20",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Процедуры и функции",
//   "id": "9780a280-8e27-11ea-8cf3-73f76ae7126f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb1d1c609773b00176f0727"
//   },
//   "group": "bhj-9",
//   "date": "2020-05-06",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Классы, наследование",
//   "id": "2b3183b0-8f12-11ea-b7a7-7525d8978a1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb1d20809773b00176f0728"
//   },
//   "group": "bjs-11",
//   "date": "2020-05-06",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Прототип и конструктор объекта",
//   "id": "528f5590-8f12-11ea-b7a7-7525d8978a1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb1d22409773b00176f0729"
//   },
//   "group": "ra-22",
//   "date": "2020-05-06",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "id": "6345e610-8f12-11ea-b7a7-7525d8978a1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb1d23d09773b00176f072a"
//   },
//   "group": "html-50",
//   "date": "2020-05-06",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Всплывающие элементы",
//   "id": "71e75230-8f12-11ea-b7a7-7525d8978a1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb1d29409773b00176f072b"
//   },
//   "group": "ahj-6",
//   "date": "2020-05-06",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "WebWorkers, ServiceWorkers",
//   "id": "a5b7f060-8f12-11ea-b7a7-7525d8978a1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb2837eb857be0017d2368c"
//   },
//   "group": "pb-12",
//   "date": "2020-05-07",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Параметры и возвращаемое значение",
//   "id": "19240890-8f7c-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28c31b857be0017d2368d"
//   },
//   "group": "java-11",
//   "date": "2020-05-08",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Коллекции Queue",
//   "additional": "",
//   "id": "480ce820-8f81-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28c4db857be0017d2368e"
//   },
//   "group": "java-11",
//   "date": "2020-05-12",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции HashSet и HashMap",
//   "additional": "",
//   "id": "59494a70-8f81-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28c78b857be0017d2368f"
//   },
//   "group": "java-11",
//   "date": "2020-05-14",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Коллеции TreeSet",
//   "additional": "",
//   "id": "72959420-8f81-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28c94b857be0017d23690"
//   },
//   "group": "java-11",
//   "date": "2020-05-19",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Коллеции TreeMap",
//   "additional": "",
//   "id": "836997b0-8f81-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28cb3b857be0017d23691"
//   },
//   "group": "java-11",
//   "date": "2020-05-22",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Разбор задач",
//   "additional": "",
//   "id": "95f117a0-8f81-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28d12b857be0017d23692"
//   },
//   "group": "and-9",
//   "date": "2020-05-07",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Работа с файлами в Android: внешние файлы",
//   "additional": "",
//   "id": "ce7a0dc0-8f81-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28d32b857be0017d23693"
//   },
//   "group": "and-9",
//   "date": "2020-05-12",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Работа с файлами в Android: внутренние файлы",
//   "additional": "",
//   "id": "e17425a0-8f81-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28d4eb857be0017d23694"
//   },
//   "group": "and-9",
//   "date": "2020-05-14",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Жизненный цикл Activity",
//   "additional": "",
//   "id": "f2303460-8f81-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28d6bb857be0017d23695"
//   },
//   "group": "and-9",
//   "date": "2020-05-18",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Android Intents. Переход между экранами с передачей данных",
//   "additional": "",
//   "id": "032de000-8f82-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28d9eb857be0017d23697"
//   },
//   "group": "and-9",
//   "date": "2020-05-26",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Разбор задач",
//   "additional": "",
//   "id": "21b0b250-8f82-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28dd1b857be0017d23698"
//   },
//   "group": "kt-8",
//   "date": "2020-05-08",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Создание Backend на Ktor - CRUD",
//   "additional": "",
//   "id": "40041030-8f82-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28de6b857be0017d23699"
//   },
//   "group": "kt-8",
//   "date": "2020-05-12",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Создание Backend на Ktor - авторизация",
//   "additional": "",
//   "id": "4c97aaf0-8f82-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28dfab857be0017d2369a"
//   },
//   "group": "kt-8",
//   "date": "2020-05-14",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Android: Activity, навигация, авторизация",
//   "additional": "",
//   "id": "58d31390-8f82-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28e14b857be0017d2369b"
//   },
//   "group": "kt-8",
//   "date": "2020-05-19",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Android: Загрузка данных по API, CRUD",
//   "additional": "",
//   "id": "67fe2210-8f82-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28e4eb857be0017d2369c"
//   },
//   "group": "kt-8",
//   "date": "2020-05-22",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Android: Работа с камерой, Notifications API",
//   "additional": "",
//   "id": "8a7ba1a0-8f82-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28e91b857be0017d2369d"
//   },
//   "group": "kt-8",
//   "date": "2020-05-26",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Push-уведомления: серверная и клиентская часть",
//   "additional": "",
//   "id": "b2f2abb0-8f82-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28fc1b857be0017d2369f"
//   },
//   "group": "iqa-8",
//   "date": "2020-05-07",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "",
//   "id": "67dd1010-8f83-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb28fd9b857be0017d236a0"
//   },
//   "group": "iqa-8",
//   "date": "2020-05-08",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Артефакты тестирования",
//   "additional": "",
//   "id": "76709980-8f83-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb29001b857be0017d236a1"
//   },
//   "group": "iqa-8",
//   "date": "2020-05-12",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Инструменты тестирования",
//   "additional": "",
//   "id": "8e117d20-8f83-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb29014b857be0017d236a2"
//   },
//   "group": "iqa-8",
//   "date": "2020-05-14",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Жизненный цикл разработки ПО. Гибкие методологии разработки ПО",
//   "additional": "",
//   "id": "997b3de0-8f83-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb290a4b857be0017d236a3"
//   },
//   "group": "aqa-4",
//   "date": "2020-05-08",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Docker и Docker Compose",
//   "id": "eef8c530-8f83-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb290b9b857be0017d236a4"
//   },
//   "group": "aqa-4",
//   "date": "2020-05-12",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "SQL",
//   "id": "fbb4cf80-8f83-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb290ceb857be0017d236a5"
//   },
//   "group": "aqa-4",
//   "date": "2020-05-14",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Репортинг: Report Portal",
//   "id": "07f2d030-8f84-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb290f1b857be0017d236a6"
//   },
//   "group": "aqa-4",
//   "date": "2020-05-18",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Заключительная лекция",
//   "id": "1cf429c0-8f84-11ea-ae7d-49016f2b6c61",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb2d236e347870017bdf015"
//   },
//   "group": "bhj-9",
//   "date": "2020-05-08",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контейнеры",
//   "id": "043f7a70-8fab-11ea-9aa1-e9584c843bb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb2d2c8e347870017bdf016"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-07",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Возможности JavaScript в браузере",
//   "id": "5b409480-8fab-11ea-9aa1-e9584c843bb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb2d2f7e347870017bdf017"
//   },
//   "group": "bjs-11",
//   "date": "2020-05-08",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "ООП в JS (ES6)",
//   "id": "775fd450-8fab-11ea-9aa1-e9584c843bb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb2d31ce347870017bdf018"
//   },
//   "group": "html-50",
//   "date": "2020-05-08",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование flex-элементов",
//   "id": "8dc8ad20-8fab-11ea-9aa1-e9584c843bb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb2d356e347870017bdf019"
//   },
//   "group": "mq-24",
//   "date": "2020-05-07",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Резиновые изображения",
//   "id": "affbdd40-8fab-11ea-9aa1-e9584c843bb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb2d386e347870017bdf01a"
//   },
//   "group": "ahj-6",
//   "date": "2020-05-07",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "id": "cd015e60-8fab-11ea-9aa1-e9584c843bb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb2dbc9e347870017bdf01b"
//   },
//   "group": "my_for-test",
//   "date": "2020-05-07",
//   "time": "19:00",
//   "teacher": "Сусанна",
//   "lecture": "Занятие по переименованию",
//   "id": "b9235ce0-8fb0-11ea-9aa1-e9584c843bb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb3cc5b79b2190017c477d0"
//   },
//   "group": "onec-1",
//   "date": "2020-05-13",
//   "time": "19:15",
//   "teacher": "Станислав Вильф",
//   "lecture": "Справочники",
//   "id": "1db10ab0-9040-11ea-8aeb-316586028d40",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb3ccc879b2190017c477d1"
//   },
//   "group": "onec-1",
//   "date": "2020-05-15",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Иерархия и подчинение",
//   "id": "5e7034e0-9040-11ea-8aeb-316586028d40",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb3cde279b2190017c477d2"
//   },
//   "group": "onec-1",
//   "date": "2020-05-19",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Формы справочников",
//   "id": "068b7c20-9041-11ea-8aeb-316586028d40",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb3ce1e79b2190017c477d3"
//   },
//   "group": "onec-1",
//   "date": "2020-05-22",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Регистры сведений",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "2a805970-9041-11ea-8aeb-316586028d40",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb3ce5079b2190017c477d4"
//   },
//   "group": "onec-1",
//   "date": "2020-05-25",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Запись и чтение регистров",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "48179340-9041-11ea-8aeb-316586028d40",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb3ce8479b2190017c477d5"
//   },
//   "group": "onec-1",
//   "date": "2020-05-28",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "66ecf260-9041-11ea-8aeb-316586028d40",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb3e77270850b0017c32cdd"
//   },
//   "group": "my_for-test",
//   "date": "2020-05-08",
//   "time": "15:43",
//   "teacher": "Станислав Вильф",
//   "lecture": "Интерфейс конфигурации",
//   "additional": "nНа вебинаре вы узнаете:n-из каких частей состоит управляемый интерфейс;n-как настраивается каждая часть интерфейса;n-как связаны подсистемы и пользовательский интерфейс;n-как команды размещаются в интерфейсе;n-как настроить расположение основных панелей;n-что такое команда и как она размещается в интерфейсе;n-что такое «основная форма;n-как настроить отображение названий объектов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "43267a40-9050-11ea-af82-c1bfbc64ab75",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb41fc7313be900177e08d8"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-08",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Возможности JavaScript в браузере",
//   "additional": "На занятии вы узнаете: n- Принципом построения DOM в браузере;n- С объектами HTML-тегов; n- BOM. Объект Window nЖдём вас на вебинаре!",
//   "id": "d6c35090-9071-11ea-a089-61832899e83b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb4293f313be900177e08da"
//   },
//   "group": "onec-3",
//   "date": "2020-05-18",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Введение в платформу",
//   "additional": "nНа вебинаре вы узнаете о:n-том, что такое «платформа» и для чего она создавалась;n-предметно-ориентированном «Встроенном языке»;n-фирме «1С» и истории платформы;n-прикладных решениях;n-среде исполнения;n-лицензии и учебной версии;n-среде разработки;n-а также об информационной базе и конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "7b66e3f0-9077-11ea-a089-61832899e83b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb429e1313be900177e08db"
//   },
//   "group": "onec-3",
//   "date": "2020-05-20",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Среда разработки и конфигурация",
//   "additional": "nНа лекции вы узнаете:n-что такое конфигуратор для чего его используют;n-конфигурации, модулях и основных свойствах конфигурации; n-видах и обновлениях конфигурации.nnНаучитесь:n-сравнивать и объединять;n-обновлять и проверять конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "dc04c6f0-9077-11ea-a089-61832899e83b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb42a47313be900177e08dc"
//   },
//   "group": "onec-3",
//   "date": "2020-05-25",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Дерево метаданных",
//   "additional": "nНа занятии вы узнаете:n-что такое дерево метаданных и объект метаданных;n-какими бывают общие метаданные;n-зачем нужны подсистемы, картинки, элементы стиля, функциональные опции, константы, справочники и перечисления.nnК тому же вы научитесь:n-создавать функциональные опции и константы;n-создавать перечисления;n-создавать справочники.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "190848b0-9078-11ea-a089-61832899e83b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb42ab8313be900177e08dd"
//   },
//   "group": "onec-3",
//   "date": "2020-05-28",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Виды клиентов и режимы работы",
//   "additional": "nНа занятии вы узнаете:n-что такое обычное и управляемое приложение;n-что такое управляемые формы;n-чем отличаются тонкий клиент, толстый клиент, веб-клиент и мобильный клиент.nnА так же научитесь:n-делать простейшие управляемые формы;n-публиковать веб-клиент.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "5c672400-9078-11ea-a089-61832899e83b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb42b26313be900177e08de"
//   },
//   "group": "onec-3",
//   "date": "2020-06-01",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Пользователи и отладка",
//   "additional": "nНа занятии вы узнаете:n-что такое пользователи ИБ и их роли;n-что такое журнал регистрации;n-что такое отладка и точка останова;n-что такое система взаимодействия.nnТакже научитесь:n-создавать пользователей ИБ, роли и назначать их пользователям;n-искать ошибки в журнале регистрации;n-использовать отладчик для расследования ошибок;n-подключать систему взаимодействия.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9dcec330-9078-11ea-a089-61832899e83b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb42bb0313be900177e08df"
//   },
//   "group": "onec-3",
//   "date": "2020-06-03",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Внешние отчеты, обработки и расширения",
//   "additional": "nНа занятии вы узнаете:n-что такое внешние отчеты и обработки, и в чем разница между ними;n-что такое расширения конфигурации.nnНаучитесь:n-создавать простейшие внешние отчеты, обработки и расширения.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "efd01c10-9078-11ea-a089-61832899e83b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb42c88313be900177e08e0"
//   },
//   "group": "onec-3",
//   "date": "2020-05-26",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "nНа занятии вы узнаете об основных принципах, технологиях поиска необходимой информации, а также о выборе источника.nnЛекция — общеобразовательная. Домашнего задания по ней не будет)n nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "70ad4e70-9079-11ea-a089-61832899e83b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb500eaca48570017909d26"
//   },
//   "group": "pb-12",
//   "date": "2020-05-08",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nМы узнаем: n  - как получить допуск к дипломной работе;n  - что из себя представляет дипломный проект и кто поможет нам в работе над ним;n  - Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса.nnБудем рады видеть вас онлайн!",
//   "id": "079a3fe0-90f8-11ea-ad7e-aba2172b4ef9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb56490be024900178a96cc"
//   },
//   "group": "srk-2",
//   "date": "2020-05-25",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Интерфейс конфигурации",
//   "additional": "nНа вебинаре вы узнаете:n-из каких частей состоит управляемый интерфейс;n-как настраивается каждая часть интерфейса;n-как связаны подсистемы и пользовательский интерфейс;n-как команды размещаются в интерфейсе;n-как настроить расположение основных панелей;n-что такое команда и как она размещается в интерфейсе;n-что такое «основная форма;n-как настроить отображение названий объектов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "6d07aa80-9133-11ea-bc27-430562d03ca0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb565bfbe024900178a96cd"
//   },
//   "group": "srk-2",
//   "date": "2020-05-28",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Формы, их реквизиты и данные",
//   "additional": "nНа лекции вы узнаете:n-почему управляемая форма делится на серверную и клиентскую части;n-из каких частей состоит форма;n-что такое реквизиты формы;n-что такое элементы формы;n-что такое параметры формы;n-что такое команды формы;n-как располагать элементы горизонтально и выделять группы элементов визуально;n-как писать клиентские и серверные методы;n-что такое «с контекстом» и «без контекста».nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "215b4d20-9134-11ea-bc27-430562d03ca0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb56638be024900178a96ce"
//   },
//   "group": "srk-2",
//   "date": "2020-06-01",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Элементы управления",
//   "additional": "nНа лекции вы узнаете про:n-общие свойства элементов управления и их иерархию;n-декоративные элементы;n-флажки, переключатели, тумблеры;n-поля ввода и управляющие кнопки полей ввода;n-свойство «СписокВвода» и его влияние на элемент;n-механику выбора значений;n-страницы форм.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "69b57cd0-9134-11ea-bc27-430562d03ca0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb566b2be024900178a96cf"
//   },
//   "group": "srk-2",
//   "date": "2020-06-04",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Команды",
//   "additional": "nНа лекции вы:n-углубите знания по командам;n-изучите особенности модуля команд, директив компиляции;n-рассмотрите назначение параметра ПараметрыВыполненияКоманды;n-рассмотрите отличия общих (глобальных) команд и команд, -подчиненных объекту метаданных;n-рассмотрите  командный интерфейс формы;n-рассмотрите  наиболее частые сценарии открытия форм из модуля команды;n-изучите служебные системные параметры открытия форм.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b284dc80-9134-11ea-bc27-430562d03ca0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb6739b9c37f92c4cc25459"
//   },
//   "group": "unknown",
//   "date": "2020-05-09",
//   "time": "13:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "ыфвафыва",
//   "additional": "ыфваыnчмчафвыаnываыфваnчясмчс",
//   "id": "fad356b0-91d4-11ea-8dec-4f288411ef0f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb812ee6d5e3c0017cb6947"
//   },
//   "group": "logs",
//   "date": "2020-05-10",
//   "time": "17:42",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Базовый синтаксис",
//   "additional": "На лекции вы узнаете:n1. Переменные и константы, допустимые имена, правила именованияn2. Выражения, операторы и операндыn3. DevTools и console.logn4. Числаn5. Строки",
//   "id": "881172d0-92cc-11ea-990a-bbda33af786f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb8f315009f9d001703e83e"
//   },
//   "group": "my_for-test",
//   "date": "2020-05-12",
//   "time": "09:50",
//   "teacher": "Станислав Вильф",
//   "lecture": "проверка фотки",
//   "additional": "Поболтаем о том о сём",
//   "id": "2343d1f0-9352-11ea-9e18-65b6a8303944",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb8f446009f9d001703e841"
//   },
//   "group": "my_for-test",
//   "date": "2020-05-12",
//   "time": "09:42",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Интерфейс конфигурации",
//   "additional": "поболтаем",
//   "id": "d9066de0-9352-11ea-9e18-65b6a8303944",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb8f5a2009f9d001703e843"
//   },
//   "group": "my_for-test",
//   "date": "2020-05-12",
//   "time": "09:49",
//   "teacher": "Станислав Вильф",
//   "lecture": "проверка фотки",
//   "additional": "поболтаем",
//   "id": "a87fd520-9353-11ea-9e18-65b6a8303944",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb8f728009f9d001703e848"
//   },
//   "group": "my_for-test",
//   "date": "2020-05-12",
//   "time": "09:55",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "проверка",
//   "additional": "nпоболтаем",
//   "id": "90ef01a0-9354-11ea-9e18-65b6a8303944",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb98f4a96532f0017c60a27"
//   },
//   "group": "html-50",
//   "date": "2020-05-12",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На занятии вы узнаете:n- что из себя представляет работа над дипломным проектом;n- из каких этапов она состоит;n- что нужно сделать, чтобы получить допуск. nnБольшинство из вас прекрасно показали себя на курсе, так что мы уверены, что вы отлично справитесь!",
//   "id": "3eb153b0-93af-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb98f9596532f0017c60a28"
//   },
//   "group": "bjs-11",
//   "date": "2020-05-12",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Обработка ошибок и замыкания",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Внутренние исключений выполненияn2. Создание собственных исключенийn3. Перехват исключенийn4. Консольные методы для удобной работыn5. Области видимостиn6. Замыканияn7. Конструкция delete",
//   "id": "6b58e810-93af-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb98fca96532f0017c60a29"
//   },
//   "group": "bjs-11",
//   "date": "2020-05-15",
//   "time": "18:00",
//   "teacher": "Евгений Шек",
//   "lecture": "Прототип массива, функции высшего порядка",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Константы и массивыn2. Поиск в массивеn3. Функции высшего порядкаn4. Расширенный поиск в массивеn5. Преобразование массива",
//   "id": "8ab180f0-93af-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb9935596532f0017c60a2a"
//   },
//   "group": "bhj-9",
//   "date": "2020-05-13",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Math, Regexp, ArrayBuffer",
//   "additional": "На занятии вы узнаете:n- что такое “регулярные выражения”;n- а также все про Math и ArrayBuffer.",
//   "id": "a7447f40-93b1-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb993e996532f0017c60a2b"
//   },
//   "group": "bhj-9",
//   "date": "2020-05-15",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Promises, async/await",
//   "additional": "На занятии вы узнаете:n- про асинхронный код и его тестирование;n- про использование promise;n- а также как сделать работу с Promise удобнее, используя ключевые слова async/await.",
//   "id": "ffc13cd0-93b1-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb9942d96532f0017c60a2c"
//   },
//   "group": "bafe-9",
//   "date": "2020-05-13",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "На лекции будут раскрыты следующие вопросы:n- как работает интернетn- протокол HTTPn- что такое серверnи многое другое.nЖдем вас на лекции!",
//   "id": "2806d6a0-93b2-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb9946d96532f0017c60a2d"
//   },
//   "group": "bafe-9",
//   "date": "2020-05-15",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Путь frontend-разработчика",
//   "additional": "Вы узнаете о том, из чего состоит путь разработчика, какие есть перспективы. Приходите, будет увлекательно!",
//   "id": "4e31f4e0-93b2-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb9960b96532f0017c60a2e"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-13",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Способы поиска нужного HTML-элемента",
//   "additional": "Мы узнаем о $0 в консоли, познакомимся с HTMLCollection и различными доступами к элементам. Ждем вас на вебинаре!n",
//   "id": "44d85a00-93b3-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb9965496532f0017c60a2f"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-15",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Объект события",
//   "additional": "Лектор расскажет, какие проблемы может вызывать использование свойства onclick, и как по-другому можно назначить и удалить обработчики событий элемента. Подробно рассмотрим объект события, содержащий подробную информацию об обрабатываемом событии, свойства событий и обработку событий клавиатуры.nДо встречи на вебинаре!",
//   "id": "70ce78b0-93b3-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb996d696532f0017c60a30"
//   },
//   "group": "mq-24",
//   "date": "2020-05-12",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Введение в медиа-запросы",
//   "additional": "Следующий пункт нашего путешествия – освоение мобильной вёрстки. На занятии Семён Бойко расскажет вам о мобильной версии как подходе к верстке, плюсах и минусах этого подхода, разберёт медиа-запросы для различных типов устройств и особенности их использования. nТакже будет уделено внимание специальному режиму эмуляции устройств в веб-инспекторе браузера для тестирования отображения сайта в различных условиях. И в дополнение к изученным ранее свойствам Flexbox будут ещё рассмотрены такие полезные свойства как flex-wrap и align-content, которые отвечают за перенос строк и их выравнивание внутри флекс-контейнера. nЖдём вас на лекции!",
//   "id": "bdc2a2e0-93b3-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb9971896532f0017c60a31"
//   },
//   "group": "mq-24",
//   "date": "2020-05-14",
//   "time": "19:00",
//   "teacher": "Антон Варнавский",
//   "lecture": "Медиа-функции",
//   "additional": "Преподаватель подробно расскажет о медиа-функциях, позволяющих проверить различные характеристики устройства, на котором открыта страничка; затронет особенности взаимодействия пользователя с веб-страницей с помощью пальцев; особенности: hover на мобильных устройствах и особенности элементов интерфейса, с которыми удобно взаимодействовать мышкой, но неудобно пальцами с сенсорных устройств. nЖдём вас на лекции!",
//   "id": "e54a9200-93b3-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eb99da796532f0017c60a33"
//   },
//   "group": "test1",
//   "date": "2020-05-10",
//   "time": "00:30",
//   "teacher": "Семён Бойко",
//   "lecture": "какое-то занятие",
//   "additional": "тема 1nтема 2nтема 3",
//   "id": "ce450730-93b7-11ea-8e85-2521b9053b62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba7f6ae663010017cac1e9"
//   },
//   "group": "and-10",
//   "date": "2020-05-15",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Верстка графического интерфейса в Android",
//   "additional": "Занятие обещает быть насыщенным и интересным. Ждем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "5ea89090-943e-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba7f93e663010017cac1ea"
//   },
//   "group": "and-10",
//   "date": "2020-05-19",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Другие Виды Layouts",
//   "additional": "Занятие обещает быть насыщенным и интересным. Ждем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "771ca2b0-943e-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba7fb8e663010017cac1eb"
//   },
//   "group": "and-10",
//   "date": "2020-05-21",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "App resources, Config qualifier",
//   "additional": "Занятие обещает быть насыщенным и интересным. Ждем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "8d601930-943e-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba7fe5e663010017cac1ec"
//   },
//   "group": "and-10",
//   "date": "2020-05-25",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Android styles",
//   "additional": "Занятие обещает быть насыщенным и интересным. Ждем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "a82df9d0-943e-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba8013e663010017cac1ed"
//   },
//   "group": "and-10",
//   "date": "2020-05-27",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Списки Android: базовые",
//   "additional": "Занятие обещает быть насыщенным и интересным. Ждем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "c39d2380-943e-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba80a1e663010017cac1f0"
//   },
//   "group": "and-10",
//   "date": "2020-06-01",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Работа с конфигурируемым интерфейсом на примере списков. Классы Adapter, AdapterView",
//   "additional": "Занятие обещает быть насыщенным и интересным. Ждем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "17d4bd50-943f-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba80b9e663010017cac1f1"
//   },
//   "group": "and-10",
//   "date": "2020-06-03",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Разбор задач",
//   "additional": "Занятие обещает быть насыщенным и интересным. Ждем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "2670f950-943f-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba83c1e663010017cac1f3"
//   },
//   "group": "WM_55",
//   "date": "2020-05-15",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Теги для разметки текста и атрибуты",
//   "additional": "nНа занятии вы узнаете:n- что такое браузер и что он делает;n- что такое HTML и для чего он был создан;n- что такое тег и какие они бывают.",
//   "id": "f49a1d60-9440-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba842be663010017cac1f4"
//   },
//   "group": "WM_55",
//   "date": "2020-05-19",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Списки и таблицы",
//   "additional": "nВы узнаете:n- что такое список и какие виды списков бывают;n- для чего используют таблицы в вёрстке и какой у них синтаксис.",
//   "id": "34010a90-9441-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba8460e663010017cac1f5"
//   },
//   "group": "WM_55",
//   "date": "2020-05-21",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Селекторы и свойства",
//   "additional": "nНа лекции вы узнаете:n- что такое CSS и где его нужно писать;n- как записать CSS-правило и из чего оно состоит.",
//   "id": "53d56320-9441-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba84a3e663010017cac1f6"
//   },
//   "group": "WM_55",
//   "date": "2020-05-25",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Оформление текстовых блоков с использованием CSS",
//   "additional": "nДенис расскажет:n- что такое селектор класса и как его записать;n- какие есть свойства для стилизации шрифта;n- что такое цветовая модель RGB и какие есть способы для задания цвета.",
//   "id": "7ba6b750-9441-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba84e4e663010017cac1f7"
//   },
//   "group": "WM_55",
//   "date": "2020-05-28",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "nВладимир расскажет вам:n- как функционируют браузер и интернет;n- чем занимаются фронтенд и бэкенд разработчики.",
//   "id": "a2409cf0-9441-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba9a93e663010017cac204"
//   },
//   "group": "my_for_test",
//   "date": "2020-05-13",
//   "time": "15:45",
//   "teacher": "Андрей Чередников",
//   "lecture": "Проверка на крепление",
//   "additional": "Пытаюсь научиться работать с прикрепленными занятиями",
//   "id": "8eca8b60-944e-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba9b38e663010017cac205"
//   },
//   "group": "my_for_test",
//   "date": "2020-05-14",
//   "time": "15:48",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Проверка на крепление",
//   "additional": "Пытаюсь научиться работать с прикрепленными занятиями",
//   "id": "f14f08b0-944e-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eba9b54e663010017cac206"
//   },
//   "group": "my_for_test",
//   "date": "2020-05-15",
//   "time": "15:49",
//   "teacher": "Сусанна",
//   "lecture": "Проверка на крепление",
//   "additional": "Пытаюсь научиться работать с прикрепленными занятиями",
//   "id": "02338700-944f-11ea-9b61-eb4f7449e1dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ebb882ae73a9d00179e0a93"
//   },
//   "group": "bjs-test",
//   "date": "2020-05-13",
//   "time": "08:39",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Расширенный синтаксис JavaScript",
//   "id": "2c67d660-94dc-11ea-a999-57a261ebaad3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ebb8893e73a9d00179e0a94"
//   },
//   "group": "bjs-test",
//   "date": "2020-05-13",
//   "time": "08:41",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Типы данных",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Типы данныхn2. Примитивы и объекты. Данные по значению и по ссылкеn3. Обертки для примитивовn4. Методы типов данныхn5. Проверка и преобразование типов",
//   "id": "6aea2ff0-94dc-11ea-a999-57a261ebaad3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ebd8336e4fb9e00177a59a1"
//   },
//   "group": "mq-24",
//   "date": "2020-05-15",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Медиа-функции",
//   "additional": "На лекции преподаватель подробно расскажет о медиа-функциях, позволяющих проверить различные характеристики устройства, на котором открыта страничка; затронет особенности взаимодействия пользователя с веб-страницей с помощью пальцев; особенности: hover на мобильных устройствах и особенности элементов интерфейса, с которыми удобно взаимодействовать мышкой, но неудобно пальцами с сенсорных устройств. nЖдём вас на лекции!",
//   "id": "65c26720-960a-11ea-a065-e3db62e46919",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ebe6c496489600017f0a56a"
//   },
//   "group": "qa-6",
//   "date": "2020-05-18",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "51e02900-9695-11ea-bf20-a10081d0cae1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ebe6cf06489600017f0a56b"
//   },
//   "group": "aqa-4",
//   "date": "2020-05-20",
//   "time": "19:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Консультация по дипломной работе на курсе «Автоматизированное тестирование",
//   "additional": ".",
//   "id": "b5342b50-9695-11ea-bf20-a10081d0cae1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec160f5de559d00175bbd26"
//   },
//   "group": "ra-23",
//   "date": "2020-05-22",
//   "time": "19:30",
//   "teacher": "Костантин Полянский",
//   "lecture": "Компоненты",
//   "additional": "Вы познакомитесь с библиотекой React, компонентами и инструментарием. Также узнаете о компонентном и декларативном подходе, JSX и PropTypes.nЖдем вас на вебинаре.",
//   "id": "54a25450-9858-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec161b2de559d00175bbd27"
//   },
//   "group": "ra-23",
//   "date": "2020-05-17",
//   "time": "19:08",
//   "teacher": "Константин Полянский",
//   "lecture": "Компоненты",
//   "additional": "Вы познакомитесь с библиотекой React, компонентами и инструментарием. Также узнаете о компонентном и декларативном подходе, JSX и PropTypes.nЖдем вас на вебинаре.",
//   "id": "c5803840-9858-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec163c7de559d00175bbd29"
//   },
//   "group": "ra-23",
//   "date": "2020-05-17",
//   "time": "19:18",
//   "teacher": "Константин Полянский",
//   "lecture": "Компоненты",
//   "additional": "Вы познакомитесь с библиотекой React, компонентами и инструментарием. Также узнаете о компонентном и декларативном подходе, JSX и PropTypes.nЖдем вас на вебинаре.",
//   "id": "02ea2780-985a-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec167c4de559d00175bbd2a"
//   },
//   "group": "bhj-9",
//   "date": "2020-05-18",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Символы, итераторы, генераторы",
//   "additional": "На занятии вы узнаете:n- что такое символы и как их использовать;n- как реализовать свой итератор;n- а также про тонкие материи генераторов.",
//   "id": "63e47070-985c-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec1682bde559d00175bbd2b"
//   },
//   "group": "bhj-9",
//   "date": "2020-05-20",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "TypeScript",
//   "additional": "На занятии вы познакомитесь с рабочим окружением, типизацией, интерфейсами и классами.",
//   "id": "a0cc2cd0-985c-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16856de559d00175bbd2c"
//   },
//   "group": "bhj-9",
//   "date": "2020-05-22",
//   "time": "18:30",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "baa9ba00-985c-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16986de559d00175bbd2d"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-18",
//   "time": "18:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "DOM",
//   "additional": "Мы познакомимся и научимся работать с событиями  загрузки DOM, навигацией, различными атрибутами. Приходите, будет интересно!",
//   "id": "6fe74770-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec1699ede559d00175bbd2e"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-20",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На лекции рассмотрим, какие бывают события. Остановимся на работе с input и output. Ждем вас на вебинаре!n",
//   "id": "7e3da0d0-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec169bade559d00175bbd2f"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-22",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Изменение структуры HTML-документа",
//   "additional": "На лекции мы познакомимся с содержимым HTML-документа, узнаем о представлении элемента и научимся управлять различными элементами. Не пропустите вебинар, чтобы задать интересующие вопросу лектору лично.n",
//   "id": "8ebcf4b0-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec169dede559d00175bbd30"
//   },
//   "group": "bjs-11",
//   "date": "2020-05-18",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Асинхронность",
//   "additional": "На лекции будут раскрыты следующие темы: n1. Понятие асинхронностиn2. Асинхронные функции",
//   "id": "a48a77e0-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec169fbde559d00175bbd31"
//   },
//   "group": "bjs-11",
//   "date": "2020-05-21",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "b5abd820-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16a1cde559d00175bbd32"
//   },
//   "group": "html-51",
//   "date": "2020-05-18",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Введение в HTML и CSS",
//   "additional": "На занятии преподаватель расскажет:n- что такое вёрстка и HTML;n- какие бывают теги;n- что такое CSS и для чего он нужен;n- как написать CSS-правило.",
//   "id": "c9065f80-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16a3cde559d00175bbd33"
//   },
//   "group": "html-51",
//   "date": "2020-05-20",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контентные теги",
//   "additional": "На занятии преподаватель расскажет:n- какие есть теги для разметки контента на странице (заголовков, параграфов текста, картинок и т.д.);n- какие есть свойства у этих тегов;n- что такое селектор по идентификатору и селектор по классу и чем они отличаются.",
//   "id": "dc9934f0-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16a5ade559d00175bbd34"
//   },
//   "group": "html-51",
//   "date": "2020-05-22",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "На занятии вы узнаете как правильно искать информацию на просторах интернета и пользоваться ей.",
//   "id": "ee5c0550-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16a72de559d00175bbd35"
//   },
//   "group": "mq-24",
//   "date": "2020-05-18",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Особенности верстки графики для мобильных устройств",
//   "additional": "Преподаватель поведает о нюансах разработки для гаджетов от Apple на базе операционной системы iOS, а также для устройств, имеющих экраны с повышенной плотностью пикселей. Кроме того, будет затронута тема иконочных шрифтов и SVG (векторной) графики. nА в заключение вас ждут ещё несколько удобных свойств Flexbox:n➡️ justify-content (определяет, как браузер распределяет пространство вокруг флекс-элементов вдоль главной оси контейнера);n➡️ align-items (выравнивает флекс-элементы внутри контейнера в перпендикулярном направлении);n➡️ align-self (выравнивает флекс-элементы текущей строки, переписывая значение align-items).nЖдём вас на занятии!",
//   "id": "fc925390-985d-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16a8bde559d00175bbd36"
//   },
//   "group": "mq-24",
//   "date": "2020-05-20",
//   "time": "19:00",
//   "teacher": "Дмитрий Рябов",
//   "lecture": "Верстка адаптивного макета",
//   "additional": "Преподаватель разъяснит плюсы и минусы адаптивной верстки, расскажет об использовании логических операторов в медиа-запросах и поговорит о способах адаптации фоновых изображений.nА в заключение будут разобраны следующие темы:n▪️ как перестраиваются элементы для мобильного телефона;n▪️ подготовка фоновых изображений для разных устройств;n▪️ какие элементы скрываются;n▪️ содержат ли скрывающиеся блоки изображения.nЖдём вас на занятии!",
//   "id": "0b9540a0-985e-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16aa9de559d00175bbd37"
//   },
//   "group": "mq-24",
//   "date": "2020-05-22",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивная типографика",
//   "additional": "На занятии преподаватель расскажет вам о таких полезных медиа-функциях как orientation (ориентация области просмотра) и aspect-ratio (соотношение ширины к высоте области просмотра), а также об относительной единице измерения rem.nКроме того, будут разобраны следующие особенности HTML-элементов:n▪️ type email;n▪️ type tel;n▪️ type search;nИ в завершение лекции будет рассмотрен пример улучшения формы с использованием type="email" / type="search" / type="tel" и деградацией до type="text" в старых браузерах. nНе пропустите, занятие будет интересным! ",
//   "id": "1d60c390-985e-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec16ac7de559d00175bbd38"
//   },
//   "group": "ra-23",
//   "date": "2020-05-22",
//   "time": "19:30",
//   "teacher": "Константин Полянский",
//   "lecture": "Компоненты",
//   "additional": "Вы познакомитесь с библиотекой React, компонентами и инструментарием. Также узнаете о компонентном и декларативном подходе, JSX и PropTypes.nЖдем вас на вебинаре.",
//   "id": "2f1c6800-985e-11ea-a0c8-9b442d350ac8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ec6e593122f330017a41c34"
//   },
//   "group": "pb-13",
//   "date": "2020-05-22",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Базовые понятия. Переменные и числа",
//   "additional": "Дополнительные материалыnпочитать:nКак работает интернетnhttps://developer.mozilla.org/ru/docs/Learn/How_the_Internet_worksnВыражения и операторыnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Expressions_and_Operators#%D0%9E%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80%D1%8B_%D0%BF%D1%80%D0%B8%D1%81%D0%B2%D0%B0%D0%B8%D0%B2%D0%B0%D0%BD%D0%B8%D1%8FnВведение в javascriptnhttps://learn.javascript.ru/intronnпосмотреть:nЕще одна лекция о числах в javascriptnhttps://www.youtube.com/watch?v=aGTjRU7Dp20&list=PLo6puixMwuSNxJCgadaaavKqq4-ocKPrRnКак работает javascriptnhttps://www.youtube.com/watch?v=H6G63NKRSi8&feature=youtu.benhttps://www.youtube.com/watch?v=fXi49EkrMPI",
//   "id": "51039d20-9ba2-11ea-95c9-073ea40da78d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eca74a8fd79b90017e0f01e"
//   },
//   "group": "srk-2",
//   "date": "2020-06-08",
//   "time": "19:00",
//   "teacher": "Сусанна Алиева",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nВы узнаете, что из себя представляет дипломная работа по Блоку «Начало разработки», и кто поможет вам в работе над ней. Поговорите о сроках выполнения работы и обсудите другие вопросы, связанные с завершением первого блока на профессии «1С-разработчик».nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "5d428170-9dc1-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecad558fd79b90017e0f022"
//   },
//   "group": "mq-24",
//   "date": "2020-05-25",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Breakpoints",
//   "additional": "На лекции преподаватель расскажет о так называемых контрольных точках в CSS - Breakpoints и критериях их выбора, разберет подход к версте «mobile first» и поговорит о единицах измерениях vh, vw, vmin, vmax, а также как с такими единицами измерения работает функция calc().nКроме того, вы узнаете об атрибуте srcset у тега img и увидите пример загрузки изображений через атрибут srcset и фоллбека в виде src. А напоследок мы немного побеседуем на тему подготовки графики для различных устройств.nЖдём вас на занятии!",
//   "id": "fea08920-9dfa-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecad571fd79b90017e0f023"
//   },
//   "group": "mq-24",
//   "date": "2020-05-27",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Адаптивные изображения",
//   "additional": "На лекции вы дополните свои знания полезными flexbox-свойствами:n✅ flex-grow - растяжение элементов;n✅ flex-shrink - сужение элементов;n✅ flex-basis - базовая ширина элемента;n✅ flex - задание базовой ширины и трансформации элемента одним свойством;n✅ order - порядок отображения элементов.nКроме того, вы познакомитесь с тегом <picture> и рассмотрите пример загрузки различных вариантов фонового изображения для разных разрешений с его помощью. А в заключение вы закрепите тему подготовки графики для разных устройств. nЗанятие будет занимательным, не пропустите!",
//   "id": "0d5f6850-9dfb-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecad59cfd79b90017e0f024"
//   },
//   "group": "mq-24",
//   "date": "2020-05-29",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "Вы узнаете, что из себя представляет работа над дипломным проектом, какие будут сроки и что нужно сделать, чтобы получить допуск. nБольшинство из вас прекрасно показали себя на курсе, так что мы уверены, что вы отлично справитесь! ",
//   "id": "26b7bff0-9dfb-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecad7f5fd79b90017e0f028"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-25",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Асинхронные запросы",
//   "additional": "Преподаватель расскажет нам о принципах асинхронности, рассмотрит FormData и отправку данных формы. И это только небольшая часть того, что будет освещено на лекции. Приходите, будет увлекательно!n",
//   "id": "8d142ad0-9dfc-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecad80dfd79b90017e0f029"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-27",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Хранение состояния на клиенте и отправка на сервер",
//   "additional": "Преподаватель расскажет нам о document.cookie и localStorage. Осветит тему XHR: для чего и где используется. Приходите, будет интересно!",
//   "id": "9b7cd3b0-9dfc-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecad825fd79b90017e0f02a"
//   },
//   "group": "bhj-10",
//   "date": "2020-05-29",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "Мы узнаем, что из себя представляет дипломный проект и кто поможет нам в работе над ним. Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса. nБудем рады видеть вас онлайн!",
//   "id": "a9a9fa30-9dfc-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecad9ebfd79b90017e0f02e"
//   },
//   "group": "ra-23",
//   "date": "2020-05-25",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "События и состояния",
//   "additional": "Преподаватель расскажет об обработчике событий, различных состояниях компонентов и о передаче состояния.nЖдем вас на вебинаре.",
//   "id": "b8b86380-9dfd-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecada0bfd79b90017e0f02f"
//   },
//   "group": "ra-23",
//   "date": "2020-05-27",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Props",
//   "additional": "На лекции вы познакомитесь с Props, узнаете об атрибутах без значений, условном рендеринге, списках элементов и атрибуте «key». И это неполный список :)nПриходите, будет интересно!",
//   "id": "cb972b30-9dfd-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecada22fd79b90017e0f030"
//   },
//   "group": "ra-23",
//   "date": "2020-05-29",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Формы",
//   "additional": "На лекции вы узнаете о формах, контролируемых и неконтролируемых компонентах. Познакомитесь с Lifting State Up и Lifting State Down.nЖдем вас на вебинаре!",
//   "id": "d95aba70-9dfd-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecada3dfd79b90017e0f031"
//   },
//   "group": "html-51",
//   "date": "2020-05-26",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для вёрстки структуры контента",
//   "additional": "На занятии лектор расскажет:n- про группировку элементов на странице;n- как правильно задавать имена для классов;n- про теги, которые отвечают за структуру страницы;n- чем отличаются блочные и строчные элементы, и как их центрировать на странице.",
//   "id": "e96c3150-9dfd-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecada4ffd79b90017e0f032"
//   },
//   "group": "html-51",
//   "date": "2020-05-28",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование блочных элементов",
//   "additional": "На занятии Семён Бойко расскажет:n- про flex-контейнеры и их особенности;n- про элементы nav, header и footer;n- про схлопывание отступов.",
//   "id": "f43e6d00-9dfd-11ea-a3f7-cf7ddc8ad88a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eccbba4c207db0017d354d9"
//   },
//   "group": "pb-13",
//   "date": "2020-05-26",
//   "time": "19:00",
//   "teacher": "Константин Полянский ",
//   "lecture": "Логический тип и ветвление",
//   "additional": "nНа лекции мы узнаем:n  - как делать программы нелинейными — выполнять различный n  - блок кода в зависимости от состояния программыn  - как удобно хранить информацию о признаках вида «да/нет»n  - что такое логические операции.nnnДополнительные материалы.nпочитать:nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Логические_операторыnhttps://learn.javascript.ru/logical-opsnhttps://learn.javascript.ru/comparisonnпосмотреть:nхороший обзор nhttps://www.youtube.com/watch?v=B4ZCFdrBmbEnеще один обзор с конкретными примерами, но уже на английскомnhttps://www.youtube.com/watch?v=2cGleL5FMZMnпараллельно даются несколько полезных советов для работы в консоле веб-разработчикаnhttps://www.youtube.com/watch?v=Gy87ZS5sb1w",
//   "id": "d9a0dbc0-9f1c-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd003cc207db0017d354da"
//   },
//   "group": "java-12",
//   "date": "2020-05-27",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Коллекции List",
//   "additional": "n",
//   "id": "bc485c00-9f45-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd005ac207db0017d354db"
//   },
//   "group": "java-12",
//   "date": "2020-05-29",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Коллекции Queue",
//   "additional": "n",
//   "id": "cdeb6f60-9f45-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0074c207db0017d354dc"
//   },
//   "group": "java-12",
//   "date": "2020-06-01",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Коллеции HashSet и HashMap",
//   "additional": "n",
//   "id": "dda85da0-9f45-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd008fc207db0017d354dd"
//   },
//   "group": "java-12",
//   "date": "2020-06-03",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции TreeSet",
//   "additional": "n",
//   "id": "ed785eb0-9f45-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd018bc207db0017d354de"
//   },
//   "group": "java-12",
//   "date": "2020-06-08",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции TreeMap",
//   "additional": "n",
//   "id": "83b696d0-9f46-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd02fec207db0017d354e0"
//   },
//   "group": "java-13",
//   "date": "2020-05-27",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Структура программы",
//   "additional": "n",
//   "id": "60a93de0-9f47-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0312c207db0017d354e1"
//   },
//   "group": "java-13",
//   "date": "2020-06-02",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Условные операторы и циклы",
//   "additional": "n",
//   "id": "6ca26d60-9f47-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd032fc207db0017d354e2"
//   },
//   "group": "java-13",
//   "date": "2020-06-03",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "n",
//   "id": "7e56bed0-9f47-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0384c207db0017d354e3"
//   },
//   "group": "java-13",
//   "date": "2020-06-04",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: примитивы",
//   "additional": "n",
//   "id": "b098cdc0-9f47-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd039ec207db0017d354e4"
//   },
//   "group": "java-13",
//   "date": "2020-06-08",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: объекты",
//   "additional": "n",
//   "id": "c0118710-9f47-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd03b7c207db0017d354e5"
//   },
//   "group": "java-13",
//   "date": "2020-06-10",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структура класса",
//   "additional": "n",
//   "id": "cef68be0-9f47-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd03cbc207db0017d354e6"
//   },
//   "group": "java-13",
//   "date": "2020-06-15",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач и основы работы в IDE",
//   "additional": "n",
//   "id": "db239ca0-9f47-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd07c0c207db0017d354e8"
//   },
//   "group": "aqa-5",
//   "date": "2020-05-28",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Тестирование веб-интерфейсов, Selenium и Selenide",
//   "additional": "n",
//   "id": "36c26fd0-9f4a-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd085bc207db0017d354e9"
//   },
//   "group": "aqa-5",
//   "date": "2020-06-01",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Selenide",
//   "additional": "n",
//   "id": "93838dd0-9f4a-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0a52c207db0017d354ea"
//   },
//   "group": "aqa-5",
//   "date": "2020-06-04",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Patterns",
//   "additional": "n",
//   "id": "bf3fbb50-9f4b-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0a65c207db0017d354eb"
//   },
//   "group": "aqa-5",
//   "date": "2020-06-08",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Behaviour Driven Development",
//   "additional": "n",
//   "id": "ca8b6cc0-9f4b-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0a7cc207db0017d354ec"
//   },
//   "group": "aqa-5",
//   "date": "2020-06-10",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Docker и Docker Compose",
//   "additional": "n",
//   "id": "d7d3b180-9f4b-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0a8fc207db0017d354ed"
//   },
//   "group": "aqa-5",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "SQL",
//   "additional": "n",
//   "id": "e371a1a0-9f4b-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0aa4c207db0017d354ee"
//   },
//   "group": "aqa-5",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Репортинг: Report Portal",
//   "additional": "n",
//   "id": "efe02830-9f4b-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0abac207db0017d354ef"
//   },
//   "group": "aqa-5",
//   "date": "2020-06-22",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Заключительная лекция",
//   "additional": "n",
//   "id": "fcdda850-9f4b-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0b40c207db0017d354f1"
//   },
//   "group": "javaqa-6",
//   "date": "2020-05-28",
//   "time": "20:00",
//   "teacher": "Любовь Маясова",
//   "lecture": "Объектно-ориентированное программирование: ключевые принципы",
//   "additional": "n",
//   "id": "4cdc2c50-9f4c-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0b68c207db0017d354f2"
//   },
//   "group": "javaqa-6",
//   "date": "2020-06-01",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Объекты с внутренним состоянием, управление состоянием при тестировании",
//   "additional": "n",
//   "id": "64bb9f90-9f4c-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0b7cc207db0017d354f3"
//   },
//   "group": "javaqa-6",
//   "date": "2020-06-04",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Композиция и зависимость объектов. Mockito при создании автотестов",
//   "additional": "n",
//   "id": "70696e30-9f4c-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0b93c207db0017d354f4"
//   },
//   "group": "javaqa-6",
//   "date": "2020-06-08",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Наследование и расширяемость систем. Проблемы наследования",
//   "additional": "n",
//   "id": "7e77e920-9f4c-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0ba9c207db0017d354f5"
//   },
//   "group": "javaqa-6",
//   "date": "2020-06-11",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Исключительные ситуации и их обработка. Тестирование исключений",
//   "additional": "n",
//   "id": "8bc473a0-9f4c-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0bc1c207db0017d354f6"
//   },
//   "group": "javaqa-6",
//   "date": "2020-06-15",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Интерфейсы для организации малой связности. Обобщённое программирование (Generics)",
//   "additional": "n",
//   "id": "99dbef40-9f4c-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecd0be6c207db0017d354f7"
//   },
//   "group": "javaqa-6",
//   "date": "2020-06-18",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Collections Framework. CRUD и тестирование систем, управляющих набором объектов",
//   "additional": "n",
//   "id": "af965fa0-9f4c-11ea-837b-c7e2460f1394",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecf65960fbcf70017a00515"
//   },
//   "group": "pb-13",
//   "date": "2020-05-28",
//   "time": "19:00",
//   "teacher": "Константин Полянский ",
//   "lecture": "Строки. Алгоритмы. Как отлаживать код",
//   "additional": "nНа лекции мы узнаем:n  - как работают строки в JS;n  - что такое алгоритмы и как их сравнивать;n  - какие существуют приемы отладки кода;n  - как читать ошибки интерпретатора.nnДополнительные материалыnпочитать:nклассическая документация от MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Stringnразбор от Ильи Кантораnhttps://learn.javascript.ru/stringnnпосмотреть:n20 методов, которые помогут вам жонглировать строками в JS, как настоящий PROnhttps://www.youtube.com/watch?v=VRz0nbax0uInхороший обзор (на английском)nhttps://www.youtube.com/watch?v=DljZQyNwdOgnпро типы ошибок в JS и то как с ними боротьсяnhttps://stepik.org/lesson/99598/step/1?unit=75361nувлекательнейшая лекция по алгоритмам (в рамках легендарного курса CS50 от Harvard University)nhttps://www.youtube.com/watch?v=U9o49qwa6hknкурс от Computer Science Center на stepiknhttps://stepik.org/course/217/nеще немного про алгоритмы (How Binary Search Works)nhttps://www.youtube.com/watch?v=JQhciTuD3E8",
//   "id": "52481fb0-a0b3-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfe8c60fbcf70017a00516"
//   },
//   "group": "onec-1",
//   "date": "2020-06-01",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Документы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "83e62a00-a101-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfe90e0fbcf70017a00517"
//   },
//   "group": "onec-1",
//   "date": "2020-06-04",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Табличные части",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "aeea2080-a101-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfe9460fbcf70017a00518"
//   },
//   "group": "onec-1",
//   "date": "2020-06-09",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Проведение и движения",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "d00a0be0-a101-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfe97b0fbcf70017a00519"
//   },
//   "group": "onec-1",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Формы документов",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "efbbc140-a101-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfe9ac0fbcf70017a0051a"
//   },
//   "group": "onec-1",
//   "date": "2020-06-17",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "0cf43940-a102-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfea610fbcf70017a0051b"
//   },
//   "group": "onec-1",
//   "date": "2020-06-19",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Последовательность и журналы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "78647f00-a102-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfeaa70fbcf70017a0051c"
//   },
//   "group": "onec-1",
//   "date": "2020-06-22",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Файлы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "a275ff30-a102-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfeae30fbcf70017a0051d"
//   },
//   "group": "onec-1",
//   "date": "2020-06-24",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Текстовые документы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c5f621b0-a102-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfeb280fbcf70017a0051e"
//   },
//   "group": "onec-1",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Двоичные данные",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "ef983e40-a102-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecfed140fbcf70017a0051f"
//   },
//   "group": "onec-3",
//   "date": "2020-06-08",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Модули",
//   "additional": "nНа вебинаре вы узнаете:n-какими бывают общие модули;n-что такое директивы компиляции и инструкции препроцессора;n-для чего служат модули форм, модули объектов и модули менеджеров;n-каковы основные события модулей объектов и модулей менеджеров.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "1445a0b0-a104-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff0430fbcf70017a0052a"
//   },
//   "group": "onec-3",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Типы данных",
//   "additional": "nНа занятии вы узнаете:n-что такое примитивные и ссылочные типы;n-какими бывают примитивные типы;n-что такое уникальный идентификатор и чем ссылка отличается от объекта.nnК тому же вы научитесь:n-выполнять операции с примитивными типами;n-получать объект по ссылке.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "fa431470-a105-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff0740fbcf70017a0052b"
//   },
//   "group": "onec-3",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Даты и строки",
//   "additional": "nНа лекции вы узнаете:n-как задаются параметры дат и строк для хранения в ИБ;n-какие операции определены для дат и строк.nnА еще научитесь:n-выполнять простые операции с датами и строками.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "176ff3b0-a106-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff0990fbcf70017a0052c"
//   },
//   "group": "onec-3",
//   "date": "2020-06-22",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Условия",
//   "additional": "nНа занятии вы узнаете:n-что такое оператор условного выполнения и тернарный оператор;n-чем хороша декларативность в коде.nnНаучитесь:n-писать простые и вложенные операторы условного выполнения;n-переписывать их на тернарные операторы;n-проверять заполненность значений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. nn",
//   "id": "2d660d80-a106-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff1010fbcf70017a0052e"
//   },
//   "group": "onec-3",
//   "date": "2020-06-25",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Циклы",
//   "additional": "nНа занятии вы узнаете:n-что такое цикл;n-какими способами можно организовать цикл;n-как прервать и продолжить выполнение цикла;n-что такое синтаксический сахар.nnА ещё вы научитесь:n-организовывать простейшие циклы.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "6b585c10-a106-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff1290fbcf70017a0052f"
//   },
//   "group": "onec-3",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Универсальные коллекции",
//   "additional": "nНа занятии вы узнаете:n-что такое универсальная коллекция;n-какие коллекции поддерживает встроенный язык.nnНаучитесь:n-создавать массивы, списки значений, структуры, соответствия, таблицы и деревья значений;n-наполнять их, сортировать, выполнять обход и поиск.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "839c3670-a106-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff14f0fbcf70017a00530"
//   },
//   "group": "onec-3",
//   "date": "2020-07-02",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Объекты платформы",
//   "additional": "nНа вебинаре вы узнаете:n-как создаются объекты платформы;n-что такое конструктор и метод;n-для чего нужны объекты ТабличныйДокумент и ТекстовыйДокумент.nnТакже научитесь:n-создавать цвета, шрифты и собирать из них форматированные строки;n-использовать генератор случайных чисел;n-программно создавать, находить и изменять пользователей ИБ.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9a308c10-a106-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff17f0fbcf70017a00531"
//   },
//   "group": "onec-3",
//   "date": "2020-07-06",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Процедуры и функции",
//   "additional": "nНа лекции вы узнаете:n-что такое процедуры и функции как подпрограммы, побочный эффект, рекурсия;n-какие бывают имена и параметры;n-для чего нужны - возврат значений, передача по значению, повторное использование, комментарии.nnНаучитесь:n-создавать процедуры и функции;n-определять параметры и использовать возврат значений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b67ef230-a106-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff2f30fbcf70017a00532"
//   },
//   "group": "srk-2",
//   "date": "2020-06-22",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Справочники",
//   "additional": "nНа занятии вы узнаете:n-что такое справочник;n-для чего служат его реквизиты и табличные части;n-как определять, на какие справочники лучше делить сущности предметной области.nnНаучитесь:n-переопределять установку кода, получение представления и ввод по строке;n-создавать, удалять и изменять элементы;n-создавать и получать предопределенные элементы.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "944bcca0-a107-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff3340fbcf70017a00533"
//   },
//   "group": "srk-2",
//   "date": "2020-06-26",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Иерархия и подчинение",
//   "additional": "nНа занятии вы узнаете:n-зачем нужна иерархия;n-чем отличается иерархия элементов от иерархии групп;n-как она отображается в списках;n-зачем нужно подчинение;n-чем оно лучше просто реквизита-ссылки.nnНаучитесь:n-удалять, искать и отбирать элементы по иерархии;n-создавать элементы справочников с циклическими ссылками друг на друга.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "bb64a640-a107-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff36f0fbcf70017a00534"
//   },
//   "group": "srk-2",
//   "date": "2020-06-30",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Формы справочников",
//   "additional": "nНа лекции вы узнаетеn-какими бывают формы справочников;n-как ведет себя в них основной реквизит;n-как работает механика выбора.nnНаучитесь:n-изменять элемент справочника перед записью и записывать вместе с ним другие данные;n-реализовывать подбор;n-скрывать помеченные на удаление элементы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "de0a2030-a107-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff3b50fbcf70017a00535"
//   },
//   "group": "srk-2",
//   "date": "2020-07-02",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Регистры сведений",
//   "additional": "nНа занятии вы узнаете:n-что такое “регистр сведений” и зачем он нужен;n-что такое измерения, и чем отличается ресурс от реквизита;n-что такое “ведущее измерение” и когда добавлять индексы.nnНаучитесь:n-программно открывать форму записи и форму списка с отбором;n-делать простейший отчет по регистру.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "07d807b0-a108-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff3fc0fbcf70017a00536"
//   },
//   "group": "srk-2",
//   "date": "2020-07-06",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Запись и чтение регистров",
//   "additional": "nНа занятии вы узнаете:n-что такое менеджер регистра, менеджер записи и набор записей;n-когда использовать менеджер записи, а когда -- набор.nnНаучитесь:n-читать, записывать, изменять и удалять данные регистров с помощью менеджеров записи и наборов записей;n-переопределять события модуля набора записей.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "322dbcd0-a108-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ecff52b0fbcf70017a00537"
//   },
//   "group": "srk-2",
//   "date": "2020-07-10",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nНа занятии вы узнаете:n-что такое виртуальные таблицы;n-как получать срез первых и срез последних.nnНаучитесь:n-строить простые отчеты по виртуальным таблицам регистров сведений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "e6f94e90-a108-11ea-a967-bf0ffa271716",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed3bf47339cb80017dd58fe"
//   },
//   "group": "html-51",
//   "date": "2020-06-01",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Вёрстка форм",
//   "additional": "Вы узнаете:n- для чего используются формы и какие поля у них есть;n- как задать минимальную и максимальную высоту/ширину элемента;n- как сделать эффекты при наведении на элемент.",
//   "id": "21bc88a0-a34b-11ea-bd02-1974178d69c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed3bf61339cb80017dd58ff"
//   },
//   "group": "html-51",
//   "date": "2020-06-03",
//   "time": "18:00",
//   "teacher": "Александр Фитискин",
//   "lecture": "Нестандартные элементы форм",
//   "additional": "На занятии лектор расскажет:n- что такое строчно-блочные элементы и какие у них есть особенности;n- как можно стилизовать фон элементов;n- что такое соседний и родственный селектор и для чего они используются;n- про абсолютное позиционирование элементов;n- про псевдоэлементы ::before и ::after.",
//   "id": "3178b390-a34b-11ea-bd02-1974178d69c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed3bff0339cb80017dd5902"
//   },
//   "group": "ra-23",
//   "date": "2020-06-02",
//   "time": "19:00",
//   "teacher": "Елена Семенова",
//   "lecture": "Композиция компонентов",
//   "additional": "На лекции преподаватель расскажет вам о подходах к композиции компонентов, передаче компонентов в атрибуты. Вы узнаете о вложенных компонентах - Children Components и о других интересных элементах.nПриходите на лекцию, ждем вас онлайн.",
//   "id": "86e6d190-a34b-11ea-bd02-1974178d69c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed3c00c339cb80017dd5903"
//   },
//   "group": "ra-23",
//   "date": "2020-06-04",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Жизненный цикл и работа с HTTP",
//   "additional": "На лекции вы узнаете оn- работе с HTTPn- жизненном цикле компонентовn- фазах жизненного циклаn- первоначальной отрисовке компонентовn- изменении состояния компонентаn- построении круговых диаграммn- удалении компонента со страницыnЖдем вас на вебинаре.n",
//   "id": "9770fae0-a34b-11ea-bd02-1974178d69c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed3c03d339cb80017dd5904"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-05",
//   "time": "18:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Базовый синтаксис",
//   "additional": "На лекции вы узнаете:n1. Переменные и константы, допустимые имена, правила именованияn2. Выражения, операторы и операндыn3. DevTools и console.logn4. Числаn5. Строки",
//   "id": "b4bf92f0-a34b-11ea-bd02-1974178d69c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed3c0d8339cb80017dd5906"
//   },
//   "group": "mq-25",
//   "date": "2020-06-05",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Верстка резинового макета",
//   "additional": "Преподаватель расскажет вам, что из себя представляет резиновая верстка, затронет тему процентов как единиц измерения, а также особенности их применения в разных случаях. nВ заключение вы также узнаете о современной спецификации CSS Flexible Box Layout Module (получившей среди разработчиков название Flexbox).nЖдём вас сегодня на открытии курса!",
//   "id": "10decba0-a34c-11ea-bd02-1974178d69c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed3c133339cb80017dd5908"
//   },
//   "group": "bphp-7",
//   "date": "2020-06-04",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Знакомство с PHP и PHPStorm",
//   "additional": "На лекции вы узнаете, что такое PHP, познакомитесь с:n- настройкой рабочей средыn- основами синтаксисаn- документациейn- типами данныхn- константами и ветвлениями",
//   "id": "4743a940-a34c-11ea-bd02-1974178d69c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed40b6a339cb80017dd5910"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-01",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Методы и автотесты",
//   "additional": "nНа лекции вы:n-узнаете о том, как структурировать наши приложения на Go: мы можем использовать методы и типы для организации семантической связи;n-посмотрите, как писать автотесты;n-поговорите о системах CI/CD.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "835db160-a378-11ea-bd02-1974178d69c9",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed4c88fe1adf9001728ce91"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-05",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Основы Go: типы данных, стандартные конструкции",
//   "additional": "nНа лекции вы узнаете:n-зачем нужен Golang;n-как работать с Golang;n-как компилируется и запускается приложение на Go;n-для чего нужны переменные и как их использовать;n-как использовать дебаггер (отладчик);n-ключевые типы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "40973420-a3e9-11ea-98f9-1f15bdb33f73",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed4c91ee1adf9001728ce92"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-08",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Функции, приведение типов, пакеты и модули",
//   "additional": "nНа лекции вы:n-изучите, как работать с функциями;n-познакомитесь с системой приведения типов;n-поговорите о пакетах и модулях.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "95f68510-a3e9-11ea-98f9-1f15bdb33f73",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed4c98be1adf9001728ce93"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-11",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Структуры, указатели, массивы, Slices, Maps",
//   "additional": "nНа лекции вы изучите:n-структуру и создание типов;n-указатели и вопросы передачи данных;n-массивы и Slice'ы (слайсы);n-Map'ы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "d6979ff0-a3e9-11ea-98f9-1f15bdb33f73",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed4c9afe1adf9001728ce94"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Методы и автотесты",
//   "additional": "nНа лекции вы:n-узнаете о том, как структурировать наши приложения на Go: мы можем использовать методы и типы для организации семантической связи;n-посмотрите, как писать автотесты;n-поговорите о системах CI/CD.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "ec006de0-a3e9-11ea-98f9-1f15bdb33f73",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed60abc9f9bd30017e33571"
//   },
//   "group": "pb-13",
//   "date": "2020-06-02",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Массивы и базовые методы работы с ними",
//   "additional": "nНа лекции мы узнаем:n  - что такое массивы.n  - для чего используются массивыn  - какие методы мы можем применять для работы с массивамиnnДополнительные материалы.nпочитать:nпо традиции - документация на MDN.nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array nопять же, по традиции learn.javascriptnhttps://learn.javascript.ru/array nnпосмотреть:nотличный обзор того, что мы сегодня обсудили (и даже больше) от Sorax.nhttps://www.youtube.com/watch?v=3OjuRfR8RNg nхороший обзор на английском.nhttps://www.youtube.com/watch?v=orAS-MBh5f4 ",
//   "id": "488a6880-a4a9-11ea-8970-67e858011875",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ed60b909f9bd30017e33573"
//   },
//   "group": "pb-13",
//   "date": "2020-06-04",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Циклы",
//   "additional": "nНа лекции мы узнаем:nn  - что такое циклы и для чего они нужны;n  - как правильно писать циклы;n  - как работать с циклами и массивами.nnnДополнительные материалы:nЗдесь можно поизучать циклы самостоятельноnСodewars, programming challengesnhttps://www.codewars.com/nЦиклы while, for, learn.javascript.runhttps://learn.javascript.ru/while-fornМассивы: методы, learn.javascript.runhttps://learn.javascript.ru/array-methodsnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Циклы_и_итерацииnlearn javascriptnhttps://learn.javascript.ru/while-fornnпосмотреть:nобзор циклов от Soraxnhttps://www.youtube.com/watch?v=ITr-SzUIDpQnхороший обзор на английскомnhttps://www.youtube.com/watch?v=orAS-MBh5f4n",
//   "id": "c6dc8330-a4a9-11ea-8970-67e858011875",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7a8b4309eb0017c55961"
//   },
//   "group": "WM-56",
//   "date": "2020-06-08",
//   "time": "19:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Вводное занятие с координатором",
//   "additional": "n",
//   "id": "47a89660-a74e-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7acb4309eb0017c55962"
//   },
//   "group": "WM-56",
//   "date": "2020-06-11",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для разметки текста и атрибуты",
//   "additional": "nНа занятии вы узнаете:n1. Что такое браузер и что он делает;n2. Что такое HTML и для чего он был создан;n3. Что такое тег и какие они бывают.n",
//   "id": "6db222e0-a74e-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7afd4309eb0017c55963"
//   },
//   "group": "WM-56",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Списки и таблицы",
//   "additional": "nВы узнаете:n1. Что такое список и какие виды списков бывают;n2. Для чего используют таблицы в вёрстке и какой у них синтаксис.n",
//   "id": "8b850620-a74e-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7b264309eb0017c55964"
//   },
//   "group": "WM-56",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Селекторы и свойтсва",
//   "additional": "nНа лекции вы узнаете:n1. Что такое CSS и где его нужно писать;n2. Как записать CSS-правило и из чего оно состоит.n",
//   "id": "a405c270-a74e-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7b804309eb0017c55965"
//   },
//   "group": "WM-56",
//   "date": "2020-06-22",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Оформление текстовых блоков с помощью CSS",
//   "additional": "nДенис Ежков расскажет:n1. Что такое селектор класса и как его записать;n2. Какие есть свойства для стилизации шрифта;n3. Что такое цветовая модель RGB и какие есть способы для задания цвета.nn",
//   "id": "d9442170-a74e-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7ba44309eb0017c55966"
//   },
//   "group": "WM-56",
//   "date": "2020-06-26",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "nВладимир Чебукин расскажет вам:n1. Как функционируют браузер и интернет;n2. Чем занимаются фронтенд и бэкенд разработчики.n",
//   "id": "eee3dde0-a74e-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7e244309eb0017c55968"
//   },
//   "group": "an-11",
//   "date": "2020-06-08",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Введение в Android. Инструменты и первый проект",
//   "additional": "n",
//   "id": "6c0dafc0-a750-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7e3b4309eb0017c55969"
//   },
//   "group": "and-11",
//   "date": "2020-06-10",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Приложение "Hello World"",
//   "additional": "n",
//   "id": "7a165e50-a750-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7e564309eb0017c5596a"
//   },
//   "group": "AND-11",
//   "date": "2020-06-16",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Проектирование интерфейса",
//   "additional": "n",
//   "id": "8a175a70-a750-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7e6f4309eb0017c5596b"
//   },
//   "group": "AND-11",
//   "date": "2020-06-19",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Компоненты View. Иерархия Views",
//   "additional": "n",
//   "id": "98dcf060-a750-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7e864309eb0017c5596c"
//   },
//   "group": "AND-11",
//   "date": "2020-06-22",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Компоненты ViewGroup. SharedPrefs",
//   "additional": "n",
//   "id": "a677c1f0-a750-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda7e994309eb0017c5596d"
//   },
//   "group": "AND-11",
//   "date": "2020-06-24",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "b253f390-a750-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda80184309eb0017c5596e"
//   },
//   "group": "and-10",
//   "date": "2020-06-09",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Работа с файлами в Android: внешние файлы",
//   "additional": "n",
//   "id": "9691d270-a751-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda803b4309eb0017c5596f"
//   },
//   "group": "and-10",
//   "date": "2020-06-11",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Работа с файлами в Android: внутренние файлы",
//   "additional": "n",
//   "id": "aaefc010-a751-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda80534309eb0017c55970"
//   },
//   "group": "AND-10",
//   "date": "2020-06-16",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Жизненный цикл Activity",
//   "additional": "n",
//   "id": "b93d18c0-a751-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda806d4309eb0017c55971"
//   },
//   "group": "AND-10",
//   "date": "2020-06-18",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Android Intents. Переход между экранами с передачей данных",
//   "additional": "n",
//   "id": "c913d090-a751-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda807f4309eb0017c55972"
//   },
//   "group": "AND-10",
//   "date": "2020-06-22",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "7.2 Android Intents. Системные функции Android",
//   "additional": "n",
//   "id": "d3df5580-a751-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eda80914309eb0017c55973"
//   },
//   "group": "AND-10",
//   "date": "2020-06-24",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "de7b8d10-a751-11ea-9deb-4b9e5387d7eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd499c2e7bdc0017fd381b"
//   },
//   "group": "bhj-11",
//   "date": "2020-06-11",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Возможности JavaScript в браузере",
//   "additional": "На этом занятии вы познакомитесь с:n1. Принципом построения DOM в браузереn2. С объектами HTML-теговn3. BOM. Объект WindownЖдём вас на вебинаре!",
//   "id": "e00955e0-a8fa-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd49d52e7bdc0017fd381c"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-09",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Расширенный синтаксис JavaScript",
//   "additional": "На лекции вы узнаете:n1. Современный стандарт, ""use strict""n2. Операторы разделителиn3. Типы данных null и undefinedn4. Управляющие конструкцииn5. Массивы, циклы",
//   "id": "022a84a0-a8fb-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4b662e7bdc0017fd381d"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-11",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Типы данных",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Типы данныхn2. Примитивы и объекты. Данные по значению и по ссылкеn3. Обертки для примитивовn4. Методы типов данныхn5. Проверка и преобразование типов",
//   "id": "f1127dc0-a8fb-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4c3c2e7bdc0017fd381e"
//   },
//   "group": "bphp-7",
//   "date": "2020-06-09",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Консольные приложения в PHP",
//   "additional": "На лекции вы узнаете:n- как работать с консольным PHPn- запускать консольные скриптыnПознакомитесь с:n- интерактивной консольюn- массивами и цикламиnА также узнаете еще много интересного :)",
//   "id": "70e65670-a8fc-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4c5e2e7bdc0017fd381f"
//   },
//   "group": "bphp-7",
//   "date": "2020-06-11",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Базовые операторы и функции",
//   "additional": "На лекции вы узнаете о:n- стандартных функцияхn- операторахn- регулярных выражениях",
//   "id": "85201a40-a8fc-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4c8f2e7bdc0017fd3820"
//   },
//   "group": "html-51",
//   "date": "2020-06-08",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Всплывающие элементы",
//   "additional": "На занятии он:n- расскажет, чем отличаются контентные и декоративные изображения;n- объяснит, как позиционировать элементы на странице;n- научит работать с Adobe Photoshop.",
//   "id": "a279d5e0-a8fc-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4cb82e7bdc0017fd3821"
//   },
//   "group": "html-51",
//   "date": "2020-06-10",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование flex-элементов",
//   "additional": "На занятии преподаватель:n- научит вас позиционировать flex-элементы;n- объяснит, как фиксировать элементы на странице;n- расскажет, что такое специфичность CSS-селектора и как она считается;n- покажет, как работать со шрифтами и изображениями в Adobe Photoshop.",
//   "id": "bacccb70-a8fc-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4e992e7bdc0017fd3824"
//   },
//   "group": "mq-25",
//   "date": "2020-06-09",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Резиновые изображения",
//   "additional": "На этом занятии преподаватель познакомит вас с полезной функцией calc() для расчёта размеров. Вы рассмотрите понятие резиновых изображений и узнаете, в чём заключаются отличия в использовании контентных и фоновых изображений. 😉nТакже будут затронуты особенности применения протоколов mailto и tel в HTML-элементах и вопросы взаимодействия с дизайнером по размерам изображений для резиновой верстки.",
//   "id": "d93ae7d0-a8fd-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4eb42e7bdc0017fd3825"
//   },
//   "group": "mq-25",
//   "date": "2020-06-11",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Введение в медиа-запросы",
//   "additional": "На занятии преподаватель расскажет вам о мобильной версии как подходе к верстке, плюсах и минусах этого подхода, разберёт медиа-запросы для различных типов устройств и особенности их использования. nТакже будет уделено внимание специальному режиму эмуляции устройств в веб-инспекторе браузера для тестирования отображения сайта в различных условиях. И в дополнение к изученным ранее свойствам Flexbox будут ещё рассмотрены такие полезные свойства как flex-wrap и align-content, которые отвечают за перенос строк и их выравнивание внутри флекс-контейнера.",
//   "id": "e93f1840-a8fd-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4fb52e7bdc0017fd3828"
//   },
//   "group": "ra-23",
//   "date": "2020-06-08",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "HOC",
//   "additional": "На лекции преподаватель познакомит вас с:n- интерфейсом оператора таксиn- чистыми функциями (Pure functions)n- функциями высшего порядка (Higher Order Functions)n- универсальным Logger для компонентовn- компонентом высшего порядка (higher order component)n- возможными сложностями и проблемами HOC",
//   "id": "82d35930-a8fe-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd4fd02e7bdc0017fd3829"
//   },
//   "group": "ra-23",
//   "date": "2020-06-10",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "hooks, Context API",
//   "additional": "На лекции вы изучите:n- хукиn- useStaten- useEffectn- useRefn- кастомные хукиn- useContext & Context API",
//   "id": "92e2d440-a8fe-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd50822e7bdc0017fd382c"
//   },
//   "group": "ahj-7",
//   "date": "2020-06-08",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Рабочее окружение",
//   "additional": "На занятии вы узнаете:n- про пакетные менеджеры: npm, yarn;n- про необходимые инструменты разработки;n- а также про тестирование, сборку и deployment.",
//   "id": "fd182900-a8fe-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5edd50a52e7bdc0017fd382d"
//   },
//   "group": "ahj-7",
//   "date": "2020-06-10",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Работа с DOM (объектная модель документа)",
//   "additional": "На занятии вы узнаете:n- про browser environment;n- про обработку документа;n- что такое интерфейсы и базовые селекторы;n- а также про атрибуты.",
//   "id": "119d4db0-a8ff-11ea-b14a-8929516acc94",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eddea2ee27f230017748666"
//   },
//   "group": "pb-13",
//   "date": "2020-06-09",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Ассоциативные массивы",
//   "additional": "nНа лекции мы узнаем о том:nn  - что такое ассоциативные массивы;n  - какие особенности есть у таких массивов;n  - как описать объекты реального мира в коде.nnДополнительные материалыnГде и как можно поиграться с ассоциативными массивами:nСodewars, programming challengesnhttps://www.codewars.com/nОбъекты как ассоциативные массивы, learn javascriptnhttps://learn.javascript.ru/objectnКонсоль браузераnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Learn/JavaScript/Объекты/Основы nlearn javascriptnhttps://learn.javascript.ru/array ",
//   "id": "9516c670-a95a-11ea-954f-6de40a7144501",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee095db1ce9640017275bea"
//   },
//   "group": "pb-13",
//   "date": "2020-06-10",
//   "time": "18:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Ассоциативные массивы",
//   "additional": "nНа лекции мы узнаем о том:nn  - что такое ассоциативные массивы;n  - какие особенности есть у таких массивов;n  - как описать объекты реального мира в коде.nnДополнительные материалыnГде и как можно поиграться с ассоциативными массивами:nСodewars, programming challengesnhttps://www.codewars.com/nОбъекты как ассоциативные массивы, learn javascriptnhttps://learn.javascript.ru/objectnКонсоль браузераnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Learn/JavaScript/Объекты/Основы nlearn javascriptnhttps://learn.javascript.ru/array ",
//   "id": "16308eb0-aaf2-11ea-8885-b56fefbfa43c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee1d059960c580017d94c76"
//   },
//   "group": "onec-3",
//   "date": "2020-06-11",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Переменные",
//   "additional": "nНа вебинаре вы узнаете:n-что такое переменная и параметр сеанса;n-каковы формальные требования к именам переменных;n-как лучше называть их.nnНаучитесь:n-объявлять и инициализировать переменные;n-создавать и устанавливать параметры сеанса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "89cb85d0-abad-11ea-9124-253f71614771",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62049a169290017d2c40b"
//   },
//   "group": "bafe-10",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Вводное занятие с координатором курса",
//   "additional": "На лекции будут раскрыты основные организационные моменты, с которыми вы столкнетесь во время учебы.",
//   "id": "891970e0-ae3f-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62068a169290017d2c40c"
//   },
//   "group": "bafe-10",
//   "date": "2020-06-17",
//   "time": "19:30",
//   "teacher": "Алексей Стегура",
//   "lecture": "Как замотивировать себя на учёбу",
//   "additional": "На лекции будут раскрыты вопросы мотивации. Приходите, будет интересно!",
//   "id": "9b57b2d0-ae3f-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee621eba169290017d2c40f"
//   },
//   "group": "bhj-11",
//   "date": "2020-06-16",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Способы поиска нужного HTML-элемента",
//   "additional": "Мы узнаем о $0 в консоли, познакомимся с HTMLCollection и различными доступами к элементам. Ждем вас на вебинаре!",
//   "id": "827cac10-ae40-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62202a169290017d2c410"
//   },
//   "group": "bhj-11",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Объект события",
//   "additional": "Преподаватель расскажет, какие проблемы может вызывать использование свойства onclick, и как по-другому можно назначить и удалить обработчики событий элемента. Подробно рассмотрим объект события, содержащий подробную информацию об обрабатываемом событии, свойства событий и обработку событий клавиатуры.nДо встречи на вебинаре!",
//   "id": "900e7cf0-ae40-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62261a169290017d2c411"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Функции, объекты в JavaScript",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Функцииn2. Аргументы и rest операторn3. Функциональные выраженияn4. Стрелочные функцииn5. Объекты и их свойства",
//   "id": "c87b3880-ae40-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62283a169290017d2c412"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-17",
//   "time": "18:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Прототип и конструктор объекта",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Контекст выполненияn2. Конструктор объектаn3. Прототип объектаn4. Конструктор Objectn5. Конструктор Date и его методыn6. Методы объекта Math",
//   "id": "dd226420-ae40-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62465a169290017d2c413"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-19",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "ООП в JS (ES6)",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Классыn2. Свойстваn3. Конструктор, методы, статические методыn4. Наследование и supern5. Нововведения последних версий ES",
//   "id": "fc031870-ae41-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee624c8a169290017d2c415"
//   },
//   "group": "bphp-7",
//   "date": "2020-06-16",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Пользовательские функции",
//   "additional": "На лекции вы узнаете о:n- дублировании кодаn- синтаксисе функцийn- строгой типизацииn- рекурсииn- функции обратного вызова",
//   "id": "377042c0-ae42-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee624dfa169290017d2c416"
//   },
//   "group": "html-51",
//   "date": "2020-06-16",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На занятии вы узнаете:n- что из себя представляет работа над дипломным проектом;n- из каких этапов она состоит;n- что нужно сделать, чтобы получить допуск. Большинство из вас прекрасно показали себя на курсе, так что мы уверены, что вы отлично справитесь!",
//   "id": "450c25c0-ae42-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62576a169290017d2c418"
//   },
//   "group": "mq-25",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Медиа-функции",
//   "additional": "На лекции преподаватель подробно расскажет о медиа-функциях, позволяющих проверить различные характеристики устройства, на котором открыта страничка; затронет особенности взаимодействия пользователя с веб-страницей с помощью пальцев; особенности: hover на мобильных устройствах и особенности элементов интерфейса, с которыми удобно взаимодействовать мышкой, но неудобно пальцами с сенсорных устройств. nЖдём вас на лекции!",
//   "id": "9f028b00-ae42-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee6258fa169290017d2c419"
//   },
//   "group": "mq-25",
//   "date": "2020-06-17",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Особенности верстки графики для мобильных устройств",
//   "additional": "Преподаватель поведает о нюансах разработки для гаджетов от Apple на базе операционной системы iOS, а также для устройств, имеющих экраны с повышенной плотностью пикселей. Кроме того, будет затронута тема иконочных шрифтов и SVG (векторной) графики. nА в заключение вас ждут ещё несколько удобных свойств Flexbox:n➡️ justify-content (определяет, как браузер распределяет пространство вокруг флекс-элементов вдоль главной оси контейнера);n➡️ align-items (выравнивает флекс-элементы внутри контейнера в перпендикулярном направлении);n➡️ align-self (выравнивает флекс-элементы текущей строки, переписывая значение align-items).nЖдём вас на занятии!",
//   "id": "addda4c0-ae42-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee625bca169290017d2c41a"
//   },
//   "group": "mq-25",
//   "date": "2020-06-19",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Верстка адаптивного макета",
//   "additional": "Преподаватель разъяснит плюсы и минусы адаптивной верстки, расскажет об использовании логических операторов в медиа-запросах и поговорит о способах адаптации фоновых изображений.nА в заключение будут разобраны следующие темы:n▪️ как перестраиваются элементы для мобильного телефона;n▪️ подготовка фоновых изображений для разных устройств;n▪️ какие элементы скрываются;n▪️ содержат ли скрывающиеся блоки изображения.nЖдём вас на занятии!",
//   "id": "c87c10f0-ae42-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee626dca169290017d2c41e"
//   },
//   "group": "ra-23",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "React Router",
//   "additional": "На лекции вы изучите:n- router, Routen- вложенность Routen- linkn- состояние ссылокn- switchn- route с параметрамиn- redirectnЖдем вас на вебинаре!",
//   "id": "74661370-ae43-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62744a169290017d2c41f"
//   },
//   "group": "ra-23",
//   "date": "2020-06-17",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Redux",
//   "additional": "На занятии вы познакомитесь сn- Reduxn- React Reduxn- Хуками useSelector , useDispatchn- connectnЖдем вас на вебинаре!",
//   "id": "b20511e0-ae43-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62756a169290017d2c420"
//   },
//   "group": "ra-23",
//   "date": "2020-06-19",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Redux и Redux Thunk",
//   "additional": "На вебинаре лектор познакомит вас с:n- Reduxn- React Reduxn- хуками useSelector , useDispatchn- connectn- асинхронными действиямиn- Middlewaren- Redux ThunknЖдем вас на вебинаре, будет интересно!",
//   "id": "bd0f4d80-ae43-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee627e9a169290017d2c423"
//   },
//   "group": "ahj-7",
//   "date": "2020-06-16",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Обработка событий",
//   "additional": "На занятии вы узнаете:n- все про события;n- про метод prevent default;n- а также разницу между фазами Capturing и Bubbling.",
//   "id": "14616dc0-ae44-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee62874a169290017d2c424"
//   },
//   "group": "ahj-7",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Организация тестирования (Unit, E2E)",
//   "additional": "На занятии вы узнаете:n- про пирамиду тестирования;n- что такое unit- и E2E-тестирование;n- про компоненты;n- а также JSDOM.",
//   "id": "67b55e50-ae44-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee669e9a169290017d2c42b"
//   },
//   "group": "pb-13",
//   "date": "2020-06-16",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Функция без параметров. Область видимости",
//   "additional": "nНа лекции мы узнаем:nn  - что такое подпрограммы;n  - к каким переменным есть доступ у функции;n  - как переопределить переменную из другой области видимости.nnдополнительные материалы:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Functionsnlearnjsnhttps://learn.javascript.ru/function-basics",
//   "id": "6b91ea80-ae6b-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee66a26a169290017d2c42c"
//   },
//   "group": "pb-13",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Параметры и возвращаемое значение",
//   "additional": " nНа лекции мы узнаем:n  - как передать данные в функцию через аргументы;n  - как получить данные из функции;n  - сколько значений можно вернуть из функции.",
//   "id": "8ff3e180-ae6b-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee66a67a169290017d2c42d"
//   },
//   "group": "pb-14",
//   "date": "2020-06-15",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Базовые понятия. Переменные и числа",
//   "additional": "nДополнительные материалыnпочитать:nКак работает интернетnhttps://developer.mozilla.org/ru/docs/Learn/How_the_Internet_worksnВыражения и операторыnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Expressions_and_Operators#%D0%9E%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80%D1%8B_%D0%BF%D1%80%D0%B8%D1%81%D0%B2%D0%B0%D0%B8%D0%B2%D0%B0%D0%BD%D0%B8%D1%8FnВведение в javascriptnhttps://learn.javascript.ru/intronnпосмотреть:nЕще одна лекция о числах в javascriptnhttps://www.youtube.com/watch?v=aGTjRU7Dp20&list=PLo6puixMwuSNxJCgadaaavKqq4-ocKPrRnКак работает javascriptnhttps://www.youtube.com/watch?v=H6G63NKRSi8&feature=youtu.benhttps://www.youtube.com/watch?v=fXi49EkrMPI",
//   "id": "b69d3070-ae6b-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee66aa6a169290017d2c42e"
//   },
//   "group": "pb-14",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Логический тип и ветвление",
//   "additional": "nНа лекции мы узнаем:n  - как делать программы нелинейными — выполнять различный блок кода в зависимости от состояния программыn  - как удобно хранить информацию о признаках вида «да/нет»n  - что такое логические операции.nnnДополнительные материалы.nпочитать:nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Логические_операторыnhttps://learn.javascript.ru/logical-opsnhttps://learn.javascript.ru/comparisonnпосмотреть:nхороший обзор nhttps://www.youtube.com/watch?v=B4ZCFdrBmbEnеще один обзор с конкретными примерами, но уже на английскомnhttps://www.youtube.com/watch?v=2cGleL5FMZMnпараллельно даются несколько полезных советов для работы в консоле веб-разработчикаnhttps://www.youtube.com/watch?v=Gy87ZS5sb1w",
//   "id": "dc12e160-ae6b-11ea-af3d-8f9d19cf324e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee71b1107ed5d0017371f59"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Обработка ошибок",
//   "additional": "nНа лекции вы:n-рассмотрите ключевой вопрос профессиональной разработки — работу с ошибками;n-познакомитесь с интерфейсами — краеугольным камнем всего последующего обучения;n-разберётесь в вызовах методов и в наборах методов;n-научитесь определять наборы методов для Т, *Т и для интерфейсов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "03389b90-aed5-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee71b3b07ed5d0017371f5a"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-22",
//   "time": "19:00",
//   "teacher": "Владимир Сердюков",
//   "lecture": "Горутины и пакет sync",
//   "additional": "nНа лекции Вы обсудите теоретические основы concurrency (конкурентность) – одной из важных тем в сетевой разработкеnnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "1c8e8230-aed5-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee71b6b07ed5d0017371f5b"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-25",
//   "time": "19:00",
//   "teacher": "Владимир Сердюков",
//   "lecture": "Каналы и контекст",
//   "additional": "nНа лекции вы  продолжите рассматривать concurrency, изучите базовые моменты:n-работы с Shared Memory;n-координации выполнения с помощью Channel и Context.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "391d9ad0-aed5-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee748e807ed5d0017371f64"
//   },
//   "group": "onec-4",
//   "date": "2020-07-01",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Введение в платформу",
//   "additional": "nНа вебинаре вы узнаете о:n-том, что такое «платформа» и для чего она создавалась;n-предметно-ориентированном «Встроенном языке»;n-фирме «1С» и истории платформы;n-прикладных решениях;n-среде исполнения;n-лицензии и учебной версии;n-среде разработки;n-а также об информационной базе и конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "560b59f0-aef0-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee7491207ed5d0017371f65"
//   },
//   "group": "onec-4",
//   "date": "2020-07-03",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Среда разработки и конфигурация",
//   "additional": "nНа лекции вы узнаете:n-что такое конфигуратор для чего его используют;n-конфигурации, модулях и основных свойствах конфигурации; n-видах и обновлениях конфигурации.nnНаучитесь:n-сравнивать и объединять;n-обновлять и проверять конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "6f01e280-aef0-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee7493a07ed5d0017371f66"
//   },
//   "group": "onec-4",
//   "date": "2020-07-06",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Дерево метаданных",
//   "additional": "nНа занятии вы узнаете:n-что такое дерево метаданных и объект метаданных;n-какими бывают общие метаданные;n-зачем нужны подсистемы, картинки, элементы стиля, функциональные опции, -константы, справочники и перечисления.nnК тому же вы научитесь:n-создавать функциональные опции и константы;n-создавать перечисления;n-создавать справочники.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "86942020-aef0-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee7497007ed5d0017371f67"
//   },
//   "group": "onec-4",
//   "date": "2020-07-10",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виды клиентов и режимы работы",
//   "additional": "nНа занятии вы узнаете:n-что такое обычное и управляемое приложение;n-что такое управляемые формы;n-чем отличаются тонкий клиент, толстый клиент, веб-клиент и мобильный клиент.nnА так же научитесь:n-делать простейшие управляемые формы;n-публиковать веб-клиент.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "a6b909b0-aef0-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee7499707ed5d0017371f68"
//   },
//   "group": "onec-4",
//   "date": "2020-07-13",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Пользователи и отладка",
//   "additional": "nНа занятии вы узнаете:n-что такое пользователи ИБ и их роли;n-что такое журнал регистрации;n-что такое отладка и точка останова;n-что такое система взаимодействия.nnТакже научитесь:n-создавать пользователей ИБ, роли и назначать их пользователям;n-искать ошибки в журнале регистрации;n-использовать отладчик для расследования ошибок;n-подключать систему взаимодействия.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "be57ca70-aef0-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee749cd07ed5d0017371f69"
//   },
//   "group": "onec-4",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Внешние отчеты, обработки и расширения",
//   "additional": "nНа занятии вы узнаете:n-что такое внешние отчеты и обработки, и в чем разница между ними;n-что такое расширения конфигурации.nnНаучитесь:n-создавать простейшие внешние отчеты, обработки и расширения.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "de9bfbd0-aef0-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee749f907ed5d0017371f6a"
//   },
//   "group": "onec-4",
//   "date": "2020-07-07",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "nНа лекции вы узнаете об основных принципах, технологиях поиска необходимой информации, выборе источника.nnЛекция — общеобразовательная. Домашнего задания по ней не будет)n nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "f8b1b000-aef0-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee74a3b07ed5d0017371f6b"
//   },
//   "group": "onec-4",
//   "date": "2020-06-16",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "nНа лекции вы узнаете об основных принципах, технологиях поиска необходимой информации, выборе источника.nnЛекция — общеобразовательная. Домашнего задания по ней не будет)n nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "200fd000-aef1-11ea-bdce-5da784fd53fa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee867406838fe0017dc8472"
//   },
//   "group": "onec-4",
//   "date": "2020-06-17",
//   "time": "18:30",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "nНа лекции вы узнаете об основных принципах, технологиях поиска необходимой информации, выборе источника.nnЛекция — общеобразовательная. Домашнего задания по ней не будет)n nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "02454ff0-af9b-11ea-ace0-e3a742267753",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ee87b436838fe0017dc8473"
//   },
//   "group": "pb-13",
//   "date": "2020-06-16",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Функция без параметров. Область видимости ",
//   "additional": "nНа лекции мы узнаем:nn  - что такое подпрограммы;n  - к каким переменным есть доступ у функции;n  - как переопределить переменную из другой области видимости.nnдополнительные материалы:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Functionsnlearnjsnhttps://learn.javascript.ru/function-basics",
//   "id": "efdde4b0-afa6-11ea-ace0-e3a742267753",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eea59ab9e43a10017c24cd9"
//   },
//   "group": "bgo-1",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Владимир Сердюков",
//   "lecture": "Работа с файлами",
//   "additional": "nНа лекции вы:n-познакомитесь с вводом-выводом (io);n-изучите "стандартный" механизм для работы с записью файлов, включая правильное закрытие и обработку ошибок.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "16ffc180-b0c4-11ea-b112-5b596a4c80b4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eea5fb79e43a10017c24cdc"
//   },
//   "group": "devops-1",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Проверка связи",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "b1731070-b0c7-11ea-b112-5b596a4c80b4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eea5ff69e43a10017c24cdd"
//   },
//   "group": "ago-1",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Ильназ Гильязов",
//   "lecture": "Проверка",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "d7741170-b0c7-11ea-b112-5b596a4c80b4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eea627d9e43a10017c24ce0"
//   },
//   "group": "ajs-8",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Стандарты и рабочее окружение",
//   "additional": "На занятии вы узнаете о:n- редакциях и их стандартахn- рабочем окруженииnУзнаете, что собой представляют npm, live-server, Babel и ESLint.",
//   "id": "58b455f0-b0c9-11ea-b112-5b596a4c80b4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eea62f99e43a10017c24ce2"
//   },
//   "group": "bphp-7",
//   "date": "2020-06-18",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Основы работы с объектами",
//   "additional": "На лекции вы узнаете о:n- манипуляциях с датой и временемn- обработке ошибокn- механизме исключений",
//   "id": "a319bef0-b0c9-11ea-b112-5b596a4c80b4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eeb23aab69a4c00179796f4"
//   },
//   "group": "devops-1",
//   "date": "2020-06-19",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "проверка связи",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "7d09cd90-b13c-11ea-838d-830f76eb1c44",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eeb23ddb69a4c00179796f5"
//   },
//   "group": "devops-1",
//   "date": "2020-06-20",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "проверка связи",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "9bbb29f0-b13c-11ea-838d-830f76eb1c44",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eeb2e4bb69a4c00179796f7"
//   },
//   "group": "git-14",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "d2f7e240-b142-11ea-838d-830f76eb1c44",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee1e4aeab4340017009633"
//   },
//   "group": "devops-1",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Системы контроля версий",
//   "additional": "nНа вебинаре вы научитесь:n-создавать и клонировать репозитории;n-определять и изменять состояния файлов;n-записывать изменения в репозиторий;n-удалять и перемещать файлы в репозитории.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "0c451830-b303-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee1e83eab4340017009634"
//   },
//   "group": "devops-1",
//   "date": "2020-06-25",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Введение в DevOps",
//   "additional": "nНа вебинаре вы:n-обсудите принципы учебы на курсе;n-разберётесь, что включает в себя DevOps;n-поговорите об  инструментах;n-разберётесь в основных подходах к разработке.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "2e535b30-b303-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee1fa5eab4340017009637"
//   },
//   "group": "devops-1",
//   "date": "2020-07-06",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Ветвления в Git. Хранилища репозиториев",
//   "additional": "nНа лекции вы:n-узнаете, как работают ветки и мержи;n-научитесь работать с удаленными ветками;n-освоите инструмент Rebase;n-узнаете, как использовать хуки.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "db3d4180-b303-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee1fd5eab4340017009638"
//   },
//   "group": "devops-1",
//   "date": "2020-07-02",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Основы Git",
//   "additional": "nНа лекции вы научитесь:n-работать с историей коммитов;n-отменять изменения;n-работать с удаленными репозиториями;n-создавать и использовать теги;n-работать с ветвлениями.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "f7f16e50-b303-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee6166eab434001700963f"
//   },
//   "group": "onec-1",
//   "date": "2020-07-01",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Конструктор запросов",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "0c9d6a30-b32b-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee61a4eab4340017009640"
//   },
//   "group": "onec-1",
//   "date": "2020-07-06",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Условия и подзапросы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "31bd0be0-b32b-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee61e0eab4340017009641"
//   },
//   "group": "onec-1",
//   "date": "2020-07-08",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Итоги и группировки",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "5592ef80-b32b-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee6225eab4340017009642"
//   },
//   "group": "onec-1",
//   "date": "2020-07-14",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Соединения",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "7e904090-b32b-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee625deab4340017009643"
//   },
//   "group": "onec-1",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Временные таблицы и пакетные запросы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9fc00a70-b32b-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee62a3eab4340017009644"
//   },
//   "group": "onec-1",
//   "date": "2020-07-20",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Введение в СКД",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c9c4b960-b32b-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee62e2eab4340017009645"
//   },
//   "group": "onec-1",
//   "date": "2020-07-22",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Работа с СКД",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "eed91070-b32b-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee6384eab4340017009646"
//   },
//   "group": "onec-1",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Сусанна Алиева",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nВы узнаете, что из себя представляет дипломная работа, и кто поможет вам в работе над ней. nПоговорите о сроках выполнения работы и обсудите другие вопросы, связанные с завершением второго блока на профессии «1С-разработчик».n nЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях",
//   "id": "4fe40d20-b32c-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eee643feab4340017009647"
//   },
//   "group": "onec-1",
//   "date": "2020-07-14",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Соединения",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "bf6917d0-b32c-11ea-8073-a94b2731a70a",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3a3a5ae39a0017138cba"
//   },
//   "group": "ajs-8",
//   "date": "2020-06-23",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Модули",
//   "additional": "На занятии вы узнаете:n- зачем нужны ES-модули;n- что такое модулиnПознакомитесь с CommonJS, Webpack и его функциональным файлом.",
//   "id": "49e8ecd0-b3ac-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3aa25ae39a0017138cbc"
//   },
//   "group": "bafe-10",
//   "date": "2020-06-25",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "На лекции будут раскрыты следующие вопросы:n- как работает интернетn- протокол HTTPn- что такое серверnи многое другое.nЖдем вас на лекции!",
//   "id": "87ee9c50-b3ac-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3b0f5ae39a0017138cbd"
//   },
//   "group": "bhj-11",
//   "date": "2020-06-23",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "DOM",
//   "additional": "Мы познакомимся и научимся работать с событиями  загрузки DOM, навигацией, различными атрибутами. Приходите, будет интересно!",
//   "id": "c8f270a0-b3ac-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3b325ae39a0017138cbe"
//   },
//   "group": "bhj-11",
//   "date": "2020-06-25",
//   "time": "18:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На лекции рассмотрим, какие бывают события. Остановимся на работе с input и output. Ждем вас на вебинаре!n",
//   "id": "de11d980-b3ac-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3bda5ae39a0017138cbf"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-23",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Обработка исключений и замыкания",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Внутренние исключений выполненияn2. Создание собственных исключенийn3. Перехват исключенийn4. Консольные методы для удобной работыn5. Области видимостиn6. Замыканияn7. Конструкция delete",
//   "id": "41dba810-b3ad-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3bf95ae39a0017138cc0"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-25",
//   "time": "18:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Прототип массива, функции высшего порядка",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Константы и массивыn2. Поиск в массивеn3. Функции высшего порядкаn4. Расширенный поиск в массивеn5. Преобразование массива",
//   "id": "54322cf0-b3ad-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3ef45ae39a0017138cc3"
//   },
//   "group": "bphp-7",
//   "date": "2020-06-22",
//   "time": "19:00",
//   "teacher": "Сергей Вертепов",
//   "lecture": "HTTP, заголовки, сессии",
//   "additional": "На лекции вы узнаете о:n- протоколе HTTPn- GET-запросахn- Cookiesn- сессиях",
//   "id": "1b43fa70-b3af-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3f0c5ae39a0017138cc4"
//   },
//   "group": "bphp-7",
//   "date": "2020-06-24",
//   "time": "19:00",
//   "teacher": "Сергей Вертепов",
//   "lecture": "Файлы, html формы",
//   "additional": "На лекции вы узнаете о:n- протоколе HTTPn- GET-запросахn- Cookiesn- сессиях",
//   "id": "29481520-b3af-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3f415ae39a0017138cc5"
//   },
//   "group": "mq-25",
//   "date": "2020-06-23",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивная типографика",
//   "additional": "На занятии преподаватель расскажет вам о таких полезных медиа-функциях как orientation (ориентация области просмотра) и aspect-ratio (соотношение ширины к высоте области просмотра), а также об относительной единице измерения rem.nКроме того, будут разобраны следующие особенности HTML-элементов:n▪️ type email;n▪️ type tel;n▪️ type search;nИ в завершение лекции будет рассмотрен пример улучшения формы с использованием type="email" / type="search" / type="tel" и деградацией до type="text" в старых браузерах. nНе пропустите, занятие будет интересным! ",
//   "id": "495298e0-b3af-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef3f605ae39a0017138cc6"
//   },
//   "group": "mq-25",
//   "date": "2020-06-26",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Breakpoints",
//   "additional": "На лекции преподаватель расскажет о так называемых контрольных точках в CSS - Breakpoints и критериях их выбора, разберет подход к версте «mobile first» и поговорит о единицах измерениях vh, vw, vmin, vmax, а также как с такими единицами измерения работает функция calc().nКроме того, вы узнаете об атрибуте srcset у тега img и увидите пример загрузки изображений через атрибут srcset и фоллбека в виде src. А напоследок мы немного побеседуем на тему подготовки графики для различных устройств.nЖдём вас на занятии!",
//   "id": "5b84a5d0-b3af-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef40e85ae39a0017138cca"
//   },
//   "group": "ra-23",
//   "date": "2020-06-22",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Redux Observable",
//   "additional": "На вебинаре лектор познакомит вас с:n1. RxJSn2. Observablen3. RxJS операторыn4. Higher Order Observablesn5. Redux Observablen6. Epicsn7. Обработка ошибокnnЖдем вас на вебинаре.",
//   "id": "456f00a0-b3b0-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef41005ae39a0017138ccb"
//   },
//   "group": "ra-23",
//   "date": "2020-06-24",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Redux Saga",
//   "additional": "На вебинаре преподаватель расскажет о:n- Side Effectsn- Generatorsn- Redux Sagan- Sagasn- Effectsn- Watchers and Workersn- Вызове APIn- Обработке ошибокn- RetrynБудет интересно. Ждем вас на вебинаре!)",
//   "id": "53ca6310-b3b0-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef43505ae39a0017138cd6"
//   },
//   "group": "ahj-7",
//   "date": "2020-06-23",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На занятии вы узнаете:n- что такое валидация;n- про Position & Metrics;n- про кэширование данных в LocalStorage;n- а также про события Input и Change.",
//   "id": "b469d740-b3b1-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eef442e5ae39a0017138cd8"
//   },
//   "group": "ahj-7",
//   "date": "2020-06-25",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Drag & Drop, Работа с файлами",
//   "additional": "На занятии вы узнаете:n- про генерацию событий;n- про FileAPI;n- а также про реализации Drag and Drop.",
//   "id": "389d1270-b3b2-11ea-8d8c-414c5103711b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef09b4c11d0a90017b3c685"
//   },
//   "group": "SD-12",
//   "date": "2020-06-25",
//   "time": "19:00",
//   "teacher": "Ирина Хомутова",
//   "lecture": "Общаемся с компьютером",
//   "additional": "n",
//   "id": "bc26cd80-b47e-11ea-8edf-f37debcc384f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef09b6f11d0a90017b3c686"
//   },
//   "group": "SD-12",
//   "date": "2020-06-30",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Три кита веба: HTML, CSS, JS",
//   "additional": "n",
//   "id": "d10fe420-b47e-11ea-8edf-f37debcc384f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef09b8611d0a90017b3c687"
//   },
//   "group": "SD-12",
//   "date": "2020-07-02",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Интернет — большая библиотека",
//   "additional": "n",
//   "id": "dec3e300-b47e-11ea-8edf-f37debcc384f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef09b9a11d0a90017b3c688"
//   },
//   "group": "SD-12",
//   "date": "2020-07-06",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Вся правда о профессии разработчика",
//   "additional": "n",
//   "id": "eae533f0-b47e-11ea-8edf-f37debcc384f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef0cf4311d0a90017b3c69f"
//   },
//   "group": "ajs-8",
//   "date": "2020-06-25",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Платформы: браузер vs Node.js",
//   "additional": "На занятии вы узнаете о:n- платформахn- глобальном объектеnПознакомитесь с Node.js, нюансами работы браузера и многим другим.",
//   "id": "b5571630-b49d-11ea-8edf-f37debcc384f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef19dc440b5c20017a08639"
//   },
//   "group": "pb-14",
//   "date": "2020-06-23",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Строки. Алгоритмы. Как отлаживать код ",
//   "additional": "nНа лекции мы узнаем:n  - как работают строки в JS;n  - что такое алгоритмы и как их сравнивать;n  - какие существуют приемы отладки кода;n  - как читать ошибки интерпретатора.nnДополнительные материалыnпочитать:nклассическая документация от MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Stringnразбор от Ильи Кантораnhttps://learn.javascript.ru/stringnnпосмотреть:n20 методов, которые помогут вам жонглировать строками в JS, как настоящий PROnhttps://www.youtube.com/watch?v=VRz0nbax0uInхороший обзор (на английском)nhttps://www.youtube.com/watch?v=DljZQyNwdOgnпро типы ошибок в JS и то как с ними боротьсяnhttps://stepik.org/lesson/99598/step/1?unit=75361nувлекательнейшая лекция по алгоритмам (в рамках легендарного курса CS50 от Harvard University)nhttps://www.youtube.com/watch?v=U9o49qwa6hknкурс от Computer Science Center на stepiknhttps://stepik.org/course/217/nеще немного про алгоритмы (How Binary Search Works)nhttps://www.youtube.com/watch?v=JQhciTuD3E8",
//   "id": "cb3433e0-b518-11ea-b61e-6fce8a810621",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef19e3940b5c20017a0863a"
//   },
//   "group": "pb-14",
//   "date": "2020-06-26",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Массивы и базовые методы работы с ними",
//   "additional": " nНа лекции мы узнаем:n  - что такое массивы.n  - для чего используются массивыn  - какие методы мы можем применять для работы с массивамиnnДополнительные материалы.nпочитать:nпо традиции - документация на MDN.nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array nопять же, по традиции learn.javascriptnhttps://learn.javascript.ru/array nnпосмотреть:nотличный обзор того, что мы сегодня обсудили (и даже больше) от Sorax.nhttps://www.youtube.com/watch?v=3OjuRfR8RNg nхороший обзор на английском.nhttps://www.youtube.com/watch?v=orAS-MBh5f4 ",
//   "id": "117324b0-b519-11ea-b61e-6fce8a810621",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef1e11540b5c20017a0863b"
//   },
//   "group": "pb-13",
//   "date": "2020-06-23",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nМы узнаем: n  - как получить допуск к дипломной работе;n  - что из себя представляет дипломный проект и кто поможет нам в работе над ним;n  - Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса.nnБудем рады видеть вас онлайн!",
//   "id": "eb5063b0-b540-11ea-b61e-6fce8a810621",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef1f05340b5c20017a0863c"
//   },
//   "group": "javaqa-6",
//   "date": "2020-06-26",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Основы автоматизации",
//   "additional": "Основы автоматизации",
//   "id": "0128cd40-b54a-11ea-b61e-6fce8a810621",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef1f0aa40b5c20017a0863d"
//   },
//   "group": "javaqa-6",
//   "date": "2020-06-30",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Тестирование API, Continuous Integration",
//   "additional": "Тестирование API, Continuous Integration",
//   "id": "349bbb10-b54a-11ea-b61e-6fce8a810621",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef1f19e40b5c20017a08641"
//   },
//   "group": "javaqa-6",
//   "date": "2020-07-13",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Behaviour Driven Development",
//   "additional": "Behaviour Driven Development ",
//   "id": "c63ac890-b54a-11ea-b61e-6fce8a810621",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef1f22740b5c20017a08644"
//   },
//   "group": "AQA-5",
//   "date": "2020-06-29",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Репортинг: Report Portal ",
//   "additional": "Репортинг: Report Portal ",
//   "id": "18140000-b54b-11ea-b61e-6fce8a810621",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef1f26240b5c20017a08645"
//   },
//   "group": "AQA-5",
//   "date": "2020-07-02",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Заключительная лекция",
//   "additional": "Заключительная лекция ",
//   "id": "3b2b4e90-b54b-11ea-b61e-6fce8a810621",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef45e820bcd2400175030c1"
//   },
//   "group": "ra-23",
//   "date": "2020-06-26",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Redux Saga",
//   "additional": "На вебинаре преподаватель расскажет о:n- Side Effectsn- Generatorsn- Redux Sagan- Sagasn- Effectsn- Watchers and Workersn- Вызове APIn- Обработке ошибокn- RetrynБудет интересно. Ждем вас на вебинаре!)",
//   "id": "da7ca490-b6bc-11ea-8444-1972dc5a67af",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef4a1a30bcd2400175030c3"
//   },
//   "group": "ahj-7",
//   "date": "2020-06-26",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Drag and Drop, Работа с файлами",
//   "additional": "На занятии вы узнаете:n- про генерацию событий;n- про FileAPI;n- а также про реализации Drag and Drop.",
//   "id": "dde03ac0-b6e4-11ea-8444-1972dc5a67af",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef6381c592fd00017c17fa5"
//   },
//   "group": "bgo-1",
//   "date": "2020-07-10",
//   "time": "19:00",
//   "teacher": "Владимир Сердюков",
//   "lecture": "Работа с сетью, HTTP 1.1, HTTP 2",
//   "additional": "nНа лекции вы:n-поговорите о сетевом взаимодействии;n-немного затронете протоколы ТСР/IС;n-начнете рассматривать НТТР.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "2445fe80-b7d7-11ea-8076-091f9a4b6f9f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef63869592fd00017c17fa6"
//   },
//   "group": "bgo-1",
//   "date": "2020-07-14",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "HTTP: разработка клиента и интеграция со сторонними сервисами",
//   "additional": "nНа лекции вы:n-поговорите о том, как использовать НТТР для интеграции со сторонними сервисами.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "52845f80-b7d7-11ea-8076-091f9a4b6f9f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef63992592fd00017c17fa8"
//   },
//   "group": "bgo-1",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Дмитрий Титов",
//   "lecture": "Docker and Docker Compose: управление сервисами и упаковка приложений",
//   "additional": "nНа лекции вы:n-поговорите о системах виртуализации и контейнеризации;n-поработаете с Docker & Docker Compose.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "03277d40-b7d8-11ea-8076-091f9a4b6f9f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89aa456881b0017bc29d3"
//   },
//   "group": "ajs-8",
//   "date": "2020-06-30",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Unit-тестирование",
//   "additional": "На занятии вы познакомитесь с:n- Unit-тестированиеn- покрытием кодаn- Jestn- Mock'амиn- Data Driven тестами",
//   "id": "0c059020-b943-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89b5856881b0017bc29d4"
//   },
//   "group": "bafe-10",
//   "date": "2020-06-29",
//   "time": "18:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Путь frontend-разработчика",
//   "additional": "Вы узнаете о том, из чего состоит путь разработчика, какие есть перспективы. Приходите, будет увлекательно!",
//   "id": "77308f80-b943-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89b7456881b0017bc29d5"
//   },
//   "group": "bhj-11",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Изменение структуры HTML-документа",
//   "additional": "На лекции мы познакомимся с содержимым HTML-документа, узнаем о представлении элемента и научимся управлять различными элементами. Не пропустите вебинар, чтобы задать интересующие вопросу лектору лично.n",
//   "id": "88150dd0-b943-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89bfa56881b0017bc29d6"
//   },
//   "group": "bhj-11",
//   "date": "2020-07-01",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Асинхронные запросы",
//   "additional": "Преподаватель расскажет нам о принципах асинхронности, рассмотрит FormData и отправку данных формы. И это только небольшая часть того, что будет освещено на лекции. Приходите, будет увлекательно!n",
//   "id": "d7be1ed0-b943-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89c0f56881b0017bc29d7"
//   },
//   "group": "bhj-11",
//   "date": "2020-07-03",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Хранение состояния на клиенте и отправка на сервер",
//   "additional": "Преподаватель расскажет нам о document.cookie и localStorage. Осветит тему XHR: для чего и где используется. Приходите, будет интересно!n",
//   "id": "e43b9980-b943-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89c2c56881b0017bc29d8"
//   },
//   "group": "bjs-12",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Асинхронность",
//   "additional": "На лекции будут раскрыты следующие темы: n1. Понятие асинхронностиn2. Асинхронные функции",
//   "id": "f5c7a270-b943-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89c4556881b0017bc29d9"
//   },
//   "group": "bjs-12",
//   "date": "2020-07-02",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "04667680-b944-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89c7556881b0017bc29da"
//   },
//   "group": "mq-25",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивные изображения",
//   "additional": "На лекции вы дополните свои знания полезными flexbox-свойствами:n✅ flex-grow - растяжение элементов;n✅ flex-shrink - сужение элементов;n✅ flex-basis - базовая ширина элемента;n✅ flex - задание базовой ширины и трансформации элемента одним свойством;n✅ order - порядок отображения элементов.nКроме того, вы познакомитесь с тегом <picture> и рассмотрите пример загрузки различных вариантов фонового изображения для разных разрешений с его помощью. А в заключение вы закрепите тему подготовки графики для разных устройств. nЗанятие будет занимательным, не пропустите!",
//   "id": "20fa7120-b944-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89c8d56881b0017bc29db"
//   },
//   "group": "mq-25",
//   "date": "2020-07-01",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "Вы узнаете, что из себя представляет работа над дипломным проектом, какие будут сроки и что нужно сделать, чтобы получить допуск. nБольшинство из вас прекрасно показали себя на курсе, так что мы уверены, что вы отлично справитесь! ",
//   "id": "2fc229f0-b944-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89cb056881b0017bc29dc"
//   },
//   "group": "ahj-7",
//   "date": "2020-06-30",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Работа с HTTP",
//   "additional": "На занятии вы узнаете:n- все про http, XMLHttpRequest и SOP;n- как упростить взаимодействие по HTTP с помощью Fetch API;n- а также про принцип построения rest.",
//   "id": "44a63780-b944-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef89cd356881b0017bc29dd"
//   },
//   "group": "ahj-7",
//   "date": "2020-07-02",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "EventSource, Websockets",
//   "additional": "На занятии вы узнаете:n- про технологию Server Sent Events;n- а также как работать с протоколом связи WebSocket.",
//   "id": "59090720-b944-11ea-a826-29c89d6082df",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef9892a55607000175af3c7"
//   },
//   "group": "pb-14",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": " Алёна Батицкая",
//   "lecture": "Циклы",
//   "additional": "nНа лекции мы узнаем:nn  - что такое циклы и для чего они нужны;n  - как правильно писать циклы;n  - как работать с циклами и массивами.nnnДополнительные материалы:nЗдесь можно поизучать циклы самостоятельноnСodewars, programming challengesnhttps://www.codewars.com/nЦиклы while, for, learn.javascript.runhttps://learn.javascript.ru/while-fornМассивы: методы, learn.javascript.runhttps://learn.javascript.ru/array-methodsnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Циклы_и_итерацииnlearn javascriptnhttps://learn.javascript.ru/while-fornnпосмотреть:nобзор циклов от Soraxnhttps://www.youtube.com/watch?v=ITr-SzUIDpQnхороший обзор на английскомnhttps://www.youtube.com/watch?v=orAS-MBh5f4",
//   "id": "37e724e0-b9d1-11ea-b276-5d107155db54",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef989b755607000175af3c8"
//   },
//   "group": "pb-14",
//   "date": "2020-07-02",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Ассоциативные массивы",
//   "additional": "nНа лекции мы узнаем о том:nn  - что такое ассоциативные массивы;n  - какие особенности есть у таких массивов;n  - как описать объекты реального мира в коде.nnnДополнительные материалыnГде и как можно поиграться с ассоциативными массивами:nСodewars, programming challengesnhttps://www.codewars.com/nОбъекты как ассоциативные массивы, learn javascriptnhttps://learn.javascript.ru/objectnКонсоль браузераnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Learn/JavaScript/Объекты/Основы nlearn javascriptnhttps://learn.javascript.ru/array ",
//   "id": "8bea4130-b9d1-11ea-b276-5d107155db54",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef98a4155607000175af3c9"
//   },
//   "group": "pb-14",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Циклы",
//   "additional": "nНа лекции мы узнаем:nn  - что такое циклы и для чего они нужны;n  - как правильно писать циклы;n  - как работать с циклами и массивами.nnnДополнительные материалы:nЗдесь можно поизучать циклы самостоятельноnСodewars, programming challengesnhttps://www.codewars.com/nЦиклы while, for, learn.javascript.runhttps://learn.javascript.ru/while-fornМассивы: методы, learn.javascript.runhttps://learn.javascript.ru/array-methodsnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Циклы_и_итерацииnlearn javascriptnhttps://learn.javascript.ru/while-fornnпосмотреть:nобзор циклов от Soraxnhttps://www.youtube.com/watch?v=ITr-SzUIDpQnхороший обзор на английскомnhttps://www.youtube.com/watch?v=orAS-MBh5f4",
//   "id": "de557f70-b9d1-11ea-b276-5d107155db54",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5ef99b403d95fb30acffb945"
//   },
//   "group": "ra-23",
//   "date": "2020-06-29",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "ff982980-b9db-11ea-b58a-7faec584c2d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efa02798553dd001797ba8b"
//   },
//   "group": "bphp-7",
//   "date": "2020-06-30",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Развертывание приложения на хостинге",
//   "additional": "На лекции вы узнаете:n- что такое веб-серверn- виды хостинговn- хостингу herokunА также познакомитесь с введением в composer и деплоем php приложения в heroku.",
//   "id": "8601e000-ba19-11ea-b96b-59ee58ea5f57",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efa26968553dd001797ba8c"
//   },
//   "group": "onec-3",
//   "date": "2020-07-10",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Интерфейс конфигурации",
//   "additional": "nНа вебинаре вы узнаете:n-из каких частей состоит управляемый интерфейс;n-как настраивается каждая часть интерфейса;n-как связаны подсистемы и пользовательский интерфейс;n-как команды размещаются в интерфейсе;n-как настроить расположение основных панелей;n-что такое команда и как она размещается в интерфейсе;n-что такое «основная форма;n-как настроить отображение названий объектов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "0c919c40-ba2f-11ea-b96b-59ee58ea5f57",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efa27028553dd001797ba8d"
//   },
//   "group": "onec-3",
//   "date": "2020-07-15",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Формы, их реквизиты и данные",
//   "additional": "nНа лекции вы узнаете:n-почему управляемая форма делится на серверную и клиентскую части;n-из каких частей состоит форма;n-что такое реквизиты формы;n-что такое элементы формы;n-что такое параметры формы;n-что такое команды формы;n-как располагать элементы горизонтально и выделять группы элементов визуально;n-как писать клиентские и серверные методы;n-что такое «с контекстом» и «без контекста».nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "4cf16860-ba2f-11ea-b96b-59ee58ea5f57",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efa27588553dd001797ba8e"
//   },
//   "group": "onec-3",
//   "date": "2020-07-17",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Элементы управления",
//   "additional": "nНа лекции вы узнаете про:n-общие свойства элементов управления и их иерархию;n-декоративные элементы;n-флажки, переключатели, тумблеры;n-поля ввода и управляющие кнопки полей ввода;n-свойство «СписокВвода» и его влияние на элемент;n-механику выбора значений;n-страницы форм.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "80533f30-ba2f-11ea-b96b-59ee58ea5f57",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efa279b8553dd001797ba8f"
//   },
//   "group": "onec-3",
//   "date": "2020-07-20",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Команды",
//   "additional": "nНа лекции вы:n-углубите знания по командам;n-изучите особенности модуля команд, директив компиляции;n-рассмотрите назначение параметра ПараметрыВыполненияКоманды;n-рассмотрите отличия общих (глобальных) команд и команд, подчиненных объекту метаданных;n-рассмотрите  командный интерфейс формы;n-рассмотрите  наиболее частые сценарии открытия форм из модуля команды;n-изучите служебные системные параметры открытия форм.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "a8118090-ba2f-11ea-b96b-59ee58ea5f57",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efa27f08553dd001797ba90"
//   },
//   "group": "onec-3",
//   "date": "2020-07-21",
//   "time": "18:30",
//   "teacher": "Сусанна Алиева",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nВы узнаете, что из себя представляет дипломная работа, и кто поможет вам в работе над ней. nПоговорите о сроках выполнения работы и обсудите другие вопросы, связанные с завершением первого блока на профессии «1С-разработчик».n nЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях",
//   "id": "db1001b0-ba2f-11ea-b96b-59ee58ea5f57",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf61841651f0017e9e41b"
//   },
//   "group": "java-13",
//   "date": "2020-07-02",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Полиморфизм",
//   "additional": "n",
//   "id": "bbdd7180-baaa-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf64941651f0017e9e41c"
//   },
//   "group": "java-13",
//   "date": "2020-07-06",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Абстракции и интерфейсы",
//   "additional": "n",
//   "id": "d8f912b0-baaa-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf66541651f0017e9e41d"
//   },
//   "group": "java-13",
//   "date": "2020-07-09",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Исключения, Stacktrace, регулярные выражения",
//   "additional": "n",
//   "id": "e9e46ed0-baaa-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf70b41651f0017e9e41f"
//   },
//   "group": "java-13",
//   "date": "2020-07-13",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "4c88d030-baab-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf73141651f0017e9e420"
//   },
//   "group": "java-13",
//   "date": "2020-07-20",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллекции List",
//   "additional": "n",
//   "id": "62f663f0-baab-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf74941651f0017e9e421"
//   },
//   "group": "java-13",
//   "date": "2020-07-22",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллекции Queue",
//   "additional": "n",
//   "id": "71afc4e0-baab-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf76241651f0017e9e422"
//   },
//   "group": "java-13",
//   "date": "2020-07-28",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции HashSet и HashMap",
//   "additional": "n",
//   "id": "80920a90-baab-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf77a41651f0017e9e423"
//   },
//   "group": "java-13",
//   "date": "2020-07-30",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции TreeSet",
//   "additional": "n",
//   "id": "8ebce720-baab-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf7d641651f0017e9e424"
//   },
//   "group": "java-13",
//   "date": "2020-08-03",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции TreeMap",
//   "additional": "n",
//   "id": "c5cb4b30-baab-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efaf7ee41651f0017e9e425"
//   },
//   "group": "java-13",
//   "date": "2020-08-05",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "d3bffc90-baab-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb04dd41651f0017e9e427"
//   },
//   "group": "java-14",
//   "date": "2020-07-01",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Структура программы",
//   "additional": "n",
//   "id": "897d8b40-bab3-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb04f141651f0017e9e428"
//   },
//   "group": "java-14",
//   "date": "2020-07-07",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Условные операторы и циклы",
//   "additional": "n",
//   "id": "9531e990-bab3-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb051141651f0017e9e429"
//   },
//   "group": "java-14",
//   "date": "2020-07-09",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "n",
//   "id": "a87c6b60-bab3-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb05f141651f0017e9e42a"
//   },
//   "group": "java-14",
//   "date": "2020-07-10",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: примитивы",
//   "additional": "n",
//   "id": "2e152a00-bab4-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb060441651f0017e9e42b"
//   },
//   "group": "java-14",
//   "date": "2020-07-13",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: объекты",
//   "additional": "n",
//   "id": "3956f060-bab4-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb062941651f0017e9e42c"
//   },
//   "group": "java-14",
//   "date": "2020-07-15",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структура класса",
//   "additional": "n",
//   "id": "4efb8ed0-bab4-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb065041651f0017e9e42d"
//   },
//   "group": "java-14",
//   "date": "2020-07-20",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач и основы работы в IDE",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "66940e00-bab4-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb06d941651f0017e9e42e"
//   },
//   "group": "java-14",
//   "date": "2020-07-28",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Массивы одномерные",
//   "additional": "n",
//   "id": "b803fc50-bab4-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb06ec41651f0017e9e42f"
//   },
//   "group": "java-14",
//   "date": "2020-07-30",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Массивы многомерные",
//   "additional": "n",
//   "id": "c373fea0-bab4-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb070541651f0017e9e430"
//   },
//   "group": "java-14",
//   "date": "2020-08-04",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Модификаторы доступа, наследование",
//   "additional": "n",
//   "id": "d2633ca0-bab4-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb071e41651f0017e9e431"
//   },
//   "group": "java-14",
//   "date": "2020-08-06",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Полиморфизм",
//   "additional": "n",
//   "id": "e14b27a0-bab4-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0aa841651f0017e9e433"
//   },
//   "group": "jd-1",
//   "date": "2020-07-06",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Generics в коллекциях и методах",
//   "additional": "n",
//   "id": "fd7b4570-bab6-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0ab941651f0017e9e434"
//   },
//   "group": "jd-1",
//   "date": "2020-07-09",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Лямбда-выражения и функциональные интерфейсы",
//   "additional": "n",
//   "id": "078ffd80-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0ad041651f0017e9e435"
//   },
//   "group": "jd-1",
//   "date": "2020-07-13",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Stream API. Потоки, повторные вызовы, основные методы",
//   "additional": "n",
//   "id": "150063b0-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0ae441651f0017e9e436"
//   },
//   "group": "jd-1",
//   "date": "2020-07-16",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Потоки ввода-вывода. Работа с файлами. Сериализация",
//   "additional": "n",
//   "id": "20d0d580-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0afa41651f0017e9e437"
//   },
//   "group": "jd-1",
//   "date": "2020-07-21",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Сборка проектов. Maven и Gradle",
//   "additional": "n",
//   "id": "2e59f3d0-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0b0b41651f0017e9e438"
//   },
//   "group": "jd-1",
//   "date": "2020-07-23",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Работа с файлами CSV, XML, JSON",
//   "additional": "n",
//   "id": "38733fc0-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0b4a41651f0017e9e439"
//   },
//   "group": "an-11",
//   "date": "2020-07-01",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Верстка графического интерфейса в Android",
//   "additional": "n",
//   "id": "5da8da70-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0b6041651f0017e9e43a"
//   },
//   "group": "an-11",
//   "date": "2020-07-03",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "3.2 Другие Виды Layouts",
//   "additional": "n",
//   "id": "6ad30fe0-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0b7f41651f0017e9e43b"
//   },
//   "group": "jd-1",
//   "date": "2020-07-20",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "7d2e76c0-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0ba641651f0017e9e43c"
//   },
//   "group": "an-11",
//   "date": "2020-07-27",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Работа с файлами в Android: внешние файлы",
//   "additional": "n",
//   "id": "949a1990-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0bbb41651f0017e9e43d"
//   },
//   "group": "an-11",
//   "date": "2020-07-29",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Работа с файлами в Android: внутренние файлы",
//   "additional": "n",
//   "id": "a171e940-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0c2641651f0017e9e43f"
//   },
//   "group": "an-12",
//   "date": "2020-07-03",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Введение в Android. Инструменты и первый проект",
//   "additional": "n",
//   "id": "e0c09380-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0c3a41651f0017e9e440"
//   },
//   "group": "an-12",
//   "date": "2020-07-07",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Приложение "Hello World"",
//   "additional": "n",
//   "id": "ed07e300-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0c4e41651f0017e9e441"
//   },
//   "group": "an-12",
//   "date": "2020-07-10",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Проектирование интерфейса",
//   "additional": "n",
//   "id": "f8d01770-bab7-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0c6041651f0017e9e442"
//   },
//   "group": "an-12",
//   "date": "2020-07-14",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Компоненты View. Иерархия Views",
//   "additional": "n",
//   "id": "03c36fb0-bab8-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0c7341651f0017e9e443"
//   },
//   "group": "an-12",
//   "date": "2020-07-17",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Компоненты ViewGroup. SharedPrefs",
//   "additional": "n",
//   "id": "0eb28230-bab8-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0c9241651f0017e9e444"
//   },
//   "group": "an-12",
//   "date": "2020-07-21",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "21661b30-bab8-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0ca641651f0017e9e445"
//   },
//   "group": "an-12",
//   "date": "2020-07-27",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Верстка графического интерфейса в Android",
//   "additional": "n",
//   "id": "2d8a5250-bab8-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb0cbf41651f0017e9e446"
//   },
//   "group": "an-12",
//   "date": "2020-07-30",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Другие Виды Layouts",
//   "additional": "n",
//   "id": "3c62fb10-bab8-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb11c841651f0017e9e448"
//   },
//   "group": "kt-9",
//   "date": "2020-07-03",
//   "time": "20:00",
//   "teacher": "Иван Лавров",
//   "lecture": "Введение в язык, основные концепции, рабочее окружение",
//   "additional": "n",
//   "id": "3ca37f20-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb11db41651f0017e9e449"
//   },
//   "group": "kt-9",
//   "date": "2020-07-07",
//   "time": "20:00",
//   "teacher": "Иван Лавров",
//   "lecture": "Классы, объекты, наследование",
//   "additional": "n",
//   "id": "47c64bd0-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb11ee41651f0017e9e44a"
//   },
//   "group": "kt-9",
//   "date": "2020-07-10",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Первое Android приложение",
//   "additional": "n",
//   "id": "531ea770-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb11ff41651f0017e9e44b"
//   },
//   "group": "kt-9",
//   "date": "2020-07-14",
//   "time": "19:00",
//   "teacher": "Иван Лавров",
//   "lecture": "Функции, лямбды и операторы ",
//   "additional": "n",
//   "id": "5d2a10b0-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb121341651f0017e9e44c"
//   },
//   "group": "kt-9",
//   "date": "2020-07-17",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Коллекции, Generics, интерфейсы",
//   "additional": "n",
//   "id": "69173240-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb122641651f0017e9e44d"
//   },
//   "group": "kt-9",
//   "date": "2020-07-21",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Coroutines",
//   "additional": "n",
//   "id": "74ba2b70-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb123941651f0017e9e44e"
//   },
//   "group": "kt-9",
//   "date": "2020-07-24",
//   "time": "08:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Создание Backend на Ktor - CRUD",
//   "additional": "n",
//   "id": "7fabd600-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb125041651f0017e9e44f"
//   },
//   "group": "kt-9",
//   "date": "2020-07-28",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Создание Backend на Ktor - авторизация",
//   "additional": "n",
//   "id": "8d4fcf50-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb126641651f0017e9e450"
//   },
//   "group": "kt-9",
//   "date": "2020-07-31",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Android: Activity, навигация, авторизация",
//   "additional": "n",
//   "id": "9ab5d540-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb128041651f0017e9e451"
//   },
//   "group": "kt-9",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Android: Загрузка данных по API, CRUD",
//   "additional": "n",
//   "id": "aa74bf50-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb129841651f0017e9e452"
//   },
//   "group": "kt-9",
//   "date": "2020-08-07",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Android: Работа с камерой, Notifications API",
//   "additional": "n",
//   "id": "b84742b0-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb12b041651f0017e9e453"
//   },
//   "group": "kt-9",
//   "date": "2020-08-11",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Push-уведомления: серверная и клиентская часть",
//   "additional": "n",
//   "id": "c6c56f60-babb-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb15ea41651f0017e9e455"
//   },
//   "group": "WM-57",
//   "date": "2020-07-06",
//   "time": "19:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Вводное занятие ",
//   "additional": "n",
//   "id": "b344b070-babd-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efb3ad741651f0017e9e457"
//   },
//   "group": "qa-7",
//   "date": "2020-07-03",
//   "time": "20:00",
//   "teacher": "Любовь Маясова",
//   "lecture": "Объектно-ориентированное программирование и проектирование",
//   "additional": "Ждем всех онлайн!",
//   "id": "b5d32180-bad3-11ea-952a-3b9dd6d63e69",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efc60bf7399090017fe30cb"
//   },
//   "group": "ajs-8",
//   "date": "2020-07-03",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Прототипы, конструкторы, классы и наследование",
//   "additional": "На занятии вы узнаете о:n- конструкторахn- использовании прототиповn- привязке контекстаn- иерархии наследованияn- классах и наследовании",
//   "id": "e418e200-bb82-11ea-8890-dbb79346b7f1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5efcced47399090017fe30cc"
//   },
//   "group": "bgo-1",
//   "date": "2020-07-07",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Разбор задач",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "813db330-bbc4-11ea-8890-dbb79346b7f1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff22f966bc310017513391"
//   },
//   "group": "WM-57",
//   "date": "2020-07-10",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для разметки текста и атрибуты",
//   "additional": "n",
//   "id": "d5c8c3e0-bd27-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff230d66bc310017513392"
//   },
//   "group": "WM-57",
//   "date": "2020-07-13",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Списки и таблицы",
//   "additional": "n",
//   "id": "e17707b0-bd27-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff232c66bc310017513393"
//   },
//   "group": "WM-57",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Селекторы и свойства",
//   "additional": "n",
//   "id": "f45d7080-bd27-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff234066bc310017513394"
//   },
//   "group": "WM-57",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": " Оформление текстовых блоков с использованием CSS",
//   "additional": "n",
//   "id": "002e3070-bd28-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff235566bc310017513395"
//   },
//   "group": "WM-57",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": " Основы клиент-серверного взаимодействия",
//   "additional": "n",
//   "id": "0c94eed0-bd28-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff3b7666bc310017513398"
//   },
//   "group": "iqa-7",
//   "date": "2020-07-07",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Объекты с внутренним состоянием, управление состоянием при тестировании",
//   "additional": "Ждем всех онлайн!n",
//   "id": "6e8205c0-bd36-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff689666bc310017513399"
//   },
//   "group": "iqa-7",
//   "date": "2020-07-09",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Композиция и зависимость объектов. Mockito при создании авто-тестов",
//   "additional": "Ждем всех онлайн!n",
//   "id": "53eca600-bd51-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff6d1e66bc31001751339e"
//   },
//   "group": "iqa-10",
//   "date": "2020-07-06",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Артефакты тестирования",
//   "additional": "Ждём всех онлайн!",
//   "id": "075847b0-bd54-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5eff6e8066bc31001751339f"
//   },
//   "group": "iqa-10",
//   "date": "2020-07-09",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Инструменты тестирования",
//   "additional": "Ждём всех онлайн!",
//   "id": "d9fdc190-bd54-11ea-8ef5-6f1425a78cc6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b7619125a80017e93102"
//   },
//   "group": "aphp-1",
//   "date": "2020-07-07",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Понятие класса и объекта",
//   "additional": "На лекции вы узнаете о:n- процедурном и объектно-ориентированном программированииn- синтаксисе классовn- создании объектаnПознакомитесь с понятием свойств и методов, изучите конструкторы и деструкторы, статические свойства, методы и константы.nА также узнаете обn- автозагрузке классовn- пространстве именn- правилах оформления кода",
//   "id": "77a2d3b0-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b77d9125a80017e93103"
//   },
//   "group": "aphp-1",
//   "date": "2020-07-09",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Наследование, полиморфизм и инкапсуляция",
//   "additional": "На лекции вы узнаете о:n- основах ООПn- инкапсуляцииn- модификаторах доступаn- наследовании и полиморфизмеn- абстракции и интерфейсах",
//   "id": "888b2290-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b79c9125a80017e93104"
//   },
//   "group": "html-52",
//   "date": "2020-07-06",
//   "time": "18:30",
//   "teacher": "Денис Ежков",
//   "lecture": "Введение в HTML и CSS",
//   "additional": "На занятии преподаватель расскажет:n- что такое вёрстка и HTML;n- какие бывают теги;n- что такое CSS и для чего он нужен;n- как написать CSS-правило.",
//   "id": "9acaeb20-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b7b99125a80017e93105"
//   },
//   "group": "html-52",
//   "date": "2020-07-09",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контентные теги",
//   "additional": "На занятии преподаватель расскажет:n- какие есть теги для разметки контента на странице (заголовков, параграфов текста, картинок и т.д.);n- какие есть свойства у этих тегов;n- что такое селектор по идентификатору и селектор по классу и чем они отличаются.",
//   "id": "ac5daad0-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b7cf9125a80017e93106"
//   },
//   "group": "mq-26",
//   "date": "2020-07-06",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Верстка резинового макета",
//   "additional": "Преподаватель расскажет вам, что из себя представляет резиновая верстка, затронет тему процентов как единиц измерения, а также особенности их применения в разных случаях. nВ заключение вы также узнаете о современной спецификации CSS Flexible Box Layout Module (получившей среди разработчиков название Flexbox).nЖдём вас сегодня на открытии курса!",
//   "id": "b944bcc0-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b7ec9125a80017e93107"
//   },
//   "group": "mq-26",
//   "date": "2020-07-08",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Резиновые изображения",
//   "additional": "На этом занятии преподаватель познакомит вас с полезной функцией calc() для расчёта размеров. Вы рассмотрите понятие резиновых изображений и узнаете, в чём заключаются отличия в использовании контентных и фоновых изображений. 😉nТакже будут затронуты особенности применения протоколов mailto и tel в HTML-элементах и вопросы взаимодействия с дизайнером по размерам изображений для резиновой верстки.",
//   "id": "ca5fb460-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b8089125a80017e93108"
//   },
//   "group": "ahj-7",
//   "date": "2020-07-07",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Анимация и CSS",
//   "additional": "На занятии вы узнаете:n- что такое анимация;n- разницу между css animation и css transform;n- про transition и animation events;n- а также про requestAnimationFrame.",
//   "id": "db73f540-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b81f9125a80017e93109"
//   },
//   "group": "ahj-7",
//   "date": "2020-07-09",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Geolocation, Notification, Media",
//   "additional": "На занятии вы узнаете:n- все про Geolocation и Notification API;n- а также про спецификацию Media Capture & Streams.",
//   "id": "e8eff430-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f01b83b9125a80017e9310a"
//   },
//   "group": "bhj-11",
//   "date": "2020-07-06",
//   "time": "18:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "Мы узнаем, что из себя представляет дипломный проект и кто поможет нам в работе над ним. Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса. nБудем рады видеть вас онлайн!nn",
//   "id": "f980d440-beb1-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0244bb9125a80017e9310b"
//   },
//   "group": "pb-14",
//   "date": "2020-07-07",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Функция без параметров. Область видимости",
//   "additional": "nНа лекции мы узнаем:nn  - что такое подпрограммы;n  - к каким переменным есть доступ у функции;n  - как переопределить переменную из другой области видимости.nnдополнительные материалы:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Functionsnlearnjsnhttps://learn.javascript.ru/function-basics",
//   "id": "b852b070-bf05-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0244f49125a80017e9310c"
//   },
//   "group": "pb-14",
//   "date": "2020-07-09",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Параметры и возвращаемое значение",
//   "additional": "nНа лекции мы узнаем:n  - как передать данные в функцию через аргументы;n  - как получить данные из функции;n  - сколько значений можно вернуть из функции.",
//   "id": "da3e0220-bf05-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0245409125a80017e9310d"
//   },
//   "group": "pb-15",
//   "date": "2020-07-10",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Базовые понятия. Переменные и числа",
//   "additional": "nДополнительные материалыnпочитать:nКак работает интернетnhttps://developer.mozilla.org/ru/docs/Learn/How_the_Internet_worksnВыражения и операторыnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Expressions_and_Operators#%D0%9E%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80%D1%8B_%D0%BF%D1%80%D0%B8%D1%81%D0%B2%D0%B0%D0%B8%D0%B2%D0%B0%D0%BD%D0%B8%D1%8FnВведение в javascriptnhttps://learn.javascript.ru/intronnпосмотреть:nЕще одна лекция о числах в javascriptnhttps://www.youtube.com/watch?v=aGTjRU7Dp20&list=PLo6puixMwuSNxJCgadaaavKqq4-ocKPrRnКак работает javascriptnhttps://www.youtube.com/watch?v=H6G63NKRSi8&feature=youtu.benhttps://www.youtube.com/watch?v=fXi49EkrMPI",
//   "id": "0795d3b0-bf06-11ea-b82c-4b70797bfde5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f031813736641001757bc9c"
//   },
//   "group": "devops-1",
//   "date": "2020-07-09",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Инструменты Git",
//   "additional": "nНа лекции вы научитесь:n-работать с полными и сокращенными хэшами ревизий;n-работать с диапазоном коммитов;n-“прятать” изменения локально и удалять все лишние файлы;n-поиску виновных в ошибках, поиск текста в коде и истории коммитов;n-отменять коммиты и исправлять историю. nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b0e77040-bf83-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f031842736641001757bc9d"
//   },
//   "group": "devops-1",
//   "date": "2020-07-13",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Работа в терминале (лекция 1)",
//   "additional": "nНа лекции вы:n-познакомитесь с терминалом и интерактивным режимом командной строки;n-узнаете о некоторых особенностях стандарта FHS;n-научитесь перемещаться по директориям, создавать, перемещать и удалять их;  делать аналогичные действия с файлами;n-научитесь просматривать файлы разными способами;n-научитесь искать документацию встроенными средствами ОС;n-научитесь изменять рабочее окружение для удобства;n-научитесь управлять выполняемыми задачами и планировать выполнение в будущем.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "cc7b6000-bf83-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f031872736641001757bc9e"
//   },
//   "group": "devops-1",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Работа в терминале (лекция 2)",
//   "additional": "nНа лекции вы узнаете о:n-процессах и некоторых их атрибутах;n-предоставляемых операционной системой абстракциях на примере стандартных потоков ввода-вывода;n-служебных файловых системах /dev и /proc;n-том, как посмотреть открытые процессом файлы с помощью lsof;n-развитии и типах терминалов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "e980e120-bf83-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0355f7736641001757bca2"
//   },
//   "group": "srk-2",
//   "date": "2020-07-13",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Документы ",
//   "additional": "nНа лекции вы:n-узнаете, что такое документы, изучите структуру документа;n-изучите реквизиты;n-изучите табличные части;n-узнаете, какие бывают формы;n-узнаете, для чего нужны команды и макеты.nnНаучитесь:n-создавать печатные формы документов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "94610a60-bfa8-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f035650736641001757bca3"
//   },
//   "group": "srk-2",
//   "date": "2020-07-17",
//   "time": "19:15",
//   "teacher": "Андрей Чередников",
//   "lecture": "Табличные части",
//   "additional": "nНа лекции вы узнаете:n-что такое табличная часть и командная панель документа;n-о взаимодействии с реквизитами в ТЧ.nnНаучитесь:n-создавать и изменять командную панель и табличную часть документа;n-обращаться к ТЧ с клиента и сервера.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c99afc90-bfa8-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0356dd736641001757bca4"
//   },
//   "group": "srk-2",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Проведение и движение",
//   "additional": "nНа занятии вы узнаете:n-что такое движения, режим записи документа;n-отличия оперaтивного и неоперативного проведений;n-отличие регистра накоплений и сведений;n-про активность в регистрах.nnНаучитесь:n-создавать движения документов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "1db6d100-bfa9-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f035747736641001757bca5"
//   },
//   "group": "srk-2",
//   "date": "2020-07-23",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Формы документов",
//   "additional": "nНа лекции вы узнаете виды форм документов:n-форма документа;n-форма списка;n-форма выбора.nnНаучитесь: n-создавать формы документа.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "5cdb5e00-bfa9-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f035794736641001757bca6"
//   },
//   "group": "srk-2",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nНа лекции вы узнаете про:n-виртуальные таблицы;n-структуру регистров;n-отличие регистров сведений и накоплений.nnНаучитесь:n-создавать отчеты СКД;n-формировать запросы к виртуальным таблицам.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "8aa4dd20-bfa9-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0357d1736641001757bca7"
//   },
//   "group": "srk-2",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Последовательность и журналы",
//   "additional": "nНа занятии вы узнаете о:n-последовательности;n-хронологии;n-примерах использования;n-журналах документов.nnНаучитесь:n-создавать журналы документов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "af0ec360-bfa9-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f035c76736641001757bca8"
//   },
//   "group": "srk-2",
//   "date": "2020-08-03",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Файлы",
//   "additional": "nНа вебинаре вы узнаете о (об):n-общих принципах работы с файлами;n-механизме временных файлов;n-принципе работы с интерактивным диалогом выбора файлов;n-передаче файлов с клиента на сервер и обратно.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "73e92200-bfac-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f035cb6736641001757bca9"
//   },
//   "group": "srk-2",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Текстовые документы",
//   "additional": "nНа занятии вы узнаете о:n-текстовых документах;n-редакторе текста и модуля.nnНаучитесь:n-работать с текстовыми документами.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "99f91720-bfac-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f035d3e736641001757bcaa"
//   },
//   "group": "srk-2",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Двоичные данные",
//   "additional": "nНа лекции вы узнаете о:n-двоичных данных;n-хранилище значения;n-потоках.nnНаучитесь:n-работать с двоичными данными.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "eaa31d60-bfac-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0381d8736641001757bcae"
//   },
//   "group": "ajs-8",
//   "date": "2020-07-07",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Object, Reflection и Proxy",
//   "additional": "На лекции:n- разберём методы Objectn- познакомимся с устройством свойств объектов в JS и дескрипторами свойствn- поговорим о тонкостях, которые спрашивают на собеседованияхn- разберём Proxy и Reflection API",
//   "id": "bbe1f5d0-bfc2-11ea-ac25-df21ca768404",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f06f82cd7118200177063fc"
//   },
//   "group": "ajs-8",
//   "date": "2020-07-10",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Регулярные выражения",
//   "additional": "На лекции разберем:n- регулярные выраженияn- методы объекта Regexp и StringnА также поговорим о том, когда метод Regexp использовать не стоит",
//   "id": "06b3fa60-c1d3-11ea-91e4-b16a043c6bc7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f07277ed7118200177063fd"
//   },
//   "group": "iqa-7",
//   "date": "2020-07-13",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Наследование и расширяемость систем. Проблемы наследования",
//   "additional": "Ждём всех онлайн!",
//   "id": "3b41e460-c1ef-11ea-91e4-b16a043c6bc7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0727f8d7118200177063ff"
//   },
//   "group": "iqa-7",
//   "date": "2020-07-16",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Исключительные ситуации и их обработка. Тестирование исключений",
//   "additional": "Ждём всех онлайн!",
//   "id": "842fa180-c1ef-11ea-91e4-b16a043c6bc7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f075019d711820017706402"
//   },
//   "group": "iqa-10",
//   "date": "2020-07-13",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Жизненный цикл разработки ПО. Гибкие методологии",
//   "additional": "Ждём всех онлайн!",
//   "id": "6f76d5c0-c207-11ea-91e4-b16a043c6bc7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0751d3d711820017706404"
//   },
//   "group": "iqa-7",
//   "date": "2020-07-20",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Интерфейсы для организации малой связности. Обобщённое программирование (Generics)",
//   "additional": "Ждём всех онлайн!",
//   "id": "76aabf90-c208-11ea-91e4-b16a043c6bc7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0753fad711820017706405"
//   },
//   "group": "iqa-7",
//   "date": "2020-07-23",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Collections Framework. CRUD и тестирование систем, управляющих набором объектов",
//   "additional": "Ждём всех онлайн!",
//   "id": "bf3c0f60-c209-11ea-91e4-b16a043c6bc7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f09e6fd44fd460017d46e88"
//   },
//   "group": "dj-11",
//   "date": "2020-07-15",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Знакомство с Django. Подготовка и запуск проекта",
//   "additional": "Ждем вас онлайн.",
//   "id": "8c821bc0-c392-11ea-a0d4-c7f0adfabb85",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f09ee6f44fd460017d46e93"
//   },
//   "group": "dj-11",
//   "date": "2020-07-12",
//   "time": "19:00",
//   "teacher": "Оксана Махонина",
//   "lecture": "Test",
//   "additional": "Ждем вас онлайн.",
//   "id": "fc25fc40-c396-11ea-a0d4-c7f0adfabb85",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0b1584e09dc8001732dd71"
//   },
//   "group": "aphp-1",
//   "date": "2020-07-14",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Примеси, перезагрузка и магия",
//   "additional": "На лекции вы познакомитесь с такими понятиями:n- трейтыn- магические свойства и методыn- сериализация объектовn- позднее статическое связываниеn- ковариантность и контравариантностьnУзнаете о реализации перезагрузки в php, наборах стандартных интерфейсов",
//   "id": "de26c8e0-c446-11ea-89d2-234ec09254dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0b1599e09dc8001732dd72"
//   },
//   "group": "html-52",
//   "date": "2020-07-13",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "На занятии вы узнаете как правильно искать информацию на просторах интернета и пользоваться ей.",
//   "id": "eafaa0f0-c446-11ea-89d2-234ec09254dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0b15c5e09dc8001732dd73"
//   },
//   "group": "html-52",
//   "date": "2020-07-15",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для вёрстки структуры контента",
//   "additional": "На занятии лектор расскажет:n- про группировку элементов на странице;n- как правильно задавать имена для классов;n- про теги, которые отвечают за структуру страницы;n- чем отличаются блочные и строчные элементы, и как их центрировать на странице.",
//   "id": "04e54d80-c447-11ea-89d2-234ec09254dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0b15eae09dc8001732dd74"
//   },
//   "group": "html-52",
//   "date": "2020-07-17",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование блочных элементов",
//   "additional": "На занятии Семён Бойко расскажет:n- про flex-контейнеры и их особенности;n- про элементы nav, header и footer;n- про схлопывание отступов.",
//   "id": "1b055d80-c447-11ea-89d2-234ec09254dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0b161fe09dc8001732dd75"
//   },
//   "group": "mq-26",
//   "date": "2020-07-14",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Медиа-функции",
//   "additional": "На лекции преподаватель подробно расскажет о медиа-функциях, позволяющих проверить различные характеристики устройства, на котором открыта страничка; затронет особенности взаимодействия пользователя с веб-страницей с помощью пальцев; особенности: hover на мобильных устройствах и особенности элементов интерфейса, с которыми удобно взаимодействовать мышкой, но неудобно пальцами с сенсорных устройств. nЖдём вас на лекции!",
//   "id": "3af8afc0-c447-11ea-89d2-234ec09254dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0b163fe09dc8001732dd76"
//   },
//   "group": "mq-26",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Особенности верстки графики для мобильных устройств",
//   "additional": "Преподаватель поведает о нюансах разработки для гаджетов от Apple на базе операционной системы iOS, а также для устройств, имеющих экраны с повышенной плотностью пикселей. Кроме того, будет затронута тема иконочных шрифтов и SVG (векторной) графики. nА в заключение вас ждут ещё несколько удобных свойств Flexbox:n➡️ justify-content (определяет, как браузер распределяет пространство вокруг флекс-элементов вдоль главной оси контейнера);n➡️ align-items (выравнивает флекс-элементы внутри контейнера в перпендикулярном направлении);n➡️ align-self (выравнивает флекс-элементы текущей строки, переписывая значение align-items).nЖдём вас на занятии!",
//   "id": "4d86bf60-c447-11ea-89d2-234ec09254dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0b165ee09dc8001732dd77"
//   },
//   "group": "ahj-7",
//   "date": "2020-07-14",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "RxJS",
//   "additional": "На занятии вы узнаете:n- что такое синхронная функция, callback, Promise;n- что делать когда данных много?tttttn- про паттерн Observer;ttttn- как может помочь RxJS.",
//   "id": "5ffed600-c447-11ea-89d2-234ec09254dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0b1678e09dc8001732dd78"
//   },
//   "group": "ahj-7",
//   "date": "2020-07-17",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "WebWorkers, ServiceWorkers",
//   "additional": "На занятии вы узнаете:n- про API Web Workers и как он позволяет исполнять скрипты в фоновом режиме, независимо от скриптов, работающих с пользовательским интерфейсом;n- про ограничения связанные с Web Workers;n- посмотрите на примеры работы Worker’ов;n- а также узнаете как использовать Service Worker на практике.",
//   "id": "6fa025f0-c447-11ea-89d2-234ec09254dc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0d416c5c76a60017d1e74d"
//   },
//   "group": "ajs-8",
//   "date": "2020-07-14",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контейнеры",
//   "additional": "На лекции разберем:n- Setn- Mapn- WeakSet, WeakMap",
//   "id": "37285a70-c592-11ea-93f8-835c85b9b9be",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0d472e5c76a60017d1e74e"
//   },
//   "group": "pb-15",
//   "date": "2020-07-14",
//   "time": "19:00",
//   "teacher": " Константин Полянский",
//   "lecture": "Логический тип и ветвление",
//   "additional": "nНа лекции мы узнаем:n  - как делать программы нелинейными — выполнять различный блок кода в зависимости от состояния программыn  - как удобно хранить информацию о признаках вида «да/нет»n  - что такое логические операции.nnnДополнительные материалы.nпочитать:nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Логические_операторыnhttps://learn.javascript.ru/logical-opsnhttps://learn.javascript.ru/comparisonnпосмотреть:nхороший обзор nhttps://www.youtube.com/watch?v=B4ZCFdrBmbEnеще один обзор с конкретными примерами, но уже на английскомnhttps://www.youtube.com/watch?v=2cGleL5FMZMnпараллельно даются несколько полезных советов для работы в консоле веб-разработчикаnhttps://www.youtube.com/watch?v=Gy87ZS5sb1wn",
//   "id": "a5b78c10-c595-11ea-93f8-835c85b9b9be",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0d47965c76a60017d1e74f"
//   },
//   "group": "pb-15",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Строки. Алгоритмы. Как отлаживать код",
//   "additional": "nНа лекции мы узнаем:n  - как работают строки в JS;n  - что такое алгоритмы и как их сравнивать;n  - какие существуют приемы отладки кода;n  - как читать ошибки интерпретатора.nnДополнительные материалыnпочитать:nклассическая документация от MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Stringnразбор от Ильи Кантораnhttps://learn.javascript.ru/stringnnпосмотреть:n20 методов, которые помогут вам жонглировать строками в JS, как настоящий PROnhttps://www.youtube.com/watch?v=VRz0nbax0uInхороший обзор (на английском)nhttps://www.youtube.com/watch?v=DljZQyNwdOgnпро типы ошибок в JS и то как с ними боротьсяnhttps://stepik.org/lesson/99598/step/1?unit=75361nувлекательнейшая лекция по алгоритмам (в рамках легендарного курса CS50 от Harvard University)nhttps://www.youtube.com/watch?v=U9o49qwa6hknкурс от Computer Science Center на stepiknhttps://stepik.org/course/217/nеще немного про алгоритмы (How Binary Search Works)nhttps://www.youtube.com/watch?v=JQhciTuD3E8",
//   "id": "e377a710-c595-11ea-93f8-835c85b9b9be",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0eb51500d8b90017e4541d"
//   },
//   "group": "bgo-1",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "HTTP: разработка сервера",
//   "additional": "nНа лекции вы:n-поговорите о том, как можно создавать Web APIn-сделаете первые шаги по получению работающего сервера, который развернёте в публичном облаке Heroku.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "bd9612e0-c66f-11ea-bd40-194c0e6c0b20",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0eb6b700d8b90017e45422"
//   },
//   "group": "bgo-1",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Дмитрий Титов",
//   "lecture": "Реляционные базы данных — SQL",
//   "additional": "nНа лекции вы изучите необходимый минимум, который позволит вам с помощью Docker:n-создать БД для разработки и тестирования;n-создать в БД таблицы (при необходимости модифицировать или удалить их);n-вставить в таблицы первые записи, познакомиться с механизмами удаления и обновления.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b6b82660-c670-11ea-bd40-194c0e6c0b20",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0eb6ee00d8b90017e45423"
//   },
//   "group": "bgo-1",
//   "date": "2020-08-03",
//   "time": "19:00",
//   "teacher": "Дмитрий Титов",
//   "lecture": "Реляционные базы данных  — использование из Go",
//   "additional": "nНа лекции вы:n-поговорите о возможностях работы с PostgreSQL из Go с помощью драйвера pgx;n-рассмотрите возможности базовые возможности запроса SELECT.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "d7a34620-c670-11ea-bd40-194c0e6c0b20",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0eb71600d8b90017e45424"
//   },
//   "group": "bgo-1",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Дмитрий Титов",
//   "lecture": "REST",
//   "additional": "nНа лекции вы:n-изучите основные принципы REST, поскольку вы либо сами будете писать различные системы, либо интегрироваться с ними.n-ознакомитесь со всем рядовым инструментарием создания веб-приложений: от обработки запросов, загрузки файлов, до тестирования, REST и работы с СУБД.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "efb11c60-c670-11ea-bd40-194c0e6c0b20",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0ef72d00d8b90017e4542b"
//   },
//   "group": "devops-2",
//   "date": "2020-07-16",
//   "time": "18:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Введение в DevOps",
//   "additional": "nНа вебинаре вы:n-обсудите принципы учебы на курсе;n-разберётесь, что включает в себя DevOps;n-поговорите об  инструментах;n-разберётесь в основных подходах к разработке.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "22c1a9a0-c697-11ea-bd40-194c0e6c0b20",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0ff032d19cd90017ac181e"
//   },
//   "group": "ajs-8",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "ArrayBuffer",
//   "additional": "На лекции вы узнаете о:n- типизированных массивахn- ArrayBuffern- DataViewn- «многопоточности» в JSn- SharedArrayBuffer",
//   "id": "8febae10-c72b-11ea-aaff-99aabf043094",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f0ff07ad19cd90017ac1820"
//   },
//   "group": "aphp-1",
//   "date": "2020-07-16",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Работа с базами данных",
//   "additional": "На лекции вы узнаете о:n- базах данных и их видахn- системах управления базами данныхn- SQL запросахn- PDO как универсальном способе работы с базами данныхnТакже будет проведен краткий обзор mysqli",
//   "id": "bb0ec550-c72b-11ea-aaff-99aabf043094",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f100a79d19cd90017ac1824"
//   },
//   "group": "dj-11",
//   "date": "2020-07-20",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Обработка запросов",
//   "additional": "Ждем вас онлайн.",
//   "id": "39a3b790-c73b-11ea-aaff-99aabf043094",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f10499cd19cd90017ac1827"
//   },
//   "group": "git-15",
//   "date": "2020-07-24",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "db6cf440-c760-11ea-aaff-99aabf043094",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f107ce2b1cb440017767cfa"
//   },
//   "group": "py-33",
//   "date": "2020-07-17",
//   "time": "19:30",
//   "teacher": "Евгений Шмаргунов",
//   "lecture": "Python. Знакомство с консолью",
//   "additional": "Ждем вас онлайн.",
//   "id": "6b66ba90-c77f-11ea-ba00-c3f3aa599cca",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1162dcd05ba80017514fe2"
//   },
//   "group": "ahj-7",
//   "date": "2020-07-17",
//   "time": "20:00",
//   "teacher": "Владимир Языков",
//   "lecture": "WebWorkers, ServiceWorkers",
//   "additional": "На занятии вы узнаете:n- про API Web Workers и как он позволяет исполнять скрипты в фоновом режиме, независимо от скриптов, работающих с пользовательским интерфейсом;n- про ограничения связанные с Web Workers;n- посмотрите на примеры работы Worker’ов;n- а также узнаете как использовать Service Worker на практике.",
//   "id": "7ec932f0-c808-11ea-a0ac-695ce374b952",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f11c65cd05ba80017514fe4"
//   },
//   "group": "bgo-1",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Дмитрий Титов",
//   "lecture": "Разбор задач и ответы на вопросы",
//   "additional": "nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "cda86270-c843-11ea-a0ac-695ce374b952",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14853b54e6b5001748e49b"
//   },
//   "group": "iqa-10",
//   "date": "2020-07-20",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Разбор задач",
//   "additional": "Ждём всех онлайн!",
//   "id": "bedf2ea0-c9e6-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1485a754e6b5001748e49c"
//   },
//   "group": "py-33",
//   "date": "2020-07-20",
//   "time": "18:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Условные конструкции. Операции сравнения",
//   "additional": "Ждем вас онлайн.",
//   "id": "ffaadbf0-c9e6-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14862554e6b5001748e49d"
//   },
//   "group": "py-33",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Введение в типы данных и циклы",
//   "additional": "Ждем вас онлайн.",
//   "id": "4a894580-c9e7-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14874954e6b5001748e49e"
//   },
//   "group": "dj-11",
//   "date": "2020-07-24",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Динамическое формирование страниц на основе шаблонов",
//   "additional": "Ждем вас онлайн.",
//   "id": "f89abbe0-c9e7-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f148b1c54e6b5001748e49f"
//   },
//   "group": "adpy-13",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Инструменты для визуализации и изучения данных",
//   "additional": "Ждем вас онлайн.",
//   "id": "40157620-c9ea-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f148b7854e6b5001748e4a0"
//   },
//   "group": "adpy-13",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Подготовка к собеседованию. Ответы на вопросы",
//   "additional": "Ждем вас онлайн.",
//   "id": "76ca4880-c9ea-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14901254e6b5001748e4a1"
//   },
//   "group": "ios-6",
//   "date": "2020-07-21",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Основы ООП",
//   "additional": "Ждем вас онлайн.",
//   "id": "3552ea80-c9ed-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14908f54e6b5001748e4a2"
//   },
//   "group": "ios-6",
//   "date": "2020-07-23",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Объекты в ООП",
//   "additional": "Ждем вас онлайн.",
//   "id": "7fce4c80-c9ed-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1490de54e6b5001748e4a3"
//   },
//   "group": "ios-4",
//   "date": "2020-07-20",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Разбор практических заданий",
//   "additional": "Ждем вас онлайн.",
//   "id": "ae8fc030-c9ed-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14910954e6b5001748e4a4"
//   },
//   "group": "ios-3",
//   "date": "2020-07-20",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 1",
//   "additional": "Ждем вас онлайн.",
//   "id": "c86a1910-c9ed-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14958d54e6b5001748e4a5"
//   },
//   "group": "ajs-9",
//   "date": "2020-07-24",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Стандарты и рабочее окружение",
//   "additional": "На занятии вы узнаете о:n- редакциях и их стандартахn- рабочем окруженииnУзнаете, что собой представляют npm, live-server, Babel и ESLint.",
//   "id": "79548e20-c9f0-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1495cf54e6b5001748e4a6"
//   },
//   "group": "bhj-12",
//   "date": "2020-07-20",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Возможности JavaScript в браузере",
//   "additional": "На этом занятии вы познакомитесь с:n1. Принципом построения DOM в браузереn2. С объектами HTML-теговn3. BOM. Объект WindownЖдём вас на вебинаре!",
//   "id": "a1056200-c9f0-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1495ef54e6b5001748e4a7"
//   },
//   "group": "bhj-12",
//   "date": "2020-07-24",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Способы поиска нужного HTML-элемента",
//   "additional": "Мы узнаем о $0 в консоли, познакомимся с HTMLCollection и различными доступами к элементам. Ждем вас на вебинаре!",
//   "id": "b3d0a1b0-c9f0-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14961554e6b5001748e4a8"
//   },
//   "group": "bphp-8",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Знакомство с PHP и PHPStorm",
//   "additional": "На лекции вы узнаете, что такое PHP, познакомитесь с:n- настройкой рабочей средыn- основами синтаксисаn- документациейn- типами данныхn- константами и ветвлениями",
//   "id": "ca606370-c9f0-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1498af54e6b5001748e4aa"
//   },
//   "group": "bphp-8",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Консольные приложения в php",
//   "additional": "На лекции вы узнаете:n- как работать с консольным PHPn- запускать консольные скриптыnПознакомитесь с:n- интерактивной консольюn- массивами и цикламиnА также узнаете еще много интересного :)",
//   "id": "57be4f60-c9f2-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1498d054e6b5001748e4ab"
//   },
//   "group": "html-52",
//   "date": "2020-07-21",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Вёрстка форм",
//   "additional": "Вы узнаете:n- для чего используются формы и какие поля у них есть;n- как задать минимальную и максимальную высоту/ширину элемента;n- как сделать эффекты при наведении на элемент.",
//   "id": "6b4d2d30-c9f2-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1498ed54e6b5001748e4ac"
//   },
//   "group": "html-52",
//   "date": "2020-07-23",
//   "time": "18:00",
//   "teacher": "Александр Фитискин",
//   "lecture": "Нестандартные элементы форм",
//   "additional": "На занятии лектор расскажет:n- что такое строчно-блочные элементы и какие у них есть особенности;n- как можно стилизовать фон элементов;n- что такое соседний и родственный селектор и для чего они используются;n- про абсолютное позиционирование элементов;n- про псевдоэлементы ::before и ::after.",
//   "id": "7c99e330-c9f2-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14990f54e6b5001748e4ad"
//   },
//   "group": "mq-26",
//   "date": "2020-07-20",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Верстка адаптивного макета",
//   "additional": "Преподаватель разъяснит плюсы и минусы адаптивной верстки, расскажет об использовании логических операторов в медиа-запросах и поговорит о способах адаптации фоновых изображений.nА в заключение будут разобраны следующие темы:n▪️ как перестраиваются элементы для мобильного телефона;n▪️ подготовка фоновых изображений для разных устройств;n▪️ какие элементы скрываются;n▪️ содержат ли скрывающиеся блоки изображения.nЖдём вас на занятии!",
//   "id": "90bd38d0-c9f2-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14992d54e6b5001748e4ae"
//   },
//   "group": "mq-26",
//   "date": "2020-07-22",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивная типографика",
//   "additional": "На занятии преподаватель расскажет вам о таких полезных медиа-функциях как orientation (ориентация области просмотра) и aspect-ratio (соотношение ширины к высоте области просмотра), а также об относительной единице измерения rem.nКроме того, будут разобраны следующие особенности HTML-элементов:n▪️ type email;n▪️ type tel;n▪️ type search;nИ в завершение лекции будет рассмотрен пример улучшения формы с использованием type="email" / type="search" / type="tel" и деградацией до type="text" в старых браузерах. nНе пропустите, занятие будет интересным! ",
//   "id": "a27f6cf0-c9f2-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f14994f54e6b5001748e4af"
//   },
//   "group": "mq-26",
//   "date": "2020-07-24",
//   "time": "20:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Breakpoints",
//   "additional": "На лекции преподаватель расскажет о так называемых контрольных точках в CSS - Breakpoints и критериях их выбора, разберет подход к версте «mobile first» и поговорит о единицах измерениях vh, vw, vmin, vmax, а также как с такими единицами измерения работает функция calc().nКроме того, вы узнаете об атрибуте srcset у тега img и увидите пример загрузки изображений через атрибут srcset и фоллбека в виде src. А напоследок мы немного побеседуем на тему подготовки графики для различных устройств.nЖдём вас на занятии!",
//   "id": "b6bf9960-c9f2-11ea-90ee-2dd268e61370",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1534c1f845cb0017de0275"
//   },
//   "group": "devops-1",
//   "date": "2020-07-20",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Операционные системы",
//   "additional": "nНа занятии вы:n-ознакомитесь с краткой историей развития Unix и POSIX систем;n-рассмотрите основные функции ОС в целом и затронули каждую из них на примере Linux;n-познакомитесь с инструментами отладки: strace для системных вызовов, sotruss для библиотечных, eBPF на примере набора утилит BCC;n-узнаете, как создаются и завершаются процессы;n-узнаете о состояниях процессов;n-узнаете, как можно отправить процессам сигналы;n-рассмотрите некоторые утилиты для оценки ресурсов системы;n-познакомитесь с systemd;n-затроните неймспейсы ядра на примере ns PID.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "5de86580-ca4f-11ea-96d3-77fa4850d469",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f15cdb5f845cb0017de0280"
//   },
//   "group": "ajs-8",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Promises, async/await, timers and event loop",
//   "additional": "На лекции вы узнаете о:n- длительных операцияхn- Event Loopn- Web Workersn- CallBack Helln- Promisesn- async/awaitn- тестировании асинхронного кода",
//   "id": "889be2b0-caaa-11ea-96d3-77fa4850d469",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f15cdcff845cb0017de0281"
//   },
//   "group": "ajs-8",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Символы, итераторы, генераторы",
//   "additional": "На занятии вы узнаете:n- что такое символы и как их использоватьn- для чего нужны итераторыn- как реализовать свой итераторnА также познакомитесь с подпрограммами, тонкими материями генераторов.",
//   "id": "982a6df0-caaa-11ea-96d3-77fa4850d469",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f15f9c6f845cb0017de0282"
//   },
//   "group": "pb-15",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Массивы и базовые методы работы с ними",
//   "additional": "nНа лекции мы узнаем:n  - что такое массивы.n  - для чего используются массивыn  - какие методы мы можем применять для работы с массивамиnnДополнительные материалы.nпочитать:nпо традиции - документация на MDN.nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array nопять же, по традиции learn.javascriptnhttps://learn.javascript.ru/array nnпосмотреть:nотличный обзор того, что мы сегодня обсудили (и даже больше) от Sorax.nhttps://www.youtube.com/watch?v=3OjuRfR8RNg nхороший обзор на английском.nhttps://www.youtube.com/watch?v=orAS-MBh5f4 ",
//   "id": "ccedaab0-cac4-11ea-96d3-77fa4850d469",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f15fa09f845cb0017de0283"
//   },
//   "group": "pb-15",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Алёна Батицкая",
//   "lecture": "Циклы",
//   "additional": " nНа лекции мы узнаем:nn  - что такое циклы и для чего они нужны;n  - как правильно писать циклы;n  - как работать с циклами и массивами.nnДополнительные материалы:nЗдесь можно поизучать циклы самостоятельноnСodewars, programming challengesnhttps://www.codewars.com/nЦиклы while, for, learn.javascript.runhttps://learn.javascript.ru/while-fornМассивы: методы, learn.javascript.runhttps://learn.javascript.ru/array-methodsnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Циклы_и_итерацииnlearn javascriptnhttps://learn.javascript.ru/while-fornnпосмотреть:nобзор циклов от Soraxnhttps://www.youtube.com/watch?v=ITr-SzUIDpQnхороший обзор на английскомnhttps://www.youtube.com/watch?v=orAS-MBh5f4",
//   "id": "f45f52b0-cac4-11ea-96d3-77fa4850d469",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f160abef845cb0017de0284"
//   },
//   "group": "iqa-11",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Введение в тестирование ПО. Методы и виды тестирования",
//   "additional": "Ждём всех онлайн!",
//   "id": "e9d64970-cace-11ea-96d3-77fa4850d469",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f160b5df845cb0017de0285"
//   },
//   "group": "java QA-8",
//   "date": "2020-07-21",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Циклы, параметризованные тесты     и аннотации",
//   "additional": "Ждём всех онлайн!",
//   "id": "48fa0f90-cacf-11ea-96d3-77fa4850d469",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f169a3200607a0017f03858"
//   },
//   "group": "ibb-1",
//   "date": "2020-07-21",
//   "time": "19:00",
//   "teacher": "Александр Сухарев",
//   "lecture": "Классификация и категоризация информации, информационных систем",
//   "additional": "Ждём всех онлайн!",
//   "id": "6b5c1740-cb24-11ea-bada-d766c2669c48",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17de4a79da1c00170d489a"
//   },
//   "group": "onec-4",
//   "date": "2020-07-22",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Модули",
//   "additional": "nНа вебинаре вы узнаете:n-какими бывают общие модули;n-что такое директивы компиляции и инструкции препроцессора;n-для чего служат модули форм, модули объектов и модули менеджеров;n-каковы основные события модулей объектов и модулей менеджеров.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "97f90490-cbe5-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17de9c79da1c00170d489b"
//   },
//   "group": "onec-4",
//   "date": "2020-07-24",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Переменные",
//   "additional": "nНа вебинаре вы узнаете:n-что такое переменная и параметр сеанса;n-каковы формальные требования к именам переменных;n-как лучше называть их.nnНаучитесь:n-объявлять и инициализировать переменные;n-создавать и устанавливать параметры сеанса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "c8e87bd0-cbe5-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17decd79da1c00170d489c"
//   },
//   "group": "onec-4",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Типы данных",
//   "additional": "nНа занятии вы узнаете:n-что такое примитивные и ссылочные типы;n-какими бывают примитивные типы;n-что такое уникальный идентификатор и чем ссылка отличается от объекта.nnК тому же вы научитесь:n-выполнять операции с примитивными типами;n-получать объект по ссылке.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "e5ce8e10-cbe5-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17df0479da1c00170d489d"
//   },
//   "group": "onec-4",
//   "date": "2020-07-31",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Даты и строки",
//   "additional": "nНа лекции вы узнаете:n-как задаются параметры дат и строк для хранения в ИБ;n-какие операции определены для дат и строк.nnА еще научитесь:n-выполнять простые операции с датами и строками.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "06e59fd0-cbe6-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17df2f79da1c00170d489e"
//   },
//   "group": "onec-4",
//   "date": "2020-08-03",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Условия",
//   "additional": "nНа занятии вы узнаете:n-что такое оператор условного выполнения и тернарный оператор;n-чем хороша декларативность в коде.nnНаучитесь:n-писать простые и вложенные операторы условного выполнения;n-переписывать их на тернарные операторы;n-проверять заполненность значений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. nn",
//   "id": "20960280-cbe6-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17df5b79da1c00170d489f"
//   },
//   "group": "onec-4",
//   "date": "2020-08-05",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Циклы",
//   "additional": "nНа занятии вы узнаете:n-что такое цикл;n-какими способами можно организовать цикл;n-как прервать и продолжить выполнение цикла;n-что такое синтаксический сахар.nnА ещё вы научитесь:n-организовывать простейшие циклы.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "3abbe350-cbe6-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17df8e79da1c00170d48a0"
//   },
//   "group": "onec-4",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Универсальные коллекции",
//   "additional": "nНа занятии вы узнаете:n-что такое универсальная коллекция;n-какие коллекции поддерживает встроенный язык.nnНаучитесь:n-создавать массивы, списки значений, структуры, соответствия, таблицы и деревья значений;n-наполнять их, сортировать, выполнять обход и поиск.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "5948a0b0-cbe6-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17dfca79da1c00170d48a1"
//   },
//   "group": "onec-4",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Матвей Серегин",
//   "lecture": "Объекты платформы",
//   "additional": "nНа вебинаре вы узнаете:n-как создаются объекты платформы;n-что такое конструктор и метод;n-для чего нужны объекты ТабличныйДокумент и ТекстовыйДокумент.nnТакже научитесь:n-создавать цвета, шрифты и собирать из них форматированные строки;n-использовать генератор случайных чисел;n-программно создавать, находить и изменять пользователей ИБ.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "7c92e620-cbe6-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f17dff079da1c00170d48a2"
//   },
//   "group": "onec-4",
//   "date": "2020-08-19",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Процедуры и функции",
//   "additional": "nНа лекции вы узнаете:n-что такое процедуры и функции как подпрограммы, побочный эффект, рекурсия;n-какие бывают имена и параметры;n-для чего нужны - возврат значений, передача по значению, повторное использование, комментарии.nnНаучитесь:n-создавать процедуры и функции;n-определять параметры и использовать возврат значений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "934aa240-cbe6-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f189dc479da1c00170d48a6"
//   },
//   "group": "iqa-11",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "Ждём всех онлайн!",
//   "id": "b9225f00-cc57-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f189e0779da1c00170d48a7"
//   },
//   "group": "javaqa-6",
//   "date": "2020-07-23",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Репортинг: Report Portal",
//   "additional": "Ждём всех онлайн!",
//   "id": "e11e6cb0-cc57-11ea-96a5-e158b4cde1d8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f192f449b68b00017af6b97"
//   },
//   "group": "devops-1",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Файловые системы",
//   "additional": "nНа занятии вы:n-узнаете о структурах файловой системы и типах устройств;n-поговорите об организации хранения данных в Linux; n-рассмотрите наиболее распространенные уровни RAID;n-посмотрите на практике реализацию mdadm;n-поработаете с менеджером логических томов LVM2.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "725c7860-ccae-11ea-8ec9-f7a5c2284cb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f192f789b68b00017af6b98"
//   },
//   "group": "devops-1",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Компьютерные сети (лекция 1)",
//   "additional": "nНа лекции вы узнаете о:n-классификации сетей по типу используемой среды и типу коммутации;n-истории развития, который привели к появлению двухранговых сетей и двух типов не связанных адресов;n-стеке протоколов TCP/IP и конкретных его представителях;n-важных терминах, применяемых при обсуждении сетей;n-разницы протоколов транспортного уровня TCP и UDP;n-фазах жизни соединения TCP;n-том, как можно посмотреть на сетевое взаимодействие средствами операционной системы как на уровне системных вызовов, так и собирая фреймы на интерфейсе с помощью tcpdump.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "91364450-ccae-11ea-8ec9-f7a5c2284cb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f192f9e9b68b00017af6b99"
//   },
//   "group": "devops-1",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Компьютерные сети (лекция 2)",
//   "additional": "nНа лекции вы:n-разберётесь в том, как работает маска сети IP, в разных вариантах записи адресов;n-познакомитесь с калькулятором ipcalc;n-узнаете о некоторых важных оптимизациях TCP;n-разберётесь в основах DNS и HTTP;n-посмотрите на практике, как работают виртуальные сетевые интерфейсы в контейнерах;n-разберёте балансировку L4 и L7, познакомитесь с L4 балансером ipvs;n-увидите в работе keepalived в базовой конфигурации.nnnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "a8563820-ccae-11ea-8ec9-f7a5c2284cb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1931589b68b00017af6b9a"
//   },
//   "group": "onec-3",
//   "date": "2020-07-23",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Разбор задач 1 блока",
//   "additional": "nНа занятии автор профессии разберет домашние задания, которые вызвали у вас наибольшие трудности, и ответит на вопросы по предыдущим лекциям.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "afbc7c90-ccaf-11ea-8ec9-f7a5c2284cb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f19b3559b68b00017af6b9c"
//   },
//   "group": "py-33",
//   "date": "2020-07-24",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "Ждем вас онлайн.",
//   "id": "29ea8910-ccfd-11ea-8ec9-f7a5c2284cb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f19d16d9b68b00017af6b9d"
//   },
//   "group": "ibb-1",
//   "date": "2020-07-24",
//   "time": "19:00",
//   "teacher": "Евгений Строев",
//   "lecture": "Организация защиты информации (часть 1)",
//   "additional": "Ждём всех онлайн!",
//   "id": "1a4f2760-cd0f-11ea-8ec9-f7a5c2284cb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f19d4209b68b00017af6b9e"
//   },
//   "group": "java QA-8",
//   "date": "2020-07-24",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Выстраивание процесса непрерывной интеграции (CI)",
//   "additional": "Ждём всех онлайн!",
//   "id": "b5c88690-cd10-11ea-8ec9-f7a5c2284cb2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1a7ae6beb2660017ecc30c"
//   },
//   "group": "ahj-7",
//   "date": "2020-07-24",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "1d5b6210-cd74-11ea-824e-412a46d34cac",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1b0387beb2660017ecc315"
//   },
//   "group": "onec-1",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Разбор задач 2 блока",
//   "additional": "nНа занятии автор профессии разберет домашние задания, которые вызвали у вас наибольшие трудности, и ответит на вопросы по предыдущим лекциям.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "8d606e60-cdc5-11ea-824e-412a46d34cac",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1c2e8710e76a00175839a0"
//   },
//   "group": "SD_13",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Ирина Хомутова",
//   "lecture": "Новое знакомство с компьютером",
//   "additional": "n",
//   "id": "c56e4630-ce77-11ea-b5be-5f6eb087a235",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1c2e9d10e76a00175839a1"
//   },
//   "group": "SD_13",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Общаемся с компьютером",
//   "additional": "n",
//   "id": "d2664810-ce77-11ea-b5be-5f6eb087a235",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1c2eb610e76a00175839a2"
//   },
//   "group": "SD_13",
//   "date": "2020-08-03",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Три кита веба: HTML, CSS, JS",
//   "additional": "n",
//   "id": "e157a8f0-ce77-11ea-b5be-5f6eb087a235",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1c2ed510e76a00175839a3"
//   },
//   "group": "SD_13",
//   "date": "2020-08-05",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Интернет — большая библиотека",
//   "additional": "n",
//   "id": "f3e36ea0-ce77-11ea-b5be-5f6eb087a235",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1c2eec10e76a00175839a4"
//   },
//   "group": "SD_13",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Вся правда о профессии разработчика",
//   "additional": "n",
//   "id": "01a6d6d0-ce78-11ea-b5be-5f6eb087a235",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d4780a9169a0017b5fab6"
//   },
//   "group": "ajs-9",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Модули",
//   "additional": "На занятии вы узнаете:n- зачем нужны ES-модули;n- что такое модулиnПознакомитесь с CommonJS, Webpack и его функциональным файлом.",
//   "id": "3e486890-cf1f-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d47a0a9169a0017b5fab7"
//   },
//   "group": "ajs-9",
//   "date": "2020-07-31",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Платформы: браузер vs Node.js",
//   "additional": "На занятии вы узнаете о:n- платформахn- глобальном объектеnПознакомитесь с Node.js, нюансами работы браузера и многим другим.",
//   "id": "517f3b50-cf1f-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d47bda9169a0017b5fab8"
//   },
//   "group": "ajs-8",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "TypeScript",
//   "additional": "На занятии вы познакомитесь с:n- TypeScriptn- рабочим окружениемn- типизациейn- интерфейсамиn- классами.",
//   "id": "62887fb0-cf1f-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d4861a9169a0017b5fab9"
//   },
//   "group": "aphp-1",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Тестирование, php-unit",
//   "additional": "На лекции вы узнаете:n- что такое тестированиеn- что первее: тесты или кодnПознакомитесь с автоматизированным тестированием, PHPUnit, Mock- и Stub-объектами.nИзучите покрытие кода тестами, шаблоны проектирования и тестирования",
//   "id": "c44a2230-cf1f-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d487fa9169a0017b5faba"
//   },
//   "group": "bhj-12",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Объект события",
//   "additional": "Преподаватель расскажет, какие проблемы может вызывать использование свойства onclick, и как по-другому можно назначить и удалить обработчики событий элемента. Подробно рассмотрим объект события, содержащий подробную информацию об обрабатываемом событии, свойства событий и обработку событий клавиатуры.nДо встречи на вебинаре!",
//   "id": "d668f540-cf1f-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d48ada9169a0017b5fabb"
//   },
//   "group": "bhj-12",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "DOM",
//   "additional": "Мы познакомимся и научимся работать с событиями  загрузки DOM, навигацией, различными атрибутами. Приходите, будет интересно!",
//   "id": "f17cb880-cf1f-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d48cba9169a0017b5fabc"
//   },
//   "group": "bjs-13",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Базовый синтаксис",
//   "additional": "На лекции вы узнаете:n1. Переменные и константы, допустимые имена, правила именованияn2. Выражения, операторы и операндыn3. DevTools и console.logn4. Числаn5. Строки",
//   "id": "03720a90-cf20-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d492ba9169a0017b5fabd"
//   },
//   "group": "bjs-13",
//   "date": "2020-07-29",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Расширенный синтаксис JavaScript",
//   "additional": "На лекции вы узнаете:n1. Современный стандарт, ""use strict""n2. Операторы разделителиn3. Типы данных null и undefinedn4. Управляющие конструкцииn5. Массивы, циклы",
//   "id": "3d1682d0-cf20-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d4955a9169a0017b5fabe"
//   },
//   "group": "bjs-13",
//   "date": "2020-07-31",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Типы данных",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Типы данныхn2. Примитивы и объекты. Данные по значению и по ссылкеn3. Обертки для примитивовn4. Методы типов данныхn5. Проверка и преобразование типов",
//   "id": "55bbde20-cf20-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d499aa9169a0017b5fabf"
//   },
//   "group": "bphp-8",
//   "date": "2020-07-28",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Базовые операторы и функции",
//   "additional": "На лекции вы узнаете о:n- стандартных функцияхn- операторахn- регулярных выражениях",
//   "id": "7eef0c40-cf20-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d49b6a9169a0017b5fac0"
//   },
//   "group": "bphp-8",
//   "date": "2020-07-30",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Пользовательские функции",
//   "additional": "На лекции вы узнаете о:n- дублировании кодаn- синтаксисе функцийn- строгой типизацииn- рекурсииn- функции обратного вызова",
//   "id": "8fec69c0-cf20-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d4a1ea9169a0017b5fac1"
//   },
//   "group": "html-52",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Всплывающие элементы",
//   "additional": "На занятии он:n- расскажет, чем отличаются контентные и декоративные изображения;n- объяснит, как позиционировать элементы на странице;n- научит работать с Adobe Photoshop.",
//   "id": "cdf96c40-cf20-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d4a3ca9169a0017b5fac2"
//   },
//   "group": "html-52",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование flex-элементов",
//   "additional": "На занятии преподаватель:n- научит вас позиционировать flex-элементы;n- объяснит, как фиксировать элементы на странице;n- расскажет, что такое специфичность CSS-селектора и как она считается;n- покажет, как работать со шрифтами и изображениями в Adobe Photoshop.",
//   "id": "df9f65d0-cf20-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d4a53a9169a0017b5fac3"
//   },
//   "group": "html-52",
//   "date": "2020-07-31",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На занятии вы узнаете:n- что из себя представляет работа над дипломным проектом;n- из каких этапов она состоит;n- что нужно сделать, чтобы получить допуск. Большинство из вас прекрасно показали себя на курсе, так что мы уверены, что вы отлично справитесь!",
//   "id": "ed8968d0-cf20-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d4a79a9169a0017b5fac4"
//   },
//   "group": "mq-26",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивные изображения",
//   "additional": "На лекции вы дополните свои знания полезными flexbox-свойствами:n✅ flex-grow - растяжение элементов;n✅ flex-shrink - сужение элементов;n✅ flex-basis - базовая ширина элемента;n✅ flex - задание базовой ширины и трансформации элемента одним свойством;n✅ order - порядок отображения элементов.nКроме того, вы познакомитесь с тегом <picture> и рассмотрите пример загрузки различных вариантов фонового изображения для разных разрешений с его помощью. А в заключение вы закрепите тему подготовки графики для разных устройств. nЗанятие будет занимательным, не пропустите!",
//   "id": "03bf23b0-cf21-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1d4a8fa9169a0017b5fac5"
//   },
//   "group": "mq-26",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "Вы узнаете, что из себя представляет работа над дипломным проектом, какие будут сроки и что нужно сделать, чтобы получить допуск. nБольшинство из вас прекрасно показали себя на курсе, так что мы уверены, что вы отлично справитесь! ",
//   "id": "11132840-cf21-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1de585a9169a0017b5fac8"
//   },
//   "group": "ios-7",
//   "date": "2020-07-27",
//   "time": "18:30",
//   "teacher": "Оксана Махонина",
//   "lecture": "Вводное занятие с координатором курса",
//   "additional": "Ждем вас онлайн.",
//   "id": "6e3992f0-cf7d-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1de622a9169a0017b5facb"
//   },
//   "group": "py-33",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Елена Никитина",
//   "lecture": "Коллекции данных. Словари. Множества",
//   "additional": "Ждем вас онлайн.",
//   "id": "cb8cb7c0-cf7d-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1de6dda9169a0017b5facd"
//   },
//   "group": "py-32",
//   "date": "2020-07-27",
//   "time": "19:30",
//   "teacher": "Александр Иванов",
//   "lecture": "Введение в базы данных. Типы Баз данных",
//   "additional": "Ждем вас онлайн.",
//   "id": "3b1e4590-cf7e-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1dee87a9169a0017b5face"
//   },
//   "group": "iqa-11",
//   "date": "2020-07-27",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Тестирование ПО. Многообразие тестирования",
//   "additional": "Ждём всех онлайн!",
//   "id": "ccc45b20-cf82-11ea-8065-539f924636cb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1e80e9ffb2d60017b395e8"
//   },
//   "group": "jd-1",
//   "date": "2020-07-27",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "Тестирование кода и Unit-тесты",
//   "additional": "n",
//   "id": "0ce31410-cfda-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1e810affb2d60017b395e9"
//   },
//   "group": "jd-1",
//   "date": "2020-07-30",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "Mockito. Мокирование вызовов, Mock, Stub",
//   "additional": "n",
//   "id": "20608cc0-cfda-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1e8128ffb2d60017b395ea"
//   },
//   "group": "jd-1",
//   "date": "2020-08-03",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "Основы работы с сетью. Модель OSI",
//   "additional": "n",
//   "id": "32419380-cfda-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1e813dffb2d60017b395eb"
//   },
//   "group": "jd-1",
//   "date": "2020-08-06",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "Протокол HTTP. Вызовы удаленных серверов",
//   "additional": "n",
//   "id": "3f404c20-cfda-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1e8155ffb2d60017b395ec"
//   },
//   "group": "jd-1",
//   "date": "2020-08-10",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "JVM. Организация памяти, сборщики мусора, VisualVM",
//   "additional": "n",
//   "id": "4d49be00-cfda-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1eb548ffb2d60017b395f0"
//   },
//   "group": "aqa-7",
//   "date": "2020-07-28",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Тестирование API, Continuous Integration",
//   "additional": "Ждём всех онлайн!",
//   "id": "443a4fe0-cff9-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ef00bffb2d60017b395f1"
//   },
//   "group": "onec-3",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Справочники",
//   "additional": "nНа занятии вы узнаете:n-что такое справочник;n-для чего служат его реквизиты и табличные части;n-как определять, на какие справочники лучше делить сущности предметной области.nnНаучитесь:n-переопределять установку кода, получение представления и ввод по строке;n-создавать, удалять и изменять элементы;n-создавать и получать предопределенные элементы.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "4ab24440-d01c-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ef2f5ffb2d60017b395f2"
//   },
//   "group": "onec-3",
//   "date": "2020-08-06",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Иерархия и подчинение",
//   "additional": "nНа занятии вы узнаете:n-зачем нужна иерархия;n-чем отличается иерархия элементов от иерархии групп;n-как она отображается в списках;n-зачем нужно подчинение;n-чем оно лучше просто реквизита-ссылки.nnНаучитесь:n-удалять, искать и отбирать элементы по иерархии;n-создавать элементы справочников с циклическими ссылками друг на друга.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "06cf32e0-d01e-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ef368ffb2d60017b395f3"
//   },
//   "group": "onec-3",
//   "date": "2020-08-12",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Формы справочников",
//   "additional": "nНаучитесь:n-изменять элемент справочника перед записью и записывать вместе с ним другие данные;n-реализовывать подбор;n-скрывать помеченные на удаление элементы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "4bb1a0f0-d01e-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ef393ffb2d60017b395f4"
//   },
//   "group": "onec-3",
//   "date": "2020-08-14",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Регистры сведений",
//   "additional": "nНа занятии вы узнаете:n-что такое “регистр сведений” и зачем он нужен;n-что такое измерения, и чем отличается ресурс от реквизита;n-что такое “ведущее измерение” и когда добавлять индексы.nnНаучитесь:n-программно открывать форму записи и форму списка с отбором;n-делать простейший отчет по регистру.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "6575d9c0-d01e-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ef3b3ffb2d60017b395f5"
//   },
//   "group": "onec-3",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Запись и чтение регистров",
//   "additional": "nНа занятии вы узнаете:n-что такое менеджер регистра, менеджер записи и набор записей;n-когда использовать менеджер записи, а когда -- набор.nnНаучитесь:n-читать, записывать, изменять и удалять данные регистров с помощью менеджеров записи и наборов записей;n-переопределять события модуля набора записей.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "783d9700-d01e-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ef3d9ffb2d60017b395f6"
//   },
//   "group": "onec-3",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nНа занятии вы узнаете:n-что такое виртуальные таблицы;n-как получать срез первых и срез последних.nnНаучитесь:n-строить простые отчеты по виртуальным таблицам регистров сведений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "8ee26760-d01e-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1f3038ffb2d60017b395f7"
//   },
//   "group": "pb-15",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Ассоциативные массивы",
//   "additional": "nНа лекции мы узнаем о том:nn  - что такое ассоциативные массивы;n  - какие особенности есть у таких массивов;n  - как описать объекты реального мира в коде.nnnДополнительные материалыnГде и как можно поиграться с ассоциативными массивами:nСodewars, programming challengesnhttps://www.codewars.com/nОбъекты как ассоциативные массивы, learn javascriptnhttps://learn.javascript.ru/objectnКонсоль браузераnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Learn/JavaScript/Объекты/Основы nlearn javascriptnhttps://learn.javascript.ru/array ",
//   "id": "8ab247e0-d042-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1f307bffb2d60017b395f8"
//   },
//   "group": "pb-15",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Функция без параметров. Область видимости",
//   "additional": "nНа лекции мы узнаем:nn  - что такое подпрограммы;n  - к каким переменным есть доступ у функции;n  - как переопределить переменную из другой области видимости.nnдополнительные материалы:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Functionsnlearnjsnhttps://learn.javascript.ru/function-basics",
//   "id": "b2f79390-d042-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1f30c9ffb2d60017b395f9"
//   },
//   "group": "pb-16",
//   "date": "2020-07-31",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Базовые понятия. Переменные и числа ",
//   "additional": "nДополнительные материалыnпочитать:nКак работает интернетnhttps://developer.mozilla.org/ru/docs/Learn/How_the_Internet_worksnВыражения и операторыnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Expressions_and_Operators#%D0%9E%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80%D1%8B_%D0%BF%D1%80%D0%B8%D1%81%D0%B2%D0%B0%D0%B8%D0%B2%D0%B0%D0%BD%D0%B8%D1%8FnВведение в javascriptnhttps://learn.javascript.ru/intronnпосмотреть:nЕще одна лекция о числах в javascriptnhttps://www.youtube.com/watch?v=aGTjRU7Dp20&list=PLo6puixMwuSNxJCgadaaavKqq4-ocKPrRnКак работает javascriptnhttps://www.youtube.com/watch?v=H6G63NKRSi8&feature=youtu.benhttps://www.youtube.com/watch?v=fXi49EkrMPI",
//   "id": "e12a0db0-d042-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1f37b0ffb2d60017b395fa"
//   },
//   "group": "java Qa-8",
//   "date": "2020-07-28",
//   "time": "20:00",
//   "teacher": " Василий Дорохин",
//   "lecture": "Разбор задач",
//   "additional": "Ждём всех онлайн!",
//   "id": "fe48bf50-d046-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1f3808ffb2d60017b395fb"
//   },
//   "group": "ibb-1",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Евгений Строев",
//   "lecture": "Организация защиты информации (часть 2) ",
//   "additional": "Ждём всех онлайн!",
//   "id": "3338b030-d047-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1f3838ffb2d60017b395fc"
//   },
//   "group": "iqa-11",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "Ждём всех онлайн!",
//   "id": "4f9e6ee0-d047-11ea-ab41-6f659dfe0a77",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fba7697a9e5001751c661"
//   },
//   "group": "ios-7",
//   "date": "2020-07-28",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Среда разработки и основные понятия",
//   "additional": "Ждем вас онлайн.",
//   "id": "f0b59270-d094-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fbadf97a9e5001751c663"
//   },
//   "group": "ios-6",
//   "date": "2020-07-28",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Управление в ООП",
//   "additional": "Ждем вас онлайн.",
//   "id": "2f94d910-d095-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fbb3a97a9e5001751c665"
//   },
//   "group": "dj-11",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Базы данных",
//   "additional": "Ждем вас онлайн.",
//   "id": "65f7bae0-d095-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fbb8d97a9e5001751c667"
//   },
//   "group": "ios-1",
//   "date": "2020-07-28",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Разбор практического задания № 1",
//   "additional": "Ждем вас онлайн.",
//   "id": "97223f50-d095-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fd51597a9e5001751c668"
//   },
//   "group": "ios-7",
//   "date": "2020-07-28",
//   "time": "18:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Среда разработки и основные понятия",
//   "additional": "Ждем вас онлайн.",
//   "id": "ceed17c0-d0a4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fef1497a9e5001751c669"
//   },
//   "group": "java-14",
//   "date": "2020-08-10",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Абстракции и интерфейсы",
//   "additional": "n",
//   "id": "4ddc8610-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fef3297a9e5001751c66a"
//   },
//   "group": "java-14",
//   "date": "2020-08-13",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Исключения, Stacktrace",
//   "additional": "n",
//   "id": "5fab6460-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fef4797a9e5001751c66b"
//   },
//   "group": "java-14",
//   "date": "2020-08-17",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "6be56d70-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fef9a97a9e5001751c66c"
//   },
//   "group": "an-11",
//   "date": "2020-08-04",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Жизненный цикл Activity",
//   "additional": "n",
//   "id": "9db6b930-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fefb697a9e5001751c66d"
//   },
//   "group": "an-11",
//   "date": "2020-08-06",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Android Intents. Переход между экранами с передачей данных",
//   "additional": "n",
//   "id": "ae401f30-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fefcc97a9e5001751c66e"
//   },
//   "group": "an-11",
//   "date": "2020-08-10",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Android Intents. Системные функции Android",
//   "additional": "n",
//   "id": "bb718090-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1fefe397a9e5001751c66f"
//   },
//   "group": "an-11",
//   "date": "2020-08-12",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "c8d822c0-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ff01197a9e5001751c670"
//   },
//   "group": "an-12",
//   "date": "2020-08-03",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "App resources, Config qualifier",
//   "additional": "n",
//   "id": "e449bd70-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ff02497a9e5001751c671"
//   },
//   "group": "an-12",
//   "date": "2020-08-07",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Android styles",
//   "additional": "n",
//   "id": "efd8b970-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ff03797a9e5001751c672"
//   },
//   "group": "an-12",
//   "date": "2020-08-10",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Списки Android: базовые",
//   "additional": "n",
//   "id": "fb0b8bb0-d0b4-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ff05497a9e5001751c673"
//   },
//   "group": "an-12",
//   "date": "2020-08-14",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Работа с конфигурируемым интерфейсом на примере списков. Классы Adapter, AdapterView",
//   "additional": "n",
//   "id": "0c878f10-d0b5-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f1ff06597a9e5001751c674"
//   },
//   "group": "an-12",
//   "date": "2020-08-17",
//   "time": "20:00",
//   "teacher": "Георгий Гусаков",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "1680cfe0-d0b5-11ea-8edf-57398c13ea38",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f211d4103401900173ec705"
//   },
//   "group": "adpy-13",
//   "date": "2020-07-29",
//   "time": "19:00",
//   "teacher": "Оксана Махонина",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "Ждем вас онлайн.",
//   "id": "6a445ad0-d168-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f211d8303401900173ec706"
//   },
//   "group": "ios-6",
//   "date": "2020-07-29",
//   "time": "19:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Управление в ООП",
//   "additional": "Ждем вас онлайн.",
//   "id": "91973030-d168-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f21999603401900173ec707"
//   },
//   "group": "onec-1",
//   "date": "2020-08-07",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "XML и JSON",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "85bf92d0-d1b2-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2199ce03401900173ec708"
//   },
//   "group": "onec-1",
//   "date": "2020-08-12",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "HTTP-сервисы и SOAP-сервисы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "a731bce0-d1b2-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219a3703401900173ec709"
//   },
//   "group": "onec-1",
//   "date": "2020-08-14",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Распределенная информационная база",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "e5d1d7a0-d1b2-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219a6903401900173ec70a"
//   },
//   "group": "onec-1",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Базовые понятия учета",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "03906f90-d1b3-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219a9d03401900173ec70b"
//   },
//   "group": "onec-1",
//   "date": "2020-08-21",
//   "time": "20:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Планы счетов и регистры бухгалтерии",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "22225d10-d1b3-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219ad403401900173ec70c"
//   },
//   "group": "onec-1",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Субконто",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "43773b20-d1b3-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219b1c03401900173ec70d"
//   },
//   "group": "onec-1",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Виртуальные таблицы остатков и оборотов",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "6e3ca200-d1b3-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219b9503401900173ec70f"
//   },
//   "group": "onec-1",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Вытеснение",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "b6411090-d1b3-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219bd203401900173ec710"
//   },
//   "group": "onec-1",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "da6c6730-d1b3-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219c0503401900173ec711"
//   },
//   "group": "onec-1",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Процессы и схемы процессов",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "f90643f0-d1b3-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219c5e03401900173ec712"
//   },
//   "group": "onec-1",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Задачи",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "2dd4a310-d1b4-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f219c9603401900173ec713"
//   },
//   "group": "onec-1",
//   "date": "2020-09-16",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Ролевая адресация",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "4f4a0170-d1b4-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f21c06203401900173ec717"
//   },
//   "group": "aqa-7",
//   "date": "2020-07-30",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Тестирование веб-интерфейсов, Selenium и Selenide",
//   "additional": "Ждём всех онлайн!",
//   "id": "a5cdc8a0-d1c9-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f21c10703401900173ec718"
//   },
//   "group": "iqa-11",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Артефакты тестирования. Дефекты",
//   "additional": "Ждём всех онлайн!",
//   "id": "07c52120-d1ca-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f21dd2103401900173ec71b"
//   },
//   "group": "dj-11",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Базы данных, часть 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "c8227ac0-d1da-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f21dda103401900173ec71d"
//   },
//   "group": "py-32",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Работа с PostgreSQL. Создание БД",
//   "additional": "Ждем вас онлайн.",
//   "id": "13f35aa0-d1db-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f21ddf203401900173ec71f"
//   },
//   "group": "py-33",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Функции - использование встроенных и создание собственных",
//   "additional": "Ждем вас онлайн.",
//   "id": "44a3a600-d1db-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f21de8703401900173ec721"
//   },
//   "group": "ios-7",
//   "date": "2020-07-30",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "Ждем вас онлайн.",
//   "id": "9d6534c0-d1db-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f21dedc03401900173ec722"
//   },
//   "group": "ios-5",
//   "date": "2020-07-30",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Подготовка к курсовому заданию",
//   "additional": "Ждем вас онлайн.",
//   "id": "d0084f70-d1db-11ea-831c-6140f0e4d76d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f22ffcfec27a100175c80e6"
//   },
//   "group": "java QA-8",
//   "date": "2020-07-31",
//   "time": "20:00",
//   "teacher": "Ксения Глушкова",
//   "lecture": "Объектно-ориентированное      программирование и проектирование",
//   "additional": "Ждём всех онлайн!",
//   "id": "0a34a930-d288-11ea-93c8-cd7392dece59",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f231ba1ec27a100175c80ea"
//   },
//   "group": "ios-6",
//   "date": "2020-07-31",
//   "time": "19:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Классы и структуры",
//   "additional": "Ждем вас онлайн.",
//   "id": "9f4ee070-d298-11ea-93c8-cd7392dece59",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f23e72f53c3ca001797a4d6"
//   },
//   "group": "git-16",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "f3460ae0-d311-11ea-b352-3fcb4aa01543",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d585bb2fb30017795016"
//   },
//   "group": "ajs-8",
//   "date": "2020-08-03",
//   "time": "18:30",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "2f180c60-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d59abb2fb30017795017"
//   },
//   "group": "ajs-9",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Unit-тестирование",
//   "additional": "На занятии вы познакомитесь с:n- Unit-тестированиеn- покрытием кодаn- Jestn- Mock'амиn- Data Driven тестами",
//   "id": "3bb962c0-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d5b8bb2fb30017795018"
//   },
//   "group": "ajs-9",
//   "date": "2020-08-07",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Прототипы, конструкторы, классы и наследование",
//   "additional": "На занятии вы узнаете о:n- конструкторахn- использовании прототиповn- привязке контекстаn- иерархии наследованияn- классах и наследовании",
//   "id": "4dc06810-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d616bb2fb30017795019"
//   },
//   "group": "bafe-11",
//   "date": "2020-08-03",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Вводное занятие с координатором курса",
//   "additional": "На лекции будут раскрыты основные организационные моменты, с которыми вы столкнетесь во время учебы.",
//   "id": "85c7ab10-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d62dbb2fb3001779501a"
//   },
//   "group": "bafe-11",
//   "date": "2020-08-05",
//   "time": "19:30",
//   "teacher": "Алексей Стегура",
//   "lecture": "Как замотивировать себя на учёбу",
//   "additional": "На лекции будут раскрыты вопросы мотивации. Приходите, будет интересно!",
//   "id": "93af3d10-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d645bb2fb3001779501b"
//   },
//   "group": "bhj-12",
//   "date": "2020-08-04",
//   "time": "20:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На лекции рассмотрим, какие бывают события. Остановимся на работе с input и output. Ждем вас на вебинаре!n",
//   "id": "a18012c0-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d65abb2fb3001779501c"
//   },
//   "group": "bhj-12",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Изменение структуры HTML-документа",
//   "additional": "На лекции мы познакомимся с содержимым HTML-документа, узнаем о представлении элемента и научимся управлять различными элементами. Не пропустите вебинар, чтобы задать интересующие вопросу лектору лично.n",
//   "id": "ae54d530-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d691bb2fb3001779501d"
//   },
//   "group": "bjs-13",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Функции, объекты в JavaScript",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Функцииn2. Аргументы и rest операторn3. Функциональные выраженияn4. Стрелочные функцииn5. Объекты и их свойства",
//   "id": "cf4bb4c0-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d6a6bb2fb3001779501e"
//   },
//   "group": "bjs-13",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Прототип и конструктор объекта",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Контекст выполненияn2. Конструктор объектаn3. Прототип объектаn4. Конструктор Objectn5. Конструктор Date и его методыn6. Методы объекта Math",
//   "id": "dba7ebd0-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d6c5bb2fb3001779501f"
//   },
//   "group": "bphp-8",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Основы работы с объектами",
//   "additional": "На лекции вы узнаете о:n- манипуляциях с датой и временемn- обработке ошибокn- механизме исключений",
//   "id": "eddbcd80-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26d6d9bb2fb30017795020"
//   },
//   "group": "bphp-8",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Сергей Вертепов",
//   "lecture": "HTTP, заголовки, сессии",
//   "additional": "На лекции вы узнаете о:n- протоколе HTTPn- GET-запросахn- Cookiesn- сессиях",
//   "id": "fa1a1c50-d4d1-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26f1cbbb2fb30017795021"
//   },
//   "group": "devops-1",
//   "date": "2020-08-03",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Элементы безопасности информационных систем",
//   "additional": "nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "09c033f0-d4e2-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26f209bb2fb30017795022"
//   },
//   "group": "devops-1",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Командная оболочка Bash: практические навыки",
//   "additional": "nНа лекции вы:n-узнаете для чего нужен  bash в DevOps;n-познакомитесь с основами его синтаксиса;n-узнаете, как написать первый скрипт;n-научитесь правильно экранировать операции с переменными.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "2e28baa0-d4e2-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26f23bbb2fb30017795023"
//   },
//   "group": "devops-1",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Использование Python для решения типовых DevOps задач",
//   "additional": "nНа занятии вы:n-узнаете, для каких DevOps-задач можно использовать Python;n-поработаете с синтаксисом;n-познакомитесь с двумя модулями для работы с системой;n-напишите скрипт.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "4c677f10-d4e2-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26f273bb2fb30017795024"
//   },
//   "group": "devops-1",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Языки разметки JSON и YAML",
//   "additional": "nНа лекции вы:n-узнаете, что такое языки разметки;n-узнаете, для чего они нужны;n-познакомитесь с синтаксисом двух языков;n-познакомитесь с возможностями их обработки при помощи Python/nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "6de78bd0-d4e2-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26f42ebb2fb30017795025"
//   },
//   "group": "devops-1",
//   "date": "2020-08-26",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Разбор задач блока «Системы управления версиями»",
//   "additional": "nНа занятии автор профессии разберет домашние задания, которые вызвали у вас наибольшие трудности, и ответит на вопросы по предыдущим лекциям.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "75b544a0-d4e3-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26f47dbb2fb30017795026"
//   },
//   "group": "devops-1",
//   "date": "2020-09-02",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Разбор задач блока «Основы системного администрирования»",
//   "additional": "nНа занятии автор профессии разберет домашние задания, которые вызвали у вас наибольшие трудности, и ответит на вопросы по предыдущим лекциям.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "a50c8fb0-d4e3-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f26f513bb2fb30017795027"
//   },
//   "group": "devops-1",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Разбор задач блока «Скриптовые языки и языки разметки: Python, Bash, YAML, JSON»",
//   "additional": "nНа занятии автор профессии разберет домашние задания, которые вызвали у вас наибольшие трудности, и ответит на вопросы по предыдущим лекциям.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.  ",
//   "id": "fe084140-d4e3-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2725aabb2fb30017795028"
//   },
//   "group": "pb-15",
//   "date": "2020-08-03",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Параметры и возвращаемое значение",
//   "additional": "nНа лекции мы узнаем:n  - как передать данные в функцию через аргументы;n  - как получить данные из функции;n  - сколько значений можно вернуть из функции.",
//   "id": "f4718ca0-d500-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f272607bb2fb30017795029"
//   },
//   "group": "pb-16",
//   "date": "2020-08-04",
//   "time": "19:30",
//   "teacher": "Константин Полянский",
//   "lecture": "Логический тип и ветвление",
//   "additional": "nНа лекции мы узнаем:n  - как делать программы нелинейными — выполнять различный блок кода в зависимости от состояния программыn  - как удобно хранить информацию о признаках вида «да/нет»n  - что такое логические операции.nnnДополнительные материалы.nпочитать:nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Логические_операторыnhttps://learn.javascript.ru/logical-opsnhttps://learn.javascript.ru/comparisonnпосмотреть:nхороший обзор nhttps://www.youtube.com/watch?v=B4ZCFdrBmbEnеще один обзор с конкретными примерами, но уже на английскомnhttps://www.youtube.com/watch?v=2cGleL5FMZMnпараллельно даются несколько полезных советов для работы в консоле веб-разработчикаnhttps://www.youtube.com/watch?v=Gy87ZS5sb1w",
//   "id": "2b90b990-d501-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f27264abb2fb3001779502a"
//   },
//   "group": "pb-16",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Строки. Алгоритмы. Как отлаживать код ",
//   "additional": "nНа лекции мы узнаем:n  - как работают строки в JS;n  - что такое алгоритмы и как их сравнивать;n  - какие существуют приемы отладки кода;n  - как читать ошибки интерпретатора.nnДополнительные материалыnпочитать:nклассическая документация от MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Stringnразбор от Ильи Кантораnhttps://learn.javascript.ru/stringnnпосмотреть:n20 методов, которые помогут вам жонглировать строками в JS, как настоящий PROnhttps://www.youtube.com/watch?v=VRz0nbax0uInхороший обзор (на английском)nhttps://www.youtube.com/watch?v=DljZQyNwdOgnпро типы ошибок в JS и то как с ними боротьсяnhttps://stepik.org/lesson/99598/step/1?unit=75361nувлекательнейшая лекция по алгоритмам (в рамках легендарного курса CS50 от Harvard University)nhttps://www.youtube.com/watch?v=U9o49qwa6hknкурс от Computer Science Center на stepiknhttps://stepik.org/course/217/nеще немного про алгоритмы (How Binary Search Works)nhttps://www.youtube.com/watch?v=JQhciTuD3E8",
//   "id": "53e08c90-d501-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2726bbbb2fb3001779502b"
//   },
//   "group": "pb-15",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nМы узнаем: n  - как получить допуск к дипломной работе;n  - что из себя представляет дипломный проект и кто поможет нам в работе над ним;n  - Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса.nnБудем рады видеть вас онлайн!",
//   "id": "971e2440-d501-11ea-9ad4-bb9e4df9cc51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f27b782bd05240017e0e0dc"
//   },
//   "group": "ios-7",
//   "date": "2020-08-03",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Знакомство со Swift в Playground. Переменные и константы. Числовые и строковые типы",
//   "additional": "Ждем вас онлайн.",
//   "id": "e23b0050-d557-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f27b833bd05240017e0e0de"
//   },
//   "group": "dj-11",
//   "date": "2020-08-03",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Взаимодействие с сайтом",
//   "additional": "Ждем вас онлайн.",
//   "id": "4bbdf500-d558-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f27bfe2bd05240017e0e0df"
//   },
//   "group": "iqa-11",
//   "date": "2020-08-03",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Артефакты тестирования. Тестовая документация",
//   "additional": "Ждем всех онлайн!",
//   "id": "e07939d0-d55c-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f27c012bd05240017e0e0e0"
//   },
//   "group": "aqa-7",
//   "date": "2020-08-03",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Selenide",
//   "additional": "Ждём всех онлайн!",
//   "id": "fcf40720-d55c-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f283e28bd05240017e0e0e2"
//   },
//   "group": "srk-2",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Матвей Серегин",
//   "lecture": "Конструктор запросов",
//   "additional": "nНа занятии вы узнаете:n-что такое запрос и конструктор запросов;n-какие элементы содержит конструктор запросов.nnНаучитесь:n-создавать запрос, используя конструктор запросов;n-получать и проверять результат  запроса;n-делать выборку запроса и обрабатывать записи.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "23dc3ec0-d5a8-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f283e6bbd05240017e0e0e3"
//   },
//   "group": "srk-2",
//   "date": "2020-08-18",
//   "time": "19:00",
//   "teacher": "Матвей Серегин",
//   "lecture": "Условия и подзапросы",
//   "additional": "nНа лекции вы узнаете:n-что такое условия в запросе, где они применяются, какие операторы используют, как формируются в конструкторе запросов;n-что такое подзапросы и как использовать.nnНаучитесь:n-создавать условия, подзапросы в конструкторе запросов;n-изменять и анализировать измененный текст запроса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "4bc38bf0-d5a8-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f283eb5bd05240017e0e0e4"
//   },
//   "group": "srk-2",
//   "date": "2020-08-21",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Итоги и группировки",
//   "additional": "nНа занятии вы узнаете:n-что такое итоги и группировка в запросе;n-как они формируются в конструкторе запросов. nnНаучитесь:n-создавать текст запроса для итогов и группировок;n-изменять и анализировать измененный текст запроса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "77eaa5b0-d5a8-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f283ef6bd05240017e0e0e5"
//   },
//   "group": "srk-2",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Соединения",
//   "additional": "nНа занятии вы узнаете:n-что такое соединение в запросе;n-какие бывают виды соединений. nnНаучитесь:n-создавать текст запроса с соединениями;n-изменять и анализировать текст запроса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9ecae320-d5a8-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f283f37bd05240017e0e0e6"
//   },
//   "group": "srk-2",
//   "date": "2020-08-26",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Временные таблицы и пакетные запросы",
//   "additional": "nНа лекции вы узнаете:n-что такое временные таблицы, пакет запросов и менеджер временных таблиц.nnНаучитесь:n-создавать временные таблицы;n-передавать в них данные из кода;n-выполнять пакетные  запросы;n-пользоваться менеджером временных таблиц.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c5e71820-d5a8-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f283f77bd05240017e0e0e7"
//   },
//   "group": "srk-2",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Введение в СКД",
//   "additional": "nНа занятии вы узнаете:n-что такое система компоновки данных.nnНаучитесь:n-создавать отчеты с помощью конструктора схемы компоновки данных. nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "ebef4510-d5a8-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f283fb5bd05240017e0e0e8"
//   },
//   "group": "srk-2",
//   "date": "2020-09-03",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Работа с СКД",
//   "additional": "nНа лекции вы узнаете:n-каковы основные объекты СКД;n-как они взаимодействуют при вводе ответа.nnНаучитесь:n-создавать отчет в СКД с использованием набора данных - объект;n-передавать данные из таблицы значений в набор данных - объект.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "10f962f0-d5a9-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f284135bd05240017e0e0e9"
//   },
//   "group": "srk-2",
//   "date": "2020-09-04",
//   "time": "18:30",
//   "teacher": "Сусанна Алиева",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nВы узнаете, что из себя представляет дипломная работа по Блоку «Прикладная разработка», и кто поможет вам в работе над ней. Поговорите о сроках выполнения работы и обсудите другие вопросы, связанные с завершением второго блока на профессии «1С-разработчик».n nЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "f5afcd30-d5a9-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f284b6fbd05240017e0e0ea"
//   },
//   "group": "onec-4",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Интерфейс конфигурации",
//   "additional": "nНа вебинаре вы узнаете:n-из каких частей состоит управляемый интерфейс;n-как настраивается каждая часть интерфейса;n-как связаны подсистемы и пользовательский интерфейс;n-как команды размещаются в интерфейсе;n-как настроить расположение основных панелей;n-что такое команда и как она размещается в интерфейсе;n-что такое «основная форма;n-как настроить отображение названий объектов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "0e1c0860-d5b0-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f284bb9bd05240017e0e0eb"
//   },
//   "group": "onec-4",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Матвей Серегин",
//   "lecture": "Формы, их реквизиты и данные",
//   "additional": "nНа лекции вы узнаете:n-почему управляемая форма делится на серверную и клиентскую части;n-из каких частей состоит форма;n-что такое реквизиты формы;n-что такое элементы формы;n-что такое параметры формы;n-что такое команды формы;n-как располагать элементы горизонтально и выделять группы элементов визуально;n-как писать клиентские и серверные методы;n-что такое «с контекстом» и «без контекста».nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "3a454500-d5b0-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f284c14bd05240017e0e0ed"
//   },
//   "group": "onec-4",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Команды",
//   "additional": "nНа лекции вы:n-углубите знания по командам;n-изучите особенности модуля команд, директив компиляции;n-рассмотрите назначение параметра ПараметрыВыполненияКоманды;n-рассмотрите отличия общих (глобальных) команд и команд, подчиненных объекту метаданных;n-рассмотрите  командный интерфейс формы;n-рассмотрите  наиболее частые сценарии открытия форм из модуля команды;n-изучите служебные системные параметры открытия форм.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "70986f60-d5b0-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f284ca7bd05240017e0e0ee"
//   },
//   "group": "onec-4",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Сусанна Алиева",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nВы узнаете, что из себя представляет дипломная работа по Блоку «Начало разработки», и кто поможет вам в работе над ней. Поговорите о сроках выполнения работы и обсудите другие вопросы, связанные с завершением первого блока на профессии «1С-разработчик».nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "c8110360-d5b0-11ea-8af3-1de2504553eb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f290282673142001738177c"
//   },
//   "group": "ios-3",
//   "date": "2020-08-04",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "2d05ec60-d61d-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2902bb673142001738177d"
//   },
//   "group": "ios-6",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Свойства и методы объекта",
//   "additional": "Ждем вас онлайн.",
//   "id": "4f3b6670-d61d-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2902e2673142001738177e"
//   },
//   "group": "py-32",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Проектирование БД. Связи. 3НФ",
//   "additional": "Ждем вас онлайн.",
//   "id": "664c6620-d61d-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f291c39673142001738177f"
//   },
//   "group": "ibb-1",
//   "date": "2020-08-04",
//   "time": "19:00",
//   "teacher": "Роман Жуков",
//   "lecture": "Средства защиты информации и их сертификации ",
//   "additional": "Ждем всех онлайн!",
//   "id": "8104c520-d62c-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f291dc66731420017381780"
//   },
//   "group": "java QA-8",
//   "date": "2020-08-04",
//   "time": "20:00",
//   "teacher": "Ксения Глушкова",
//   "lecture": "Объектно-ориентированное программирование: ключевые принципы",
//   "additional": "Ждём всех онлайн!",
//   "id": "6d4a9c20-d62d-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a4a26731420017381781"
//   },
//   "group": "ibb-1",
//   "date": "2020-08-07",
//   "time": "19:00",
//   "teacher": "Иван Чупров",
//   "lecture": "Теоретические основы криптографии",
//   "additional": "Ждём всех онлайн!",
//   "id": "cf1cd210-d67d-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a4da6731420017381782"
//   },
//   "group": "ibb-1",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Иван Чупров",
//   "lecture": "Симметричные криптосистемы",
//   "additional": "Ждём всех онлайн!",
//   "id": "f0f38a50-d67d-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a50e6731420017381783"
//   },
//   "group": "ibb-1",
//   "date": "2020-08-14",
//   "time": "19:00",
//   "teacher": "Ерёменко Виктор",
//   "lecture": "Ассиметричные криптосистемы",
//   "additional": "Ждём всех онлайн!",
//   "id": "0f82b8b0-d67e-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a5426731420017381784"
//   },
//   "group": "ibb-1",
//   "date": "2020-08-18",
//   "time": "19:00",
//   "teacher": "Жуков Роман",
//   "lecture": "Нормативное регулирование",
//   "additional": "Ждём всех онлайн!",
//   "id": "2e7081d0-d67e-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a7336731420017381785"
//   },
//   "group": "ibb-1",
//   "date": "2020-08-21",
//   "time": "19:00",
//   "teacher": "Роман Жуков",
//   "lecture": "Финансовые системы",
//   "additional": "Ждём всех онлайн!",
//   "id": "56bcdcf0-d67f-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a7726731420017381786"
//   },
//   "group": "ibb-1",
//   "date": "2020-08-25",
//   "time": "19:00",
//   "teacher": "Павел Волчков",
//   "lecture": "Международные и отраслевые стандарты (часть 1)",
//   "additional": "Ждём всех онлайн!",
//   "id": "7c36fab0-d67f-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a79e6731420017381787"
//   },
//   "group": "ibb-1",
//   "date": "2020-08-28",
//   "time": "19:00",
//   "teacher": "Павел Волчков",
//   "lecture": "Международные и отраслевые стандарты (часть 2)",
//   "additional": "Ждём всех онлайн!",
//   "id": "9681c8a0-d67f-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a8106731420017381788"
//   },
//   "group": "java QA-8",
//   "date": "2020-08-07",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Объекты с внутренним состоянием, управление состоянием при тестировании",
//   "additional": "Ждём всех онлайн!",
//   "id": "da8b89f0-d67f-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a83867314200173817891"
//   },
//   "group": "java QA-8",
//   "date": "2020-08-11",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Композиция и зависимость объектов. Mockito при создании авто-тестов",
//   "additional": "Ждём всех онлайн!",
//   "id": "f2a10150-d67f-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a85d673142001738178a"
//   },
//   "group": "java QA-8",
//   "date": "2020-08-14",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Наследование и расширяемость систем. Проблемы наследования",
//   "additional": "Ждём всех онлайн!",
//   "id": "0886a060-d680-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a886673142001738178b"
//   },
//   "group": "java QA-8",
//   "date": "2020-08-18",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Исключительные ситуации и их обработка. Тестирование исключений",
//   "additional": "Ждём всех онлайн!",
//   "id": "212bd4a0-d680-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a8a9673142001738178c"
//   },
//   "group": "java QA-8",
//   "date": "2020-08-21",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Интерфейсы для организации малой связности. Обобщённое программирование (Generics) ",
//   "additional": "Ждём всех онлайн!",
//   "id": "3609a0a0-d680-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29a9f6673142001738178e"
//   },
//   "group": "java QA-8",
//   "date": "2020-08-25",
//   "time": "20:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Collections Framework. CRUD и тестирование систем, управляющих набором объектов",
//   "additional": "Ждём всех онлайн!",
//   "id": "fc33c2b0-d680-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29aa59673142001738178f"
//   },
//   "group": "iqa-11",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Инструменты тестирования",
//   "additional": "Ждём всех онлайн!",
//   "id": "378e4f60-d681-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29aa7e6731420017381790"
//   },
//   "group": "iqa-11",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Жизненный цикл разработки ПО. Гибкие методологии разработки ПО",
//   "additional": "Ждём всех онлайн!",
//   "id": "4d849040-d681-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29aad06731420017381791"
//   },
//   "group": "iqa-11",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Разбор задач",
//   "additional": "Ждём всех онлайн!",
//   "id": "7e1ce6d0-d681-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29ab446731420017381792"
//   },
//   "group": "aqa-7",
//   "date": "2020-08-06",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Patterns",
//   "additional": "Ждём всех онлайн!",
//   "id": "c3981270-d681-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29ab7f6731420017381793"
//   },
//   "group": "aqa-7",
//   "date": "2020-08-10",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Behaviour Driven Development",
//   "additional": "Ждём всех онлайн!",
//   "id": "e6b1aaf0-d681-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29aba76731420017381794"
//   },
//   "group": "aqa-7",
//   "date": "2020-08-13",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Docker и Docker Compose",
//   "additional": "Ждём всех онлайн!",
//   "id": "fe88e0d0-d681-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29abe06731420017381795"
//   },
//   "group": "aqa-7",
//   "date": "2020-08-17",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "SQL",
//   "additional": "Ждём всех онлайн!",
//   "id": "207480a0-d682-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29ac126731420017381796"
//   },
//   "group": "aqa-7",
//   "date": "2020-08-20",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Репортинг: Report Portal",
//   "additional": "Ждём всех онлайн!",
//   "id": "3e27cdf0-d682-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f29ac3f6731420017381797"
//   },
//   "group": "aqa-7",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Артём Романов",
//   "lecture": "Заключительная лекция",
//   "additional": "Ждём всех онлайн!",
//   "id": "58da1040-d682-11ea-ac44-239482de1849",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2a5a4a47d0b70017e890d9"
//   },
//   "group": "ios-3",
//   "date": "2020-08-05",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "159f1560-d6ea-11ea-994b-513097f5f02b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2aa06f47d0b70017e890da"
//   },
//   "group": "devops-2",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Введение в DevOps",
//   "additional": "nНа вебинаре вы:n-обсудите принципы учебы на курсе;n-разберётесь, что включает в себя DevOps;n-поговорите об  инструментах;n-разберётесь в основных подходах к разработке.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "e4d5aaa0-d713-11ea-994b-513097f5f02b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2aa09847d0b70017e890db"
//   },
//   "group": "devops-2",
//   "date": "2020-08-12",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Системы контроля версий",
//   "additional": "nНа вебинаре вы научитесь:n-создавать и клонировать репозитории;n-определять и изменять состояния файлов;n-записывать изменения в репозиторий;n-удалять и перемещать файлы в репозитории.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "fdb35400-d713-11ea-994b-513097f5f02b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2aa0d247d0b70017e890dc"
//   },
//   "group": "devops-2",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Основы Git",
//   "additional": "nНа лекции вы научитесь:n-работать с историей коммитов;n-отменять изменения;n-работать с удаленными репозиториями;n-создавать и использовать теги;n-работать с ветвлениями.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "2014e720-d714-11ea-994b-513097f5f02b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2aa0ff47d0b70017e890dd"
//   },
//   "group": "devops-2",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Ветвления в Git. Хранилища репозиториев",
//   "additional": "nНа лекции вы:n-узнаете, как работают ветки и мержи;n-научитесь работать с удаленными ветками;n-освоите инструмент Rebase;n-узнаете, как использовать хуки.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "3b034810-d714-11ea-994b-513097f5f02b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2aa14447d0b70017e890de"
//   },
//   "group": "devops-2",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Инструменты Git",
//   "additional": "nНа лекции вы научитесь:n-работать с полными и сокращенными хэшами ревизий;n-работать с диапазоном коммитов;n-“прятать” изменения локально и удалять все лишние файлы;n-поиску виновных в ошибках, поиск текста в коде и истории коммитов;n-отменять коммиты и исправлять историю. nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "64432060-d714-11ea-994b-513097f5f02b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2aa18447d0b70017e890df"
//   },
//   "group": "devops-2",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Работа в терминале (лекция 1)",
//   "additional": "nНа лекции вы:n-познакомитесь с терминалом и интерактивным режимом командной строки;n-узнаете о некоторых особенностях стандарта FHS;n-научитесь перемещаться по директориям, создавать, перемещать и удалять их;  делать аналогичные действия с файлами;n-научитесь просматривать файлы разными способами;n-научитесь искать документацию встроенными средствами ОС;n-научитесь изменять рабочее окружение для удобства;n-научитесь управлять выполняемыми задачами и планировать выполнение в будущем.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "8a07b4a0-d714-11ea-994b-513097f5f02b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2aa1ae47d0b70017e890e0"
//   },
//   "group": "devops-2",
//   "date": "2020-08-31",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Работа в терминале (лекция 2)",
//   "additional": "nНа лекции вы узнаете о:n-процессах и некоторых их атрибутах;n-предоставляемых операционной системой абстракциях на примере стандартных потоков ввода-вывода;n-служебных файловых системах /dev и /proc;n-том, как посмотреть открытые процессом файлы с помощью lsof;n-развитии и типах терминалов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "a2e70bb0-d714-11ea-994b-513097f5f02b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f2ba2611aa22d0017093262"
//   },
//   "group": "py-32",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Select-запросы, выборки из одной таблицы",
//   "additional": "Ждём вас онлайн.",
//   "id": "a453a280-d7ad-11ea-9074-65832ecf9374",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ba27a1aa22d0017093263"
//   },
//   "group": "dj-11",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Персонализация сайта",
//   "additional": "Ждём вас онлайн.",
//   "id": "b32a4f70-d7ad-11ea-9074-65832ecf9374",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ba38e1aa22d0017093265"
//   },
//   "group": "pb-15",
//   "date": "2020-08-07",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nМы узнаем: n  - как получить допуск к дипломной работе;n  - что из себя представляет дипломный проект и кто поможет нам в работе над ним;n  - Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса.nnБудем рады видеть вас онлайн!",
//   "id": "579a9010-d7ae-11ea-9074-65832ecf9374",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ba4111aa22d0017093266"
//   },
//   "group": "ios-6",
//   "date": "2020-08-06",
//   "time": "19:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Замыкания",
//   "additional": "Ждём вас онлайн.",
//   "id": "a5d03af0-d7ae-11ea-9074-65832ecf9374",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2cfee2ff8235001740c541"
//   },
//   "group": "ios-7",
//   "date": "2020-08-07",
//   "time": "19:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Логические типы и операции с ними",
//   "additional": "Ждем вас онлайн.",
//   "id": "5e141ef0-d87d-11ea-8ac1-c3ba1b768f6f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff046e0f415001775dedd"
//   },
//   "group": "ajs-9",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Object, Reflection и Proxy",
//   "additional": "На лекции:n- разберём методы Objectn- познакомимся с устройством свойств объектов в JS и дескрипторами свойствn- поговорим о тонкостях, которые спрашивают на собеседованияхn- разберём Proxy и Reflection API",
//   "id": "6beaa9f0-da3e-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff081e0f415001775dede"
//   },
//   "group": "ajs-9",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Регулярные выражения",
//   "additional": "На лекции разберем:n- регулярные выраженияn- методы объекта Regexp и StringnА также поговорим о том, когда метод Regexp использовать не стоит",
//   "id": "8f4f0710-da3e-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff09be0f415001775dedf"
//   },
//   "group": "bafe-11",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "На лекции будут раскрыты следующие вопросы:n- как работает интернетn- протокол HTTPn- что такое серверnи многое другое.nЖдем вас на лекции!",
//   "id": "9ef40080-da3e-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff14be0f415001775dee0"
//   },
//   "group": "bhj-12",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Асинхронные запросы",
//   "additional": "Преподаватель расскажет нам о принципах асинхронности, рассмотрит FormData и отправку данных формы. И это только небольшая часть того, что будет освещено на лекции. Приходите, будет увлекательно!n",
//   "id": "077eb280-da3f-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff261e0f415001775dee1"
//   },
//   "group": "bhj-12",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Хранение состояния на клиенте и отправка на сервер",
//   "additional": "Преподаватель расскажет нам о document.cookie и localStorage. Осветит тему XHR: для чего и где используется. Приходите, будет интересно!n",
//   "id": "ad804180-da3f-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff27ae0f415001775dee2"
//   },
//   "group": "bjs-13",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "ООП в JS (ES6)",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Классыn2. Свойстваn3. Конструктор, методы, статические методыn4. Наследование и supern5. Нововведения последних версий ES",
//   "id": "bc52cfc0-da3f-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff2bbe0f415001775dee3"
//   },
//   "group": "bjs-13",
//   "date": "2020-08-12",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Обработка исключений и замыкания",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Внутренние исключений выполненияn2. Создание собственных исключенийn3. Перехват исключенийn4. Консольные методы для удобной работыn5. Области видимостиn6. Замыканияn7. Конструкция delete",
//   "id": "e2f84e20-da3f-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff37fe0f415001775dee4"
//   },
//   "group": "bjs-13",
//   "date": "2020-08-14",
//   "time": "18:00",
//   "teacher": "Евгений Шек",
//   "lecture": "Прототип массива, функции высшего порядка",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Константы и массивыn2. Поиск в массивеn3. Функции высшего порядкаn4. Расширенный поиск в массивеn5. Преобразование массива",
//   "id": "580a17c0-da40-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff396e0f415001775dee5"
//   },
//   "group": "bjs-14",
//   "date": "2020-08-14",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Базовый синтаксис",
//   "additional": "На лекции вы узнаете:n1. Переменные и константы, допустимые имена, правила именованияn2. Выражения, операторы и операндыn3. DevTools и console.logn4. Числаn5. Строки",
//   "id": "6564ac00-da40-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff3ace0f415001775dee6"
//   },
//   "group": "bphp-8",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Сергей Вертепов",
//   "lecture": "Файлы, html формы",
//   "additional": "На лекции вы узнаете о:n- том, как разносить код по разным файламn- HTML-формахn- особенностях загрузки файлов на серверnПознакомитесь с функциями для работы с внешними файлами.",
//   "id": "729d3950-da40-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f2ff3c8e0f415001775dee7"
//   },
//   "group": "bphp-8",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Развертывание приложения на хостинге",
//   "additional": "На лекции вы узнаете:n- что такое веб-серверn- виды хостинговn- хостингу herokunА также познакомитесь с введением в composer и деплоем php приложения в heroku.",
//   "id": "833f7e80-da40-11ea-a7f2-0107cb247ba2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f30eeeab445260017f9e40e"
//   },
//   "group": "pb-16",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Массивы и базовые методы работы с ними",
//   "additional": " nНа лекции мы узнаем:n  - что такое массивы.n  - для чего используются массивыn  - какие методы мы можем применять для работы с массивамиnnДополнительные материалы.nпочитать:nпо традиции - документация на MDN.nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array nопять же, по традиции learn.javascriptnhttps://learn.javascript.ru/array nnпосмотреть:nотличный обзор того, что мы сегодня обсудили (и даже больше) от Sorax.nhttps://www.youtube.com/watch?v=3OjuRfR8RNg nхороший обзор на английском.nhttps://www.youtube.com/watch?v=orAS-MBh5f4 ",
//   "id": "3338d300-dad6-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f30ef1ab445260017f9e40f"
//   },
//   "group": "pb-16",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Циклы",
//   "additional": " nНа лекции мы узнаем:nn  - что такое циклы и для чего они нужны;n  - как правильно писать циклы;n  - как работать с циклами и массивами.nnnДополнительные материалы:nЗдесь можно поизучать циклы самостоятельноnСodewars, programming challengesnhttps://www.codewars.com/nЦиклы while, for, learn.javascript.runhttps://learn.javascript.ru/while-fornМассивы: методы, learn.javascript.runhttps://learn.javascript.ru/array-methodsnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Циклы_и_итерацииnlearn javascriptnhttps://learn.javascript.ru/while-fornnпосмотреть:nобзор циклов от Soraxnhttps://www.youtube.com/watch?v=ITr-SzUIDpQnхороший обзор на английскомnhttps://www.youtube.com/watch?v=orAS-MBh5f4",
//   "id": "4faf0c70-dad6-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f30f46cb445260017f9e411"
//   },
//   "group": "ios-1",
//   "date": "2020-08-10",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Разбор практического задания № 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "7b9d5b90-dad9-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310deab445260017f9e413"
//   },
//   "group": "jd-2",
//   "date": "2020-08-14",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Лямбда-выражения и функциональные интерфейсы",
//   "additional": "n",
//   "id": "ad9da8c0-dae8-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310e01b445260017f9e414"
//   },
//   "group": "jd-2",
//   "date": "2020-08-18",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Stream API. Потоки, повторные вызовы, основные методы",
//   "additional": "n",
//   "id": "bb5ccb30-dae8-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310e2eb445260017f9e415"
//   },
//   "group": "jd-2",
//   "date": "2020-08-21",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Потоки ввода-вывода. Работа с файлами. Сериализация",
//   "additional": "n",
//   "id": "d5c3fac0-dae8-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310e48b445260017f9e416"
//   },
//   "group": "jd-2",
//   "date": "2020-08-25",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Сборка проектов. Maven и Gradle",
//   "additional": "n",
//   "id": "e5288fd0-dae8-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310e60b445260017f9e417"
//   },
//   "group": "jd-2",
//   "date": "2020-08-27",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Работа с файлами CSV, XML, JSON",
//   "additional": "n",
//   "id": "f3e6f9d0-dae8-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310e85b445260017f9e418"
//   },
//   "group": "jd-2",
//   "date": "2020-09-01",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "Тестирование кода и Unit-тесты",
//   "additional": "n",
//   "id": "09e948a0-dae9-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310e9fb445260017f9e419"
//   },
//   "group": "jd-2",
//   "date": "2020-09-04",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "Mockito. Мокирование вызовов, Mock, Stub",
//   "additional": "n",
//   "id": "1952e6c0-dae9-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310eb4b445260017f9e41a"
//   },
//   "group": "jd-2",
//   "date": "2020-09-08",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "Основы работы с сетью. Модель OSI",
//   "additional": "n",
//   "id": "25f4d960-dae9-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310ecab445260017f9e41b"
//   },
//   "group": "jd-2",
//   "date": "2020-09-11",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "Протокол HTTP. Вызов удаленных серверов",
//   "additional": "n",
//   "id": "330b38b0-dae9-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f310edeb445260017f9e41c"
//   },
//   "group": "jd-2",
//   "date": "2020-09-15",
//   "time": "20:00",
//   "teacher": "Алексей Степанов",
//   "lecture": "JVM. Организация памяти, сборщики мусора, VisualVM",
//   "additional": "n",
//   "id": "3f079c80-dae9-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f311310b445260017f9e41e"
//   },
//   "group": "WM_58",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для разметки текста и атрибуты",
//   "additional": "n",
//   "id": "beb67620-daeb-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f311327b445260017f9e41f"
//   },
//   "group": "WM_58",
//   "date": "2020-08-18",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Списки и таблицы",
//   "additional": "n",
//   "id": "cc8799f0-daeb-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f31133bb445260017f9e420"
//   },
//   "group": "WM_58",
//   "date": "2020-08-21",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Селекторы и свойства",
//   "additional": "n",
//   "id": "d8b17660-daeb-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f311358b445260017f9e421"
//   },
//   "group": "WM_58",
//   "date": "2020-08-25",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Оформление текстовых блоков с помощью CSS",
//   "additional": "n",
//   "id": "ea01d5e0-daeb-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f311372b445260017f9e422"
//   },
//   "group": "WM_58",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "n",
//   "id": "f9690300-daeb-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f316f61b445260017f9e424"
//   },
//   "group": "java qa-9",
//   "date": "2020-08-12",
//   "time": "20:00",
//   "teacher": "Ксения Глушкова",
//   "lecture": "Введение в Java: JDK, JRE, JVM, IntelliJ IDEA",
//   "additional": "Ждём всех онлайн!",
//   "id": "c555b180-db22-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f316ff7b445260017f9e425"
//   },
//   "group": "java qa-10",
//   "date": "2020-08-12",
//   "time": "20:00",
//   "teacher": "Ксения Глушкова",
//   "lecture": "Введение в Java: JDK, JRE, JVM, IntelliJ IDEA",
//   "additional": "Ждём всех онлайн!",
//   "id": "1f008ed0-db23-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f317075b445260017f9e426"
//   },
//   "group": "java qa-9",
//   "date": "2020-08-14",
//   "time": "20:00",
//   "teacher": "Ксения Глушкова",
//   "lecture": "Программирование на Java: переменные, операторы, работа с отладчиком",
//   "additional": "Ждём всех онлайн!",
//   "id": "69fa4890-db23-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3170ccb445260017f9e427"
//   },
//   "group": "java qa-10",
//   "date": "2020-08-14",
//   "time": "20:00",
//   "teacher": "Ксения Глушкова",
//   "lecture": "Программирование на Java: переменные, операторы, работа с отладчиком",
//   "additional": "Ждём всех онлайн!",
//   "id": "9dc56880-db23-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f317ea9b445260017f9e428"
//   },
//   "group": "java qa-9",
//   "date": "2020-08-17",
//   "time": "20:00",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Примитивные типы данных, условные операторы, выход за границы типов и погрешность вычислений",
//   "additional": "Ждём всех онлайн!",
//   "id": "e0ff8420-db2b-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f317ec9b445260017f9e429"
//   },
//   "group": "java qa-10",
//   "date": "2020-08-17",
//   "time": "20:00",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Примитивные типы данных, условные операторы, выход за границы типов и погрешность вычислений",
//   "additional": "Ждём всех онлайн!",
//   "id": "f40079d0-db2b-11ea-b406-c3e7e9a5e3e6",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f323f6a894e2c0017a9a33b"
//   },
//   "group": "dj-11",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Создание и поддержка проекта",
//   "additional": "Ждем вас онлайн.",
//   "id": "c500ef70-db9e-11ea-ac1a-551d5db2813b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f323faa894e2c0017a9a33c"
//   },
//   "group": "ios-7",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Преобразование типов. Условные конструкции",
//   "additional": "Ждем вас онлайн.",
//   "id": "eb02b3c0-db9e-11ea-ac1a-551d5db2813b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f323fc7894e2c0017a9a33d"
//   },
//   "group": "ios-6",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Алексей Рочев",
//   "lecture": "Наследование. Переопределение",
//   "additional": "Ждем вас онлайн.",
//   "id": "fc9b3fd0-db9e-11ea-ac1a-551d5db2813b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f324067894e2c0017a9a33f"
//   },
//   "group": "py-33",
//   "date": "2020-08-11",
//   "time": "20:00",
//   "teacher": "Артем Черняков",
//   "lecture": "Классы и их применение в Python",
//   "additional": "Ждем вас онлайн.",
//   "id": "5c062110-db9f-11ea-ac1a-551d5db2813b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f325897894e2c0017a9a340"
//   },
//   "group": "lrv-1",
//   "date": "2020-08-11",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Фреймворки в PHP: Laravel",
//   "additional": "На лекции вы узнаете:n- что такое фреймворкn- серверные требования Laraveln- как устанавливать Laraveln- о структуре приложения.nТакже ознакомитесь с популярными фреймворками, узнаете о плагине Laravel для PhpStorm, помощнике Artisan.",
//   "id": "c65cd820-dbad-11ea-ac1a-551d5db2813b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3394fcb9e492001795c15e"
//   },
//   "group": "ios-5",
//   "date": "2020-08-12",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Подготовка к курсовому заданию A1IOS-5",
//   "additional": "Ждем вас онлайн.",
//   "id": "5cb1ed30-dc6a-11ea-ad2f-a185b3a91af3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f339519b9e492001795c15f"
//   },
//   "group": "py-32",
//   "date": "2020-08-12",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Группировки, выборки из нескольких таблиц",
//   "additional": "Ждем вас онлайн.",
//   "id": "6dc9fea0-dc6a-11ea-ad2f-a185b3a91af3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f34de3f6d154f0017d408de"
//   },
//   "group": "lrv-1",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Основы Laravel",
//   "additional": "На занятиии вы узнаете о:n- конфигурацииn- жизненном цикле запросаn- связывании и тегированииn- сервис-контейнерах и контроллерахn- фасадахn- контрактахnТакже вы познакомитесь с понятием внедрения зависимостей.",
//   "id": "9de11730-dd2e-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f34e6b76d154f0017d408e3"
//   },
//   "group": "ios-4",
//   "date": "2020-08-13",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Разбор курсового задания",
//   "additional": "Ждем вас онлайн.",
//   "id": "a9d80a80-dd33-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f34e6d46d154f0017d408e4"
//   },
//   "group": "ios-3",
//   "date": "2020-08-13",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 3",
//   "additional": "Ждем вас онлайн.",
//   "id": "bb1a8750-dd33-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f34e6f16d154f0017d408e5"
//   },
//   "group": "dj-11",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Азамат Искаков",
//   "lecture": "Работа с API",
//   "additional": "Ждем вас онлайн.",
//   "id": "cc7435a0-dd33-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f34e7116d154f0017d408e6"
//   },
//   "group": "py-33",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Дмитрий Демидов",
//   "lecture": "Открытие и чтение файла, запись в файл",
//   "additional": "Ждем вас онлайн.",
//   "id": "df8075f0-dd33-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f34e7266d154f0017d408e7"
//   },
//   "group": "ios-6",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Алексей Рочев",
//   "lecture": "Протоколы и расширения",
//   "additional": "Ждем вас онлайн.",
//   "id": "ec18a490-dd33-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f34e7876d154f0017d408e8"
//   },
//   "group": "ios-1",
//   "date": "2020-08-13",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Разбор практического задания № 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "25e98400-dd34-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3523406d154f0017d408ea"
//   },
//   "group": "java-15",
//   "date": "2020-08-24",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Первая программа на Java",
//   "additional": "n",
//   "id": "bf42f0f0-dd57-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3523576d154f0017d408eb"
//   },
//   "group": "java-15",
//   "date": "2020-08-28",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структура программы",
//   "additional": "n",
//   "id": "cc9bd780-dd57-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f35236c6d154f0017d408ec"
//   },
//   "group": "java-15",
//   "date": "2020-08-31",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Условные операторы и циклы",
//   "additional": "n",
//   "id": "d91b26f0-dd57-11ea-9344-6f8302dd242f",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f3523836d154f0017d408ed"
//   },
//   "group": "java-15",
//   "date": "2020-09-02",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "n",
//   "id": "e6cae010-dd57-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f35239b6d154f0017d408ee"
//   },
//   "group": "java-15",
//   "date": "2020-09-03",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Типы данных в Java: примитивы",
//   "additional": "n",
//   "id": "f5224ae0-dd57-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3523b36d154f0017d408ef"
//   },
//   "group": "java-15",
//   "date": "2020-09-08",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: объекты",
//   "additional": "n",
//   "id": "03536900-dd58-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3523c86d154f0017d408f0"
//   },
//   "group": "java-15",
//   "date": "2020-09-10",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структура класса",
//   "additional": "n",
//   "id": "101b3320-dd58-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3524056d154f0017d408f1"
//   },
//   "group": "java-15",
//   "date": "2020-09-14",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач и основы работы в IDE",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "3459eab0-dd58-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3524546d154f0017d408f2"
//   },
//   "group": "java-14",
//   "date": "2020-08-24",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Коллекции List",
//   "additional": "n",
//   "id": "63760180-dd58-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3524716d154f0017d408f3"
//   },
//   "group": "java-14",
//   "date": "2020-08-26",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллекции Queue",
//   "additional": "n",
//   "id": "74947b90-dd58-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f35248b6d154f0017d408f4"
//   },
//   "group": "java-14",
//   "date": "2020-09-01",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Коллеции HashSet и HashMap",
//   "additional": "n",
//   "id": "841c2900-dd58-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3524a56d154f0017d408f5"
//   },
//   "group": "java-14",
//   "date": "2020-09-07",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции TreeMap",
//   "additional": "n",
//   "id": "9392bf70-dd58-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3524ba6d154f0017d408f6"
//   },
//   "group": "java-14",
//   "date": "2020-09-10",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "a08717d0-dd58-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3528826d154f0017d408f8"
//   },
//   "group": "git-17",
//   "date": "2020-08-31",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Разбор задач и вопросов",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "e11de790-dd5a-11ea-9344-6f8302dd242f",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f3528c16d154f0017d408f9"
//   },
//   "group": "an-12",
//   "date": "2020-08-24",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Работа с файлами в Android: внешние файлы",
//   "additional": "n",
//   "id": "06a090d0-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3528d66d154f0017d408fa"
//   },
//   "group": "an-12",
//   "date": "2020-08-27",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Работа с файлами в Android: внутренние файлы",
//   "additional": "n",
//   "id": "1328b9e0-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f35292f6d154f0017d408fb"
//   },
//   "group": "an-12",
//   "date": "2020-08-31",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Жизненный цикл Activity",
//   "additional": "n",
//   "id": "48329b60-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f3529486d154f0017d408fc"
//   },
//   "group": "an-12",
//   "date": "2020-09-03",
//   "time": "20:00",
//   "teacher": "Алексей Вереин",
//   "lecture": "Android Intents. Переход между экранами с передачей данных",
//   "additional": "n",
//   "id": "57894dc0-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3529636d154f0017d408fd"
//   },
//   "group": "an-12",
//   "date": "2020-09-07",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Android Intents. Системные функции Android",
//   "additional": "n",
//   "id": "6799da40-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3529816d154f0017d408fe"
//   },
//   "group": "an-12",
//   "date": "2020-09-10",
//   "time": "20:00",
//   "teacher": "Дмитрий Качалов",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "7943cb70-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3529976d154f0017d408ff"
//   },
//   "group": "an-12",
//   "date": "2020-09-14",
//   "time": "20:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "n",
//   "id": "86582ef0-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3529cc6d154f0017d40900"
//   },
//   "group": "an-11",
//   "date": "2020-08-17",
//   "time": "20:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "n",
//   "id": "a5eaeaa0-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3529ea6d154f0017d40901"
//   },
//   "group": "kt-9",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "n",
//   "id": "b7c70f60-dd5b-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352ae76d154f0017d40902"
//   },
//   "group": "jd_1_jpat",
//   "date": "2020-08-17",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Порождающие шаблоны. Builder, Singleton, Factory Method, Abstract Factory, Prototype",
//   "additional": "n",
//   "id": "4eb891f0-dd5c-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352afd6d154f0017d40903"
//   },
//   "group": "jd-1",
//   "date": "2020-08-20",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структурные шаблоны. Adapter, Proxy, Decorator, Facade, Flyweight",
//   "additional": "n",
//   "id": "5b98ed20-dd5c-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352b196d154f0017d40904"
//   },
//   "group": "jd-1",
//   "date": "2020-08-25",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Поведенческие шаблоны. Command, CoR, Observer, Iterator",
//   "additional": "n",
//   "id": "6c421020-dd5c-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352b306d154f0017d40905"
//   },
//   "group": "jd-1",
//   "date": "2020-08-27",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Magics, DRY, SOLID",
//   "additional": "n",
//   "id": "7a5e94d0-dd5c-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352ce36d154f0017d40907"
//   },
//   "group": "an-13",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Иван Лавров",
//   "lecture": "Рабочее окружение: Gradle, Plugins, IntelliJ IDEA",
//   "additional": "n",
//   "id": "7da565f0-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352cf36d154f0017d40908"
//   },
//   "group": "an-13",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Отличия от Java: immutability, переменные, типы данных, операторы и приведение типов",
//   "additional": "n",
//   "id": "86e36d10-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352d046d154f0017d40909"
//   },
//   "group": "an-13",
//   "date": "2020-08-31",
//   "time": "19:00",
//   "teacher": "Иван Лавров",
//   "lecture": "Управляющие конструкции: if, switch, циклы. Работа с отладчиком",
//   "additional": "n",
//   "id": "90f08400-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f352d186d154f0017d4090a"
//   },
//   "group": "an-13",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Функции, автотесты и Continuous Integration",
//   "additional": "n",
//   "id": "9d1445f0-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352d2b6d154f0017d4090b"
//   },
//   "group": "an-13",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "ООП: Объекты и классы",
//   "additional": "n",
//   "id": "a89c6420-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352d3d6d154f0017d4090c"
//   },
//   "group": "an-13",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "ООП: Композиция, наследование и интерфейсы",
//   "additional": "n",
//   "id": "b332a840-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352d516d154f0017d4090d"
//   },
//   "group": "an-13",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Исключения",
//   "additional": "n",
//   "id": "beec84d0-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352d666d154f0017d4090e"
//   },
//   "group": "an-13",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Generics и коллекции",
//   "additional": "n",
//   "id": "cb83f020-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352d9a6d154f0017d4090f"
//   },
//   "group": "an-13",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Лямбды, extension-функции, операторы",
//   "additional": "n",
//   "id": "ea4e52c0-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352dab6d154f0017d40910"
//   },
//   "group": "an-13",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Sequences",
//   "additional": "n",
//   "id": "f4f5fc00-dd5d-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f352e5c6d154f0017d40911"
//   },
//   "group": "java-14",
//   "date": "2020-09-03",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции TreeSet",
//   "additional": "n",
//   "id": "5e229350-dd5e-11ea-9344-6f8302dd242f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3638e244c32700173f0eae"
//   },
//   "group": "py-32",
//   "date": "2020-08-14",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Python и БД. ORM",
//   "additional": "Ждем всех онлайн.",
//   "id": "3a860ef0-ddfd-11ea-bf74-793e9d50ab43",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f36390444c32700173f0eaf"
//   },
//   "group": "ios-7",
//   "date": "2020-08-14",
//   "time": "19:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Опциональные типы и преобразование",
//   "additional": "Ждем вас онлайн.",
//   "id": "4e7471e0-ddfd-11ea-bf74-793e9d50ab43",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3641a844c32700173f0eb1"
//   },
//   "group": "dj-12",
//   "date": "2020-08-14",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Знакомство с Django. Подготовка и запуск проекта",
//   "additional": "Ждем вас онлайн.",
//   "id": "74eb9b00-de02-11ea-bf74-793e9d50ab43",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3972cb377b6b00170b20ab"
//   },
//   "group": "onec-3",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Матвей Серегин",
//   "lecture": "Документы",
//   "additional": "nНа лекции вы:n-узнаете, что такое документы, изучите структуру документа;n-изучите реквизиты;n-изучите табличные части;n-узнаете, какие бывают формы;n-узнаете, для чего нужны команды и макеты.nnНаучитесь:n-создавать печатные формы документов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "821a5800-dfe9-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f397302377b6b00170b20ac"
//   },
//   "group": "onec-3",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Табличные части",
//   "additional": "nНа лекции вы узнаете:n-что такое табличная часть и командная панель документа;n-о взаимодействии с реквизитами в ТЧ.nnНаучитесь:n-создавать и изменять командную панель и табличную часть документа;n-обращаться к ТЧ с клиента и сервера.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "a300e3e0-dfe9-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f397364377b6b00170b20ae"
//   },
//   "group": "onec-3",
//   "date": "2020-09-03",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Формы документов",
//   "additional": "nНа лекции вы узнаете виды форм документов:n-форма документа;n-форма списка;n-форма выбора.nnНаучитесь: n-создавать формы документа.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "ddba0070-dfe9-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3973a0377b6b00170b20af"
//   },
//   "group": "onec-3",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы (YZD)",
//   "additional": "nНа лекции вы узнаете про:n-виртуальные таблицы;n-структуру регистров;n-отличие регистров сведений и накоплений.nnНаучитесь:n-создавать отчеты СКД;n-формировать запросы к виртуальным таблицам.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "01440e00-dfea-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3973da377b6b00170b20b0"
//   },
//   "group": "onec-3",
//   "date": "2020-09-11",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Последовательность и журналы",
//   "additional": "nНа занятии вы узнаете о:n-последовательности;n-хронологии;n-примерах использования;n-журналах документов.nnНаучитесь:n-создавать журналы документов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "240af2a0-dfea-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f39741a377b6b00170b20b1"
//   },
//   "group": "onec-3",
//   "date": "2020-09-14",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Файлы",
//   "additional": "nНа вебинаре вы узнаете о (об):n-общих принципах работы с файлами;n-механизме временных файлов;n-принципе работы с интерактивным диалогом выбора файлов;n-передаче файлов с клиента на сервер и обратно.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "49f1dbf0-dfea-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f39745b377b6b00170b20b2"
//   },
//   "group": "onec-3",
//   "date": "2020-09-18",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Текстовые документы",
//   "additional": "nНа занятии вы узнаете о:n-текстовых документах;n-редакторе текста и модуля.nnНаучитесь:n-работать с текстовыми документами.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "708de470-dfea-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f39749e377b6b00170b20b3"
//   },
//   "group": "onec-3",
//   "date": "2020-09-21",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Двоичные данные",
//   "additional": "nНа лекции вы узнаете о:n-двоичных данных;n-хранилище значения;n-потоках.nnНаучитесь:n-работать с двоичными данными.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "98a653c0-dfea-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398de3377b6b00170b20bb"
//   },
//   "group": "ajs-9",
//   "date": "2020-08-18",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контейнеры",
//   "additional": "На лекции разберем:n- Setn- Mapn- WeakSet, WeakMap",
//   "id": "a8b11610-dff9-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398df9377b6b00170b20bc"
//   },
//   "group": "ajs-9",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "ArrayBuffer",
//   "additional": "На лекции вы узнаете о:n- типизированных массивахn- ArrayBuffern- DataViewn- «многопоточности» в JSn- SharedArrayBuffer",
//   "id": "b5515b00-dff9-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398e16377b6b00170b20bd"
//   },
//   "group": "aphp-2",
//   "date": "2020-08-18",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Понятие класса и объекта",
//   "additional": "На лекции вы узнаете о:n- процедурном и объектно-ориентированном программированииn- синтаксисе классовn- создании объектаnПознакомитесь с понятием свойств и методов, изучите конструкторы и деструкторы, статические свойства, методы и константы.nА также узнаете обn- автозагрузке классовn- пространстве именn- правилах оформления кода",
//   "id": "c7189830-dff9-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398ed4377b6b00170b20be"
//   },
//   "group": "aphp-2",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Наследование, полиморфизм и инкапсуляция",
//   "additional": "На лекции вы узнаете о:n- основах ООПn- инкапсуляцииn- модификаторах доступаn- наследовании и полиморфизмеn- абстракции и интерфейсах",
//   "id": "386f55a0-dffa-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398ee9377b6b00170b20bf"
//   },
//   "group": "bafe-11",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Путь frontend-разработчика",
//   "additional": "Вы узнаете о том, из чего состоит путь разработчика, какие есть перспективы. Приходите, будет увлекательно!",
//   "id": "44d6d750-dffa-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398f00377b6b00170b20c0"
//   },
//   "group": "bjs-13",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Асинхронность",
//   "additional": "На лекции будут раскрыты следующие темы: n1. Понятие асинхронностиn2. Асинхронные функции",
//   "id": "522620f0-dffa-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398f40377b6b00170b20c1"
//   },
//   "group": "bjs-14",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Расширенный синтаксис JavaScript",
//   "additional": "На лекции вы узнаете:n1. Современный стандарт, ""use strict""n2. Операторы разделителиn3. Типы данных null и undefinedn4. Управляющие конструкцииn5. Массивы, циклы",
//   "id": "7865d8a0-dffa-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398fc5377b6b00170b20c2"
//   },
//   "group": "bjs-14",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Типы данных",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Типы данныхn2. Примитивы и объекты. Данные по значению и по ссылкеn3. Обертки для примитивовn4. Методы типов данныхn5. Проверка и преобразование типов",
//   "id": "c79b8e60-dffa-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f398ff4377b6b00170b20c3"
//   },
//   "group": "mq-27",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Верстка резинового макета",
//   "additional": "Преподаватель расскажет вам, что из себя представляет резиновая верстка, затронет тему процентов как единиц измерения, а также особенности их применения в разных случаях. nТакже на этой лекции углубимся в технологию Флексбоксов. Разберёмся с основной и дополнительной осью, научимся выстраивать флекс-элементы в колонку одной строкой.nЖдём вас сегодня на открытии курса!",
//   "id": "e3a857a0-dffa-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f39900b377b6b00170b20c4"
//   },
//   "group": "mq-27",
//   "date": "2020-08-19",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Резиновые изображения",
//   "additional": "На этом занятии преподаватель познакомит вас с полезной функцией calc() для расчёта размеров. Вы рассмотрите понятие резиновых изображений и узнаете, в чём заключаются отличия в использовании контентных и фоновых изображений. 😉nТакже будут затронуты особенности применения протоколов mailto и tel в HTML-элементах и вопросы взаимодействия с дизайнером по размерам изображений для резиновой верстки. nЖдём вас на лекции!",
//   "id": "f1c837b0-dffa-11ea-803e-03955692976e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3a279c1858b40017767bec"
//   },
//   "group": "unknown",
//   "date": "2020-08-17",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "Мы узнаем, что из себя представляет дипломный проект и кто поможет нам в работе над ним. Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса. nБудем рады видеть вас онлайн!nn",
//   "id": "48c3e0a0-e055-11ea-be46-83793ba36883",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3a2e5c1858b40017767bef"
//   },
//   "group": "ios-3",
//   "date": "2020-08-17",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 3",
//   "additional": "Ждем вас онлайн.",
//   "id": "4eaeef60-e059-11ea-be46-83793ba36883",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3a2e921858b40017767bf0"
//   },
//   "group": "py-33",
//   "date": "2020-08-19",
//   "time": "19:00",
//   "teacher": "Елена Никитина",
//   "lecture": "Работа с разными форматами данных",
//   "additional": "Ждем вас онлайн.",
//   "id": "6e9b3cc0-e059-11ea-be46-83793ba36883",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3a2f211858b40017767bf1"
//   },
//   "group": "py-32",
//   "date": "2020-08-17",
//   "time": "19:30",
//   "teacher": "Евгений Шмаргунов",
//   "lecture": "Модули, пакеты, импорты в Python",
//   "additional": "Ждем вас онлайн.",
//   "id": "c3f6bd20-e059-11ea-be46-83793ba36883",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3a462f5158940017ccdba0"
//   },
//   "group": "unknown",
//   "date": "2020-08-16",
//   "time": "00:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "81cd9a50-e067-11ea-beb1-5fa2b448d125",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3acc965158940017ccdba1"
//   },
//   "group": "pb-16",
//   "date": "2020-08-18",
//   "time": "19:30",
//   "teacher": "Константин Полянский",
//   "lecture": "Ассоциативные массивы",
//   "additional": "nНа лекции мы узнаем о том:nn  - что такое ассоциативные массивы;n  - какие особенности есть у таких массивов;n  - как описать объекты реального мира в коде.nnnДополнительные материалыnГде и как можно поиграться с ассоциативными массивами:nСodewars, programming challengesnhttps://www.codewars.com/nОбъекты как ассоциативные массивы, learn javascriptnhttps://learn.javascript.ru/objectnКонсоль браузераnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Learn/JavaScript/Объекты/Основы nlearn javascriptnhttps://learn.javascript.ru/array ",
//   "id": "9e149f10-e0b7-11ea-beb1-5fa2b448d125",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3acd055158940017ccdba2"
//   },
//   "group": "pb-16",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Функция без параметров. Область видимости",
//   "additional": "nНа лекции мы узнаем:nn  - что такое подпрограммы;n  - к каким переменным есть доступ у функции;n  - как переопределить переменную из другой области видимости.nnдополнительные материалы:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Functionsnlearnjsnhttps://learn.javascript.ru/function-basics",
//   "id": "e082ffe0-e0b7-11ea-beb1-5fa2b448d125",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3b78b0decc910017d0a50f"
//   },
//   "group": "dj-12",
//   "date": "2020-08-18",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Обработка запросов",
//   "additional": "Ждем вас онлайн.",
//   "id": "32f22560-e11e-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3b78c7decc910017d0a510"
//   },
//   "group": "ios-7",
//   "date": "2020-08-18",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Коллекции: массив, словарь. Обход по коллекциям на примере for-in",
//   "additional": "Ждем вас онлайн.",
//   "id": "407f1440-e11e-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3b78e3decc910017d0a511"
//   },
//   "group": "ios-6",
//   "date": "2020-08-18",
//   "time": "19:00",
//   "teacher": "Алексей Рочев",
//   "lecture": "Как создавать свои ошибки",
//   "additional": "Ждем вас онлайн.",
//   "id": "51562510-e11e-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3c1571decc910017d0a512"
//   },
//   "group": "bgo-2",
//   "date": "2020-08-19",
//   "time": "19:00",
//   "teacher": "Владимир Сердюков",
//   "lecture": "Работа с сетью, HTTP 1.1, HTTP 2",
//   "additional": "nНа лекции вы:n-поговорите о сетевом взаимодействии;n-немного затронете протоколы ТСР/IС;n-начнете рассматривать НТТР.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "a18c60a0-e17b-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3c3ce4decc910017d0a515"
//   },
//   "group": "java qa-9",
//   "date": "2020-08-20",
//   "time": "20:00",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Testability, авто-тесты, введение в ООП: объекты и методы",
//   "additional": "Ждём всех онлайн!",
//   "id": "25052e00-e193-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3c3d0bdecc910017d0a516"
//   },
//   "group": "java qa-10",
//   "date": "2020-08-20",
//   "time": "20:00",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Testability, авто-тесты, введение в ООП: объекты и методы",
//   "additional": "Ждём всех онлайн!",
//   "id": "3c02ccc0-e193-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3c3d3bdecc910017d0a517"
//   },
//   "group": "java qa-10",
//   "date": "2020-08-24",
//   "time": "20:00",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Система сборки Maven, управление зависимостями, авто-тесты на JUnit5",
//   "additional": "Ждём всех онлайн!",
//   "id": "591d8390-e193-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3c3d65decc910017d0a518"
//   },
//   "group": "java qa-9",
//   "date": "2020-08-24",
//   "time": "20:00",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Система сборки Maven, управление зависимостями, авто-тесты на JUnit5",
//   "additional": "Ждём всех онлайн!",
//   "id": "71ae6c80-e193-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3c3d8fdecc910017d0a519"
//   },
//   "group": "java qa-9",
//   "date": "2020-08-28",
//   "time": "20:00",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Циклы, параметризованные тесты и     аннотации",
//   "additional": "Ждём всех онлайн!",
//   "id": "8b256fb0-e193-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3c3dc8decc910017d0a51a"
//   },
//   "group": "java qa-10",
//   "date": "2020-08-28",
//   "time": "20:00",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Циклы, параметризованные тесты и     аннотации",
//   "additional": "Ждём всех онлайн!",
//   "id": "ad0af500-e193-11ea-ba53-c913e44b76ba",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3ccec2a6e5590017051aa0"
//   },
//   "group": "dj-11",
//   "date": "2020-08-19",
//   "time": "19:00",
//   "teacher": "Оксана Махонина",
//   "lecture": "Консультация по дипломной работе Django",
//   "additional": "Ждем вас онлайн.",
//   "id": "16919d20-e1ea-11ea-aa68-11ea170c9037",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3e1df29bc18b0017924757"
//   },
//   "group": "py-33",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Андрей Семакин",
//   "lecture": "Работа с библиотекой requests, http запросы",
//   "additional": "Ждем вас онлайн.",
//   "id": "dfda35d0-e2b1-11ea-91bb-8552c921bd3c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3e1e089bc18b0017924758"
//   },
//   "group": "ios-7",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Кортеж и множество",
//   "additional": "Ждем вас онлайн.",
//   "id": "ed6a5900-e2b1-11ea-91bb-8552c921bd3c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3e1e189bc18b0017924759"
//   },
//   "group": "dj-12",
//   "date": "2020-08-20",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Динамическое формирование страниц на основе шаблонов",
//   "additional": "Ждем вас онлайн.",
//   "id": "f6ca6710-e2b1-11ea-91bb-8552c921bd3c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3e225e9bc18b001792475f"
//   },
//   "group": "py-32",
//   "date": "2020-08-20",
//   "time": "19:30",
//   "teacher": "Кирилл Табельский",
//   "lecture": "Итераторы, генераторы",
//   "additional": "Ждем вас онлайн.",
//   "id": "82b01570-e2b4-11ea-91bb-8552c921bd3c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3e25e79bc18b0017924760"
//   },
//   "group": "bgo-2",
//   "date": "2020-08-21",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Основы Go: типы данных, стандартные конструкции",
//   "additional": "nНа лекции вы узнаете:n-зачем нужен Golang;n-как работать с Golang;n-как компилируется и запускается приложение на Go;n-для чего нужны переменные и как их использовать;n-как использовать дебаггер (отладчик);n-ключевые типы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9e098250-e2b6-11ea-91bb-8552c921bd3c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3f8ffa03b4ac00174df396"
//   },
//   "group": "SD-14",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Ирина Хомутова",
//   "lecture": "Новое знакомство с компьютером",
//   "additional": "n",
//   "id": "6e8e9280-e38e-11ea-9d2e-93d850fd7638",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3f901603b4ac00174df397"
//   },
//   "group": "SD_14",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Ирина Хомутова",
//   "lecture": "Общаемся с компьютером",
//   "additional": "n",
//   "id": "7f1f99a0-e38e-11ea-9d2e-93d850fd7638",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3f903103b4ac00174df398"
//   },
//   "group": "SD_14",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Три кита веба: HTML, CSS, JS",
//   "additional": "n",
//   "id": "8f6d5630-e38e-11ea-9d2e-93d850fd7638",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3f904c03b4ac00174df399"
//   },
//   "group": "SD_14",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Интернет — большая библиотека",
//   "additional": "n",
//   "id": "9ef8d430-e38e-11ea-9d2e-93d850fd7638",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f3f905e03b4ac00174df39a"
//   },
//   "group": "SD_14",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Вся правда о профессии разработчика",
//   "additional": "n",
//   "id": "a9ceb960-e38e-11ea-9d2e-93d850fd7638",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f40930874af42001775872d"
//   },
//   "group": "ago-1",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Идентификация, аутентификация и авторизация",
//   "additional": "nНа лекции вы в общих чертах обсудите вопросы управления доступом. nВ рамках ДЗ выполните ряд лабораторных работ, которые позволят вам отработать навыки реализации систем на базе:n-IP;n-HTTP Basic;n-Login Form;n-JSON Body;n-Token.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "d6f2c2c0-e428-11ea-924d-1b3a3a5e0794",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f40932f74af42001775872e"
//   },
//   "group": "ago-1",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "Нереляционные базы данных — MongoDB",
//   "additional": "nНа занятии вы познакомитесь с альтернативным подходом для хранения данных, который бывает достаточно полезен как при прототипировании, так и в production решениях.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "ee04d3e0-e428-11ea-924d-1b3a3a5e0794",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bcd9ddefe9001726a56e"
//   },
//   "group": "ajs-9",
//   "date": "2020-08-25",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Promises, async/await, timers and event loop",
//   "additional": "На лекции вы узнаете о:n- длительных операцияхn- Event Loopn- Web Workersn- CallBack Helln- Promisesn- async/awaitn- тестировании асинхронного кода",
//   "id": "f0d33f30-e572-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bce9ddefe9001726a56f"
//   },
//   "group": "ajs-9",
//   "date": "2020-08-28",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Символы, итераторы, генераторы",
//   "additional": "На занятии вы узнаете:n- что такое символы и как их использоватьn- для чего нужны итераторыn- как реализовать свой итераторnА также познакомитесь с подпрограммами, тонкими материями генераторов.",
//   "id": "fa5d4370-e572-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bd0fddefe9001726a570"
//   },
//   "group": "aphp-2",
//   "date": "2020-08-25",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Примеси, перезагрузка и магия",
//   "additional": "На лекции вы познакомитесь с такими понятиями:n- трейтыn- магические свойства и методыn- сериализация объектовn- позднее статическое связываниеn- ковариантность и контравариантностьnУзнаете о реализации перезагрузки в php, наборах стандартных интерфейсов",
//   "id": "10d4e950-e573-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bd1eddefe9001726a571"
//   },
//   "group": "aphp-2",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Работа с базами данных",
//   "additional": "На лекции вы узнаете о:n- базах данных и их видахn- системах управления базами данныхn- SQL запросахn- PDO как универсальном способе работы с базами данныхnТакже будет проведен краткий обзор mysqli",
//   "id": "1a00ef10-e573-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bd62ddefe9001726a572"
//   },
//   "group": "bjs-14",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Функции, объекты в JavaScript",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Функцииn2. Аргументы и rest операторn3. Функциональные выраженияn4. Стрелочные функцииn5. Объекты и их свойства",
//   "id": "42472520-e573-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bd76ddefe9001726a573"
//   },
//   "group": "bjs-14",
//   "date": "2020-08-26",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Прототип и конструктор объекта",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Контекст выполненияn2. Конструктор объектаn3. Прототип объектаn4. Конструктор Objectn5. Конструктор Date и его методыn6. Методы объекта Math",
//   "id": "4e631ee0-e573-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42be7bddefe9001726a574"
//   },
//   "group": "bjs-13",
//   "date": "2020-08-24",
//   "time": "18:30",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "e99642c0-e573-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42be96ddefe9001726a575"
//   },
//   "group": "html-53",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Введение в HTML и CSS",
//   "additional": "На занятии преподаватель расскажет:n- что такое вёрстка и HTML;n- какие бывают теги;n- что такое CSS и для чего он нужен;n- как написать CSS-правило.",
//   "id": "f9b32b50-e573-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bea8ddefe9001726a576"
//   },
//   "group": "html-53",
//   "date": "2020-08-26",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контентные теги",
//   "additional": "На занятии преподаватель расскажет:n- какие есть теги для разметки контента на странице (заголовков, параграфов текста, картинок и т.д.);n- какие есть свойства у этих тегов;n- что такое селектор по идентификатору и селектор по классу и чем они отличаются.",
//   "id": "04ac01d0-e574-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bebdddefe9001726a577"
//   },
//   "group": "html-53",
//   "date": "2020-08-28",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "На занятии вы узнаете как правильно искать информацию на просторах интернета и пользоваться ей.",
//   "id": "1162dc00-e574-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bf0dddefe9001726a578"
//   },
//   "group": "mq-27",
//   "date": "2020-08-25",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Введение в медиазапросы",
//   "additional": "Следующий пункт нашего путешествия – освоение мобильной вёрстки. На занятии преподаватель расскажет вам о мобильной версии как подходе к верстке, плюсах и минусах этого подхода, разберёт медиазапросы для различных типов устройств и особенности их использования. nТакже будет уделено внимание специальному режиму эмуляции устройств в веб-инспекторе браузера для тестирования отображения сайта в различных условиях. И в дополнение к изученным ранее свойствам Flexbox будут ещё рассмотрено такое полезное свойство как flex-wrap, которое отвечает за перенос строк внутри флекс-контейнера. nЖдём вас на лекции!",
//   "id": "41040150-e574-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bf35ddefe9001726a579"
//   },
//   "group": "mq-27",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Медиафункции",
//   "additional": "На лекции преподаватель подробно расскажет о медиафункциях, позволяющих проверить различные характеристики устройства, на котором открыта страничка. Вы познакомитесь с относительной единицей измерения em, которая пригодится при создании адаптивного сайта. nЖдём вас на лекции! ",
//   "id": "58891f90-e574-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42bf49ddefe9001726a57a"
//   },
//   "group": "ra-24",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Компоненты",
//   "additional": "Вы познакомитесь с библиотекой React, компонентами и инструментарием. Также узнаете о компонентном и декларативном подходе, JSX и PropTypes.nЖдем вас на вебинаре.",
//   "id": "64a93800-e574-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42c00dddefe9001726a57b"
//   },
//   "group": "ahj-8",
//   "date": "2020-08-28",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Рабочее окружение",
//   "additional": "На занятии вы узнаете:n- про пакетные менеджеры: npm, yarn;n- про необходимые инструменты разработки;n- а также про тестирование, сборку и deployment.n",
//   "id": "d9a0c2e0-e574-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42cb5cddefe9001726a57d"
//   },
//   "group": "ios-3",
//   "date": "2020-08-24",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Разбор вопросов по курсовому заданию",
//   "additional": "Ждем вас онлайн.",
//   "id": "96d8a520-e57b-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42cc43ddefe9001726a57f"
//   },
//   "group": "ios-7",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Андрей Резанов",
//   "lecture": "Функции и области видимости",
//   "additional": "Ждем вас онлайн.",
//   "id": "20aaa0a0-e57c-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42cc8dddefe9001726a580"
//   },
//   "group": "dj-12",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Базы данных",
//   "additional": "Ждем вас онлайн.",
//   "id": "4c9f11a0-e57c-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f42cd84ddefe9001726a581"
//   },
//   "group": "py-34",
//   "date": "2020-08-24",
//   "time": "19:30",
//   "teacher": "Евгений Шмаргунов",
//   "lecture": "Python. Знакомство с консолью",
//   "additional": "Ждем вас онлайн.",
//   "id": "e04bc970-e57c-11ea-8930-591c6bfeaf62",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4356394c2ede0017c11356"
//   },
//   "group": "pb-17",
//   "date": "2020-08-24",
//   "time": "19:00",
//   "teacher": " Николай Лопин",
//   "lecture": "Базовые понятия. Переменные и числа",
//   "additional": "nДополнительные материалыnпочитать:nКак работает интернетnhttps://developer.mozilla.org/ru/docs/Learn/How_the_Internet_worksnВыражения и операторыnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Expressions_and_Operators#%D0%9E%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80%D1%8B_%D0%BF%D1%80%D0%B8%D1%81%D0%B2%D0%B0%D0%B8%D0%B2%D0%B0%D0%BD%D0%B8%D1%8FnВведение в javascriptnhttps://learn.javascript.ru/intronnпосмотреть:nЕще одна лекция о числах в javascriptnhttps://www.youtube.com/watch?v=aGTjRU7Dp20&list=PLo6puixMwuSNxJCgadaaavKqq4-ocKPrRnКак работает javascriptnhttps://www.youtube.com/watch?v=H6G63NKRSi8&feature=youtu.benhttps://www.youtube.com/watch?v=fXi49EkrMPI",
//   "id": "5bf8d800-e5ce-11ea-ac98-bf2596b16fb5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4356784c2ede0017c11357"
//   },
//   "group": "pb-17",
//   "date": "2020-08-28",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Логический тип и ветвление",
//   "additional": "nНа лекции мы узнаем:n  - как делать программы нелинейными — выполнять различный блок кода в зависимости от состояния программыn  - как удобно хранить информацию о признаках вида «да/нет»n  - что такое логические операции.nnnДополнительные материалы.nпочитать:nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Логические_операторыnhttps://learn.javascript.ru/logical-opsnhttps://learn.javascript.ru/comparisonnпосмотреть:nхороший обзор nhttps://www.youtube.com/watch?v=B4ZCFdrBmbEnеще один обзор с конкретными примерами, но уже на английскомnhttps://www.youtube.com/watch?v=2cGleL5FMZMnпараллельно даются несколько полезных советов для работы в консоле веб-разработчикаnhttps://www.youtube.com/watch?v=Gy87ZS5sb1w",
//   "id": "816a9150-e5ce-11ea-ac98-bf2596b16fb5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4356da4c2ede0017c11358"
//   },
//   "group": "pb-16",
//   "date": "2020-08-25",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Параметры и возвращаемое значение",
//   "additional": " nНа лекции мы узнаем:n  - как передать данные в функцию через аргументы;n  - как получить данные из функции;n  - сколько значений можно вернуть из функции.",
//   "id": "bb843990-e5ce-11ea-ac98-bf2596b16fb5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f44b8d3bc0c5a0017c633d4"
//   },
//   "group": "ios-4",
//   "date": "2020-08-25",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 1",
//   "additional": "Ждем вас онлайн.",
//   "id": "b77c6f10-e6a1-11ea-a07f-3baf70002fd5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f44b8ebbc0c5a0017c633d5"
//   },
//   "group": "py-34",
//   "date": "2020-08-25",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "Ждем вас онлайн.",
//   "id": "c5d86dc0-e6a1-11ea-a07f-3baf70002fd5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f44b986bc0c5a0017c633d8"
//   },
//   "group": "py-33",
//   "date": "2020-08-25",
//   "time": "20:00",
//   "teacher": "Артём Черняков",
//   "lecture": "Работа с классами на примере API VK",
//   "additional": "Ждем вас онлайн.n",
//   "id": "22a105d0-e6a2-11ea-a07f-3baf70002fd5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f44bfe4bc0c5a0017c633dd"
//   },
//   "group": "py-32",
//   "date": "2020-08-25",
//   "time": "19:30",
//   "teacher": "Кирилл Табельский",
//   "lecture": "Декораторы",
//   "additional": "Ждем вас онлайн.",
//   "id": "ee3f7570-e6a5-11ea-a07f-3baf70002fd5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f454d10b9fcbd00178abd32"
//   },
//   "group": "bgo-2",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Владимир Сердюков",
//   "lecture": "Основы Go: типы данных, стандартные конструкции",
//   "additional": "nНа лекции вы узнаете:n-зачем нужен Golang;n-как работать с Golang;n-как компилируется и запускается приложение на Go;n-для чего нужны переменные и как их использовать;n-как использовать дебаггер (отладчик);n-ключевые типы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "13406060-e6fa-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f454d57b9fcbd00178abd33"
//   },
//   "group": "bgo-2",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Владимир Сердюков",
//   "lecture": "Функции, приведение типов, пакеты и модули",
//   "additional": "nНа лекции вы:n-изучите, как работать с функциями;n-познакомитесь с системой приведения типов;n-поговорите о пакетах и модулях.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "3d31fc80-e6fa-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f454df9b9fcbd00178abd34"
//   },
//   "group": "bgo-2",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Владимир Сердюков",
//   "lecture": "Структуры, указатели, массивы, Slices, Maps",
//   "additional": "nНа лекции вы изучите:n-структуру и создание типов;n-указатели и вопросы передачи данных;n-массивы и Slice'ы (слайсы);n-Map'ы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9e0ff5c0-e6fa-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f454e4bb9fcbd00178abd35"
//   },
//   "group": "bgo-2",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Методы и автотесты",
//   "additional": "nНа лекции вы:n-узнаете о том, как структурировать наши приложения на Go: мы можем использовать методы и типы для организации семантической связи;n-посмотрите, как писать автотесты;n-поговорите о системах CI/CD.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "cec23cf0-e6fa-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f454e79b9fcbd00178abd36"
//   },
//   "group": "bgo-2",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Обработка ошибок",
//   "additional": "nНа лекции вы:n-рассмотрите ключевой вопрос профессиональной разработки — работу с ошибками;n-познакомитесь с интерфейсами — краеугольным камнем всего последующего обучения;n-разберётесь в вызовах методов и в наборах методов;n-научитесь определять наборы методов для Т, *Т и для интерфейсов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "ea578c40-e6fa-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f454eb4b9fcbd00178abd37"
//   },
//   "group": "bgo-2",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "Горутины",
//   "additional": "nНа лекции Вы обсудите теоретические основы concurrency (конкурентность) – одной из важных тем в сетевой разработкеnnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "0d84fae0-e6fb-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f454effb9fcbd00178abd38"
//   },
//   "group": "bgo-2",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Пакет sync и каналы",
//   "additional": "nНа лекции вы  продолжите рассматривать concurrency, изучите базовые моменты:n-работы с Shared Memory;n-координации выполнения с помощью Channel и Context.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "3a25d880-e6fb-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f454f91b9fcbd00178abd39"
//   },
//   "group": "bgo-2",
//   "date": "2020-09-28",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Работа с файлами",
//   "additional": "nНа лекции вы:n-познакомитесь с вводом-выводом (io);n-изучите "стандартный" механизм для работы с записью файлов, включая правильное закрытие и обработку ошибок.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "91260830-e6fb-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4551beb9fcbd00178abd3a"
//   },
//   "group": "bgo-2",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Разбор задач",
//   "additional": "nНа лекции вы разберёте задачи, вызвавшие у вас трудностиnnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "dced55b0-e6fc-11ea-b68c-df289ae87082",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4748ecf9eed600178f1727"
//   },
//   "group": "dj-12",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Базы данных",
//   "additional": "Ждем вас онлайн.",
//   "id": "c82ab780-e828-11ea-800c-8d970fd5ced7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f474901f9eed600178f1728"
//   },
//   "group": "py-34",
//   "date": "2020-08-27",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Условные конструкции. Операции сравнения",
//   "additional": "Ждем вас онлайн.",
//   "id": "d4aee8f0-e828-11ea-800c-8d970fd5ced7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f47575cf9eed600178f1729"
//   },
//   "group": "bjs-14",
//   "date": "2020-08-28",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Прототип и конструктор объекта",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Контекст выполненияn2. Конструктор объектаn3. Прототип объектаn4. Конструктор Objectn5. Конструктор Date и его методыn6. Методы объекта Math",
//   "id": "638232a0-e831-11ea-800c-8d970fd5ced7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f47578ef9eed600178f172a"
//   },
//   "group": "lrv-1",
//   "date": "2020-08-28",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Работа с базой данных",
//   "additional": ".",
//   "id": "81350ac0-e831-11ea-800c-8d970fd5ced7",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f48afe5b51a5800174b2015"
//   },
//   "group": "py-32",
//   "date": "2020-08-28",
//   "time": "19:30",
//   "teacher": "Евгений Шмаргунов",
//   "lecture": "Разработка тестов",
//   "additional": "Ждем вас онлайн.n",
//   "id": "bf39b9b0-e8fe-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f494294b51a5800174b2017"
//   },
//   "group": "onec-5",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Введение в платформу",
//   "additional": "nНа вебинаре вы узнаете о:n-том, что такое «платформа» и для чего она создавалась;n-предметно-ориентированном «Встроенном языке»;n-фирме «1С» и истории платформы;n-прикладных решениях;n-среде исполнения;n-лицензии и учебной версии;n-среде разработки;n-а также об информационной базе и конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "2d96fab0-e956-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4942bab51a5800174b2018"
//   },
//   "group": "onec-5",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Среда разработки и конфигурация",
//   "additional": "nНа лекции вы узнаете:n-что такое конфигуратор для чего его используют;n-конфигурации, модулях и основных свойствах конфигурации; n-видах и обновлениях конфигурации.nnНаучитесь:n-сравнивать и объединять;n-обновлять и проверять конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "443f7490-e956-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f49436fb51a5800174b2019"
//   },
//   "group": "onec-5",
//   "date": "2020-09-07",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Дерево метаданных",
//   "additional": "nНа занятии вы узнаете:n-что такое дерево метаданных и объект метаданных;n-какими бывают общие метаданные;n-зачем нужны подсистемы, картинки, элементы стиля, функциональные опции, -константы, справочники и перечисления.nnК тому же вы научитесь:n-создавать функциональные опции и константы;n-создавать перечисления;n-создавать справочники.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "afc60170-e956-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4943aab51a5800174b201a"
//   },
//   "group": "onec-5",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виды клиентов и режимы работы",
//   "additional": "nНа занятии вы узнаете:n-что такое обычное и управляемое приложение;n-что такое управляемые формы;n-чем отличаются тонкий клиент, толстый клиент, веб-клиент и мобильный клиент.nnА так же научитесь:n-делать простейшие управляемые формы;n-публиковать веб-клиент.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "d349f480-e956-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4943fbb51a5800174b201b"
//   },
//   "group": "onec-5",
//   "date": "2020-09-15",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Пользователи и отладка",
//   "additional": "nНа занятии вы узнаете:n-что такое пользователи ИБ и их роли;n-что такое журнал регистрации;n-что такое отладка и точка останова;n-что такое система взаимодействия.nnТакже научитесь:n-создавать пользователей ИБ, роли и назначать их пользователям;n-искать ошибки в журнале регистрации;n-использовать отладчик для расследования ошибок;n-подключать систему взаимодействия.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "032a45b0-e957-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f49441bb51a5800174b201c"
//   },
//   "group": "onec-5",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Внешние отчеты, обработки и расширения",
//   "additional": "nНа занятии вы узнаете:n-что такое внешние отчеты и обработки, и в чем разница между ними;n-что такое расширения конфигурации.nnНаучитесь:n-создавать простейшие внешние отчеты, обработки и расширения.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "162065f0-e957-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f49446bb51a5800174b201d"
//   },
//   "group": "onec-5",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "nНа лекции вы узнаете об основных принципах, технологиях поиска необходимой информации, выборе источника.nnЛекция — общеобразовательная. Домашнего задания по ней не будет)n nЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "464bc9e0-e957-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f494e35b51a5800174b201f"
//   },
//   "group": "onec-5",
//   "date": "2020-09-24",
//   "time": "19:30",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Переменные",
//   "additional": "nНа вебинаре вы узнаете:n-что такое переменная и параметр сеанса;n-каковы формальные требования к именам переменных;n-как лучше называть их.nnНаучитесь:n-объявлять и инициализировать переменные;n-создавать и устанавливать параметры сеанса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "1bf5b7e0-e95d-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f494e9ab51a5800174b2020"
//   },
//   "group": "onec-5",
//   "date": "2020-09-28",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Типы данных",
//   "additional": "nНа занятии вы узнаете:n-что такое примитивные и ссылочные типы;n-какими бывают примитивные типы;n-что такое уникальный идентификатор и чем ссылка отличается от объекта.nnК тому же вы научитесь:n-выполнять операции с примитивными типами;n-получать объект по ссылке.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "5827dfe0-e95d-11ea-b4bb-a5bac5beb9b3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbacbf6f16c0017609cfb"
//   },
//   "group": "ajs-9",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "TypeScript",
//   "additional": "На занятии вы познакомитесь с:n- TypeScriptn- рабочим окружениемn- типизациейn- интерфейсамиn- классами.",
//   "id": "017053d0-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbae3f6f16c0017609cfc"
//   },
//   "group": "aphp-2",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Тестирование, php-unit",
//   "additional": "На лекции вы узнаете:n- что такое тестированиеn- что первее: тесты или кодnПознакомитесь с автоматизированным тестированием, PHPUnit, Mock- и Stub-объектами.nИзучите покрытие кода тестами, шаблоны проектирования и тестирования",
//   "id": "100cddf0-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbb08f6f16c0017609cfd"
//   },
//   "group": "bjs-14",
//   "date": "2020-08-31",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "ООП в JS (ES6)",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Классыn2. Свойстваn3. Конструктор, методы, статические методыn4. Наследование и supern5. Нововведения последних версий ES",
//   "id": "25b96ba0-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f4bbb6cf6f16c0017609cfe"
//   },
//   "group": "bjs-14",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Обработка исключений и замыкания",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Внутренние исключений выполненияn2. Создание собственных исключенийn3. Перехват исключенийn4. Консольные методы для удобной работыn5. Области видимостиn6. Замыканияn7. Конструкция delete",
//   "id": "61de9b50-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbb88f6f16c0017609cff"
//   },
//   "group": "html-53",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для вёрстки структуры контента",
//   "additional": "На занятии лектор расскажет:n- про группировку элементов на странице;n- как правильно задавать имена для классов;n- про теги, которые отвечают за структуру страницы;n- чем отличаются блочные и строчные элементы, и как их центрировать на странице.",
//   "id": "722f8c30-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbba6f6f16c0017609d00"
//   },
//   "group": "html-53",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование блочных элементов",
//   "additional": "На занятии Семён Бойко расскажет:n- про flex-контейнеры и их особенности;n- про элементы nav, header и footer;n- про схлопывание отступов.",
//   "id": "844892e0-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbbe9f6f16c0017609d01"
//   },
//   "group": "mq-27",
//   "date": "2020-08-31",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Особенности вёрстки для мобильных устройств",
//   "additional": "На этом занятии преподаватель поведает о нюансах разработки для гаджетов от Apple на базе операционной системы iOS, а также для устройств, имеющих экраны с повышенной плотностью пикселей. Кроме того, будет затронута тема иконочных шрифтов и SVG (векторной) графики. nА в заключение вас ждут ещё несколько удобных свойств Flexbox:n- justify-content (определяет, как браузер распределяет пространство вокруг флекс-элементов вдоль главной оси контейнера);n- align-items (выравнивает флекс-элементы внутри контейнера в перпендикулярном направлении);n-️ align-self (выравнивает флекс-элементы текущей строки, переписывая значение align-items).nЖдём вас на занятии! ",
//   "id": "ac085ae0-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f4bbc18f6f16c0017609d02"
//   },
//   "group": "mq-27",
//   "date": "2020-09-02",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Вёрстка адаптивного макета",
//   "additional": "На занятии преподаватель разъяснит плюсы и минусы адаптивной верстки, расскажет об использовании логических операторов в медиа-запросах и поговорит о способах адаптации фоновых изображений. Также узнаем как выравнивать блочные элементы по центру по горизонтали универсальным способом.nЖдём вас на занятии!",
//   "id": "c86c92f0-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbc2df6f16c0017609d03"
//   },
//   "group": "ra-24",
//   "date": "2020-09-02",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "События и состояния",
//   "additional": "Преподаватель расскажет об обработчике событий, различных состояниях компонентов и о передаче состояния.nЖдем вас на вебинаре.",
//   "id": "d47f3de0-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbc5bf6f16c0017609d04"
//   },
//   "group": "ra-24",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Props",
//   "additional": "На лекции вы познакомитесь с Props, узнаете об атрибутах без значений, условном рендеринге, списках элементов и атрибуте «key». И это неполный список :)nПриходите, будет интересно!",
//   "id": "f0266780-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbc74f6f16c0017609d05"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Работа с DOM (объектная модель документа)",
//   "additional": "На занятии вы узнаете:n- про browser environment;n- про обработку документа;n- что такое интерфейсы и базовые селекторы;n- а также про атрибуты.",
//   "id": "fed456c0-eacf-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4bbc9df6f16c0017609d06"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Обработка событий",
//   "additional": "На занятии вы узнаете:n- все про события;n- про метод prevent default;n- а также разницу между фазами Capturing и Bubbling.",
//   "id": "172ca380-ead0-11ea-b9f0-6ffed4ab72a1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4de50d97656e00170d645d"
//   },
//   "group": "ios-8",
//   "date": "2020-09-01",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Среда разработки и основные понятия",
//   "additional": "Ждем вас онлайн.",
//   "id": "5ed7f410-ec19-11ea-913d-0b281568d2d5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4de52c97656e00170d645e"
//   },
//   "group": "dj-12",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Взаимодействие с сайтом",
//   "additional": "Ждем вас онлайн.",
//   "id": "70e42980-ec19-11ea-913d-0b281568d2d5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4de54297656e00170d645f"
//   },
//   "group": "py-34",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Введение в типы данных и циклы",
//   "additional": "Ждем вас онлайн.",
//   "id": "7e0bedf0-ec19-11ea-913d-0b281568d2d5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4de6a097656e00170d6462"
//   },
//   "group": "ago-1",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "Кэширование данных — Redis",
//   "additional": "nНа лекции вы познакомитесь с Redis с точки зрения использования его для кэширования данных. Кэши очень важны в высоконагруженных приложениях.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "4e9872e0-ec1a-11ea-913d-0b281568d2d5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4dea4497656e00170d6463"
//   },
//   "group": "pb-17",
//   "date": "2020-09-01",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Строки. Алгоритмы. Как отлаживать код",
//   "additional": "nНа лекции мы узнаем:n  - как работают строки в JS;n  - что такое алгоритмы и как их сравнивать;n  - какие существуют приемы отладки кода;n  - как читать ошибки интерпретатора.nnДополнительные материалыnпочитать:nклассическая документация от MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Stringnразбор от Ильи Кантораnhttps://learn.javascript.ru/stringnnпосмотреть:n20 методов, которые помогут вам жонглировать строками в JS, как настоящий PROnhttps://www.youtube.com/watch?v=VRz0nbax0uInхороший обзор (на английском)nhttps://www.youtube.com/watch?v=DljZQyNwdOgnпро типы ошибок в JS и то как с ними боротьсяnhttps://stepik.org/lesson/99598/step/1?unit=75361nувлекательнейшая лекция по алгоритмам (в рамках легендарного курса CS50 от Harvard University)nhttps://www.youtube.com/watch?v=U9o49qwa6hknкурс от Computer Science Center на stepiknhttps://stepik.org/course/217/nеще немного про алгоритмы (How Binary Search Works)nhttps://www.youtube.com/watch?v=JQhciTuD3E8",
//   "id": "7a70be70-ec1c-11ea-913d-0b281568d2d5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4deabb97656e00170d6464"
//   },
//   "group": "pb-17",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Массивы и базовые методы работы с ними",
//   "additional": " nНа лекции мы узнаем:n  - что такое массивы.n  - для чего используются массивыn  - какие методы мы можем применять для работы с массивамиnnnДополнительные материалы.nпочитать:nпо традиции - документация на MDN.nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array nопять же, по традиции learn.javascriptnhttps://learn.javascript.ru/array nnпосмотреть:nотличный обзор того, что мы сегодня обсудили (и даже больше) от Sorax.nhttps://www.youtube.com/watch?v=3OjuRfR8RNg nхороший обзор на английском.nhttps://www.youtube.com/watch?v=orAS-MBh5f4 ",
//   "id": "c18a09b0-ec1c-11ea-913d-0b281568d2d5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4f3f2d6b92b700174557b1"
//   },
//   "group": "ios-4",
//   "date": "2020-09-02",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "ad14bf40-ece7-11ea-88b0-6b4930250295",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4f945c6b92b700174557b2"
//   },
//   "group": "ios-4",
//   "date": "2020-09-02",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "736b0eb0-ed1a-11ea-88b0-6b4930250295",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f4ff0e06b92b700174557b3"
//   },
//   "group": "java QA-8",
//   "date": "2020-09-03",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Основы автоматизации",
//   "additional": "Ждём всех онлайн!",
//   "id": "98107250-ed51-11ea-88b0-6b4930250295",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5087789f406d001741e627"
//   },
//   "group": "devops-2",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Операционные системы (лекция 1)",
//   "additional": "nНа занятии вы:n-ознакомитесь с краткой историей развития Unix и POSIX систем;n-рассмотрите основные функции ОС в целом и затронули каждую из них на примере Linux;n-познакомитесь с инструментами отладки: strace для системных вызовов, sotruss для библиотечных, eBPF на примере набора утилит BCC;n-узнаете, как создаются и завершаются процессы;n-узнаете о состояниях процессов;n-узнаете, как можно отправить процессам сигналы;n-рассмотрите некоторые утилиты для оценки ресурсов системы;n-познакомитесь с systemd;n-затроните неймспейсы ядра на примере ns PID.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "5a6fac40-edab-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5087d19f406d001741e628"
//   },
//   "group": "devops-2",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Операционные системы (лекция 2)",
//   "additional": "nНа занятии вы:n-ознакомитесь с краткой историей развития Unix и POSIX систем;n-рассмотрите основные функции ОС в целом и затронули каждую из них на примере Linux;n-познакомитесь с инструментами отладки: strace для системных вызовов, sotruss для библиотечных, eBPF на примере набора утилит BCC;n-узнаете, как создаются и завершаются процессы;n-узнаете о состояниях процессов;n-узнаете, как можно отправить процессам сигналы;n-рассмотрите некоторые утилиты для оценки ресурсов системы;n-познакомитесь с systemd;n-затроните неймспейсы ядра на примере ns PID.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "90063d60-edab-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5094589f406d001741e62a"
//   },
//   "group": "ios-8",
//   "date": "2020-09-03",
//   "time": "18:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Знакомство со Swift в Playground. Переменные и константы. Числовые и строковые типы",
//   "additional": "Ждем вас онлайн.",
//   "id": "077f65e0-edb3-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5094779f406d001741e62b"
//   },
//   "group": "dj-12",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Персонализация сайта",
//   "additional": "Ждём вас онлайн.",
//   "id": "19e2bc00-edb3-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5094959f406d001741e62c"
//   },
//   "group": "py-34",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Елена Никитина",
//   "lecture": "Коллекции данных. Словари. Множества",
//   "additional": "Ждем вас онлайн.",
//   "id": "2b8ed010-edb3-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5094c99f406d001741e62d"
//   },
//   "group": "ios-7",
//   "date": "2020-09-03",
//   "time": "19:00",
//   "teacher": "Максим Абакумов",
//   "lecture": "Объекты в ООП",
//   "additional": "Ждём вас онлайн.",
//   "id": "4aaf41f0-edb3-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f512c869f406d001741e630"
//   },
//   "group": "iqa-12",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Введение в тестирование ПО. Методы и виды тестирования",
//   "additional": "Ждём всех онлайн!",
//   "id": "bc344870-ee0d-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f512cd39f406d001741e631"
//   },
//   "group": "iqa-12",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Тестирование ПО. Многообразие тестирования",
//   "additional": "Ждём всех онлайн!",
//   "id": "e9a76a30-ee0d-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f512fa19f406d001741e633"
//   },
//   "group": "java qa-11",
//   "date": "2020-09-11",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Программирование на Java: переменные, операторы, работа с отладчиком",
//   "additional": "Ждём всех онлайн!",
//   "id": "9610e070-ee0f-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5130139f406d001741e634"
//   },
//   "group": "java qa-9",
//   "date": "2020-09-04",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Разбор задач",
//   "additional": "Ждём всех онлайн!",
//   "id": "d9a9de90-ee0f-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5131709f406d001741e635"
//   },
//   "group": "java qa-10",
//   "date": "2020-09-04",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Разбор задач",
//   "additional": "Ждём всех онлайн!",
//   "id": "aa1260c0-ee10-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f51339b9f406d001741e637"
//   },
//   "group": "java qa-9",
//   "date": "2020-09-08",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Объектно-ориентированное      программирование и проектирование",
//   "additional": "Ждём всех онлайн!",
//   "id": "f4d02d80-ee11-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5139819f406d001741e638"
//   },
//   "group": "aqa-8",
//   "date": "2020-09-07",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Управление состоянием, Continuous Integration",
//   "additional": "Ждём всех онлайн!",
//   "id": "78fc0e50-ee15-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f513d219f406d001741e639"
//   },
//   "group": "aqa-8",
//   "date": "2020-09-10",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Тестирование веб-интерфейсов, Selenium и      Selenide",
//   "additional": "Ждём всех онлайн!",
//   "id": "a21fc130-ee17-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f513d929f406d001741e63a"
//   },
//   "group": "ibb-2",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Роман Жуков",
//   "lecture": "Информация с ограниченным доступом (государственная и коммерческая тайны)",
//   "additional": "Ждём всех онлайн!",
//   "id": "e5520e40-ee17-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f513e4c9f406d001741e63b"
//   },
//   "group": "ibb-2",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Александр Сухарев",
//   "lecture": "Информация с ограниченным доступом (персональные данные и другие виды тайн)",
//   "additional": "Ждём всех онлайн!",
//   "id": "53f2d370-ee18-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f513ed19f406d001741e63c"
//   },
//   "group": "1-ibnet",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Иван Чупров",
//   "lecture": "Виртуальные машины, работа в командной строке, Linux, Windows",
//   "additional": "Ждём всех онлайн!",
//   "id": "a30d6010-ee18-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5143159f406d001741e63f"
//   },
//   "group": "java qa-10",
//   "date": "2020-09-08",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Объектно-ориентированное      программирование и проектирование",
//   "additional": "Ждём всех онлайн!",
//   "id": "2e19c570-ee1b-11ea-8a7b-61aafca700d4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f51d3d9a9786b0017727e00"
//   },
//   "group": "py-32",
//   "date": "2020-09-04",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Веб-скрапинг",
//   "additional": "Ждем вас онлайн.",
//   "id": "77ae7ae0-ee71-11ea-8c65-7728d09d2953",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5211cfa9786b0017727e02"
//   },
//   "group": "WM_59",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Вводная лекция",
//   "additional": "n",
//   "id": "663e1070-ee96-11ea-8c65-7728d09d2953",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5211f0a9786b0017727e03"
//   },
//   "group": "WM_59",
//   "date": "2020-09-09",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для разметки текста и аттрибуты",
//   "additional": "n",
//   "id": "7a14a5a0-ee96-11ea-8c65-7728d09d2953",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f521206a9786b0017727e04"
//   },
//   "group": "WM_59",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Семен Бойко",
//   "lecture": "Списки и таблицы",
//   "additional": "n",
//   "id": "86f7bff0-ee96-11ea-8c65-7728d09d2953",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f52121da9786b0017727e05"
//   },
//   "group": "WM_59",
//   "date": "2020-09-18",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Селекторы и свойства",
//   "additional": "n",
//   "id": "94e62fc0-ee96-11ea-8c65-7728d09d2953",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f521230a9786b0017727e06"
//   },
//   "group": "WM_59",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Оформление текстовых блоков с использованием CSS",
//   "additional": "n",
//   "id": "a03d04c0-ee96-11ea-8c65-7728d09d2953",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f521245a9786b0017727e07"
//   },
//   "group": "WM_59",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "n",
//   "id": "ac88c110-ee96-11ea-8c65-7728d09d2953",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f53c47308c52700174ec776"
//   },
//   "group": "my_for_test",
//   "date": "2020-09-06",
//   "time": "19:00",
//   "teacher": "Михаил Триполитов",
//   "lecture": "Циклические конструкции",
//   "additional": "nНа лекции вы:n-узнаете, что такое циклы и какие есть виды циклов;n-разберёте, как записывать цикл while, do..while и for;n-научитесь пользоваться операторами break и continue для управления циклом;n-узнаете, что циклы могут быть вложенными.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "7715bed0-ef99-11ea-8e63-950c5d897d1c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f53c4bd08c52700174ec777"
//   },
//   "group": "my_for_test",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Массивы. Сортировка",
//   "additional": " nНа занятии вы:n-узнаете, что такое константы;n-научитесь объявлять перечисления;n-узнаете, как создавать массивы и работать с ними;n-узнаете, как создавать двумерные массивы и работать с ними;n-разберёте алгоритм сортировки пузырьком.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "a353e300-ef99-11ea-8e63-950c5d897d1c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f089b6bb70001758fa8b"
//   },
//   "group": "ajs-9",
//   "date": "2020-09-07",
//   "time": "18:30",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "546753e0-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f0a4b6bb70001758fa8c"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Организация тестирования (Unit, E2E)",
//   "additional": "На занятии вы узнаете:n- про пирамиду тестирования;n- что такое unit- и E2E-тестирование;n- про компоненты;n- а также JSDOM.",
//   "id": "64cabb50-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f0bfb6bb70001758fa8d"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На занятии вы узнаете:n- что такое валидация;n- про Position & Metrics;n- про кэширование данных в LocalStorage;n- а также про события Input и Change.",
//   "id": "74eb4d60-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f0d5b6bb70001758fa8e"
//   },
//   "group": "ra-24",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Формы",
//   "additional": "На лекции вы узнаете о формах, контролируемых и неконтролируемых компонентах. Познакомитесь с Lifting State Up и Lifting State Down.nЖдем вас на вебинаре!",
//   "id": "8193cfb0-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f0ebb6bb70001758fa8f"
//   },
//   "group": "ra-24",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Елена Семенова",
//   "lecture": "Композиция компонентов",
//   "additional": "На лекции преподаватель расскажет вам о подходах к композиции компонентов, передаче компонентов в атрибуты. Вы узнаете о вложенных компонентах - Children Components и о других интересных элементах.nПриходите на лекцию, ждем вас онлайн.",
//   "id": "8eb15af0-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f0fcb6bb70001758fa90"
//   },
//   "group": "mq-27",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивная типографика",
//   "additional": "На занятии преподаватель расскажет вам о таких полезных медиафункциях как orientation (ориентация области просмотра) и aspect-ratio (соотношение ширины к высоте области просмотра), а также об относительной единице измерения rem.nКроме того, будут разобраны следующие особенности HTML-элементов:n- type email;n- type tel;n- type search;nИ в завершение лекции будет рассмотрен пример улучшения формы с использованием type="email" / type="search" / type="tel" и деградацией до type="text" в старых браузерах. nНе пропустите, занятие будет интересным! ",
//   "id": "994a1010-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f125b6bb70001758fa91"
//   },
//   "group": "mq-27",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Breakpoints",
//   "additional": "На лекции преподаватель расскажет о так называемых контрольных точках в CSS - Breakpoints и критериях их выбора, разберет подход к версте «mobile first» и поговорит о единицах измерениях vh, vw, vmin, vmax.nКроме того, вы узнаете об атрибуте srcset у тега img и увидите пример загрузки изображений через атрибут srcset и фоллбека в виде src. А напоследок мы немного побеседуем на тему подготовки графики для различных устройств.nЖдём вас на занятии! ",
//   "id": "b16776b0-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f135b6bb70001758fa92"
//   },
//   "group": "lrv-2",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Фреймворки в PHP: Laravel",
//   "additional": "На лекции вы узнаете:n- что такое фреймворкn- серверные требования Laraveln- как устанавливать Laraveln- о структуре приложения.nТакже ознакомитесь с популярными фреймворками, узнаете о плагине Laravel для PhpStorm, помощнике Artisan.",
//   "id": "bb556ce0-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f14eb6bb70001758fa93"
//   },
//   "group": "lrv-2",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Основы Laravel",
//   "additional": "На занятии вы узнаете о:n- конфигурацииn- жизненном цикле запросаn- связывании и тегированииn- сервис-контейнерах и контроллерахn- фасадахn- контрактахnТакже вы познакомитесь с понятием внедрения зависимостей.",
//   "id": "c9d74310-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f179b6bb70001758fa94"
//   },
//   "group": "html-53",
//   "date": "2020-09-07",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Вёрстка форм",
//   "additional": "Вы узнаете:n- для чего используются формы и какие поля у них есть;n- как задать минимальную и максимальную высоту/ширину элемента;n- как сделать эффекты при наведении на элемент.",
//   "id": "e351efc0-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f194b6bb70001758fa95"
//   },
//   "group": "html-53",
//   "date": "2020-09-10",
//   "time": "18:00",
//   "teacher": "Александр Фитискин",
//   "lecture": "Нестандартные элементы форм",
//   "additional": "На занятии лектор расскажет:n- что такое строчно-блочные элементы и какие у них есть особенности;n- как можно стилизовать фон элементов;n- что такое соседний и родственный селектор и для чего они используются;n- про абсолютное позиционирование элементов;n- про псевдоэлементы ::before и ::after.",
//   "id": "f390b830-f04c-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f1afb6bb70001758fa96"
//   },
//   "group": "bjs-14",
//   "date": "2020-09-08",
//   "time": "18:00",
//   "teacher": "Евгений Шек",
//   "lecture": "Прототип массива, функции высшего порядка",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Константы и массивыn2. Поиск в массивеn3. Функции высшего порядкаn4. Расширенный поиск в массивеn5. Преобразование массива",
//   "id": "03c54770-f04d-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f1d2b6bb70001758fa97"
//   },
//   "group": "bjs-14",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Асинхронность",
//   "additional": "На лекции будут раскрыты следующие темы: n1. Понятие асинхронностиn2. Асинхронные функции",
//   "id": "18826c10-f04d-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f1e2b6bb70001758fa98"
//   },
//   "group": "bhj-13",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Возможности JavaScript в браузере",
//   "additional": "На этом занятии вы познакомитесь с:n1. Принципом построения DOM в браузереn2. С объектами HTML-теговn3. BOM. Объект WindownЖдём вас на вебинаре!",
//   "id": "22673a80-f04d-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f1fdb6bb70001758fa99"
//   },
//   "group": "ajs-10",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Стандарты и рабочее окружение",
//   "additional": "На занятии вы узнаете о:n- редакциях и их стандартахn- рабочем окруженииnУзнаете, что собой представляют npm, live-server, Babel и ESLint.",
//   "id": "3293da80-f04d-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f54f432b6bb70001758fa9a"
//   },
//   "group": "ajs-10",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Модули",
//   "additional": "На занятии вы узнаете:n- зачем нужны ES-модули;n- что такое модулиnПознакомитесь с CommonJS, Webpack и его функциональным файлом.",
//   "id": "833e6080-f04e-11ea-b0b3-1f7a5f4b1486",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55d581a060c900175c8c4f"
//   },
//   "group": "java qa-11",
//   "date": "2020-09-07",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Введение в Java: JDK, JRE, JVM, IntelliJ IDEA",
//   "additional": "Ждём всех онлайн!",
//   "id": "ce80c520-f0d4-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55d753a060c900175c8c51"
//   },
//   "group": "ago-1",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "Кэширование данных — использование из Go",
//   "additional": "nНа занятии вы:n- познакомитесь с использованием серверного кэширования. nnУзнаете:n-как о преимуществах, так и проблемах, связанных с использованием кэшов;n-что кэширование может быть организовано не только на сервере, но и на клиенте (т.е. для конкретного клиента).nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "e43af1f0-f0d5-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55dc18a060c900175c8c52"
//   },
//   "group": "pb-17",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Циклы",
//   "additional": "nНа лекции мы узнаем:nn  - что такое циклы и для чего они нужны;n  - как правильно писать циклы;n  - как работать с циклами и массивами.nnnДополнительные материалы:nЗдесь можно поизучать циклы самостоятельноnСodewars, programming challengesnhttps://www.codewars.com/nЦиклы while, for, learn.javascript.runhttps://learn.javascript.ru/while-fornМассивы: методы, learn.javascript.runhttps://learn.javascript.ru/array-methodsnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Циклы_и_итерацииnlearn javascriptnhttps://learn.javascript.ru/while-fornnпосмотреть:nобзор циклов от Soraxnhttps://www.youtube.com/watch?v=ITr-SzUIDpQnхороший обзор на английскомnhttps://www.youtube.com/watch?v=orAS-MBh5f4",
//   "id": "bbe412b0-f0d8-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55dc69a060c900175c8c53"
//   },
//   "group": "pb-17",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Ассоциативные массивы",
//   "additional": "nНа лекции мы узнаем о том:nn  - что такое ассоциативные массивы;n  - какие особенности есть у таких массивов;n  - как описать объекты реального мира в коде.nnnДополнительные материалыnГде и как можно поиграться с ассоциативными массивами:nСodewars, programming challengesnhttps://www.codewars.com/nОбъекты как ассоциативные массивы, learn javascriptnhttps://learn.javascript.ru/objectnКонсоль браузераnnпочитать:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Learn/JavaScript/Объекты/Основы nlearn javascriptnhttps://learn.javascript.ru/array ",
//   "id": "ec52c130-f0d8-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55ded9a060c900175c8c55"
//   },
//   "group": "dj-12",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Создание и поддержка проекта",
//   "additional": "Ждем вас онлайн.",
//   "id": "601cd320-f0da-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55df40a060c900175c8c56"
//   },
//   "group": "ios-8",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "Ждем вас онлайн.",
//   "id": "9d92c5c0-f0da-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55dfb4a060c900175c8c57"
//   },
//   "group": "ios-7",
//   "date": "2020-09-07",
//   "time": "19:00",
//   "teacher": "Максим Абакумов",
//   "lecture": "ООП: Интерфейс и реализация. Переопределение методов",
//   "additional": "Ждем вас онлайн.",
//   "id": "e2b8a570-f0da-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55f8b3a060c900175c8c58"
//   },
//   "group": "jd_1_jadv",
//   "date": "2020-09-11",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Работа с синхронизацией. Synchronization, wait, notify, sleep, lock",
//   "additional": "n",
//   "id": "c89cb1e0-f0e9-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55f8eca060c900175c8c59"
//   },
//   "group": "jd_1_jadv",
//   "date": "2020-09-15",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Volatile, threadlocal atomics",
//   "additional": "n",
//   "id": "eadbeff0-f0e9-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55f8fea060c900175c8c5a"
//   },
//   "group": "jd_1_jadv",
//   "date": "2020-09-18",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллекции для параллельной (конкурирующей) работы",
//   "additional": "n",
//   "id": "f5996b20-f0e9-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55f911a060c900175c8c5b"
//   },
//   "group": "jd_1_jadv",
//   "date": "2020-09-22",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Клиент-серверное взаимодействие. Blocking и Non-Blocking IO",
//   "additional": "n",
//   "id": "01110e90-f0ea-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55f925a060c900175c8c5c"
//   },
//   "group": "unknown",
//   "date": "2020-09-25",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Функциональное программирование",
//   "additional": "n",
//   "id": "0ccfa610-f0ea-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f55f936a060c900175c8c5d"
//   },
//   "group": "jd_1_jadv",
//   "date": "2020-09-29",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Методология разработки. TDD, DDD",
//   "additional": "n",
//   "id": "16f52700-f0ea-11ea-a4f6-6b7b3302f20c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f571baa179cfb0017b18356"
//   },
//   "group": "py-32",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Подготовка к собеседованиям",
//   "additional": "Ждем вас онлайн.",
//   "id": "36a5c250-f197-11ea-819f-5f604c1f051f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f571bb7179cfb0017b18357"
//   },
//   "group": "py-34",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Функции - использование встроенных и создание собственных",
//   "additional": "Ждем вас онлайн.",
//   "id": "3e5bc9e0-f197-11ea-819f-5f604c1f051f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f571bf3179cfb0017b18358"
//   },
//   "group": "ios-5",
//   "date": "2020-09-08",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Разбор практических заданий",
//   "additional": "Ждем вас онлайн.",
//   "id": "62123ea0-f197-11ea-819f-5f604c1f051f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f572e23179cfb0017b1835c"
//   },
//   "group": "bcs-1",
//   "date": "2020-09-09",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Знакомство с C Sharp: структура программы, переменные и их типы",
//   "additional": "nНа лекции вы:n- научитесь создавать простые программы на C#;n- разберётесь с переменными и типами;n- поэкспериментируете с арифметическими операциями;n- научитесь превращать строки в другие типы;n- научитесь выводить информацию на консоль и получать информацию от пользователя с консоли.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "395aa820-f1a2-11ea-819f-5f604c1f051f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f587d94a0c34100178946e4"
//   },
//   "group": "bcs-1",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Знакомство с CSharp: структура программы, переменные и их типы",
//   "additional": "nНа лекции вы:n- научитесь создавать простые программы на C#;n- разберётесь с переменными и типами;n- поэкспериментируете с арифметическими операциями;n- научитесь превращать строки в другие типы;n- научитесь выводить информацию на консоль и получать информацию от пользователя с консоли.n nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "29bf00a0-f26a-11ea-9f44-0923441816c1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f587ec5a0c34100178946e5"
//   },
//   "group": "bcs-1",
//   "date": "2020-09-11",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Введение в ООП: классы и объекты",
//   "additional": "nНа лекции вы:n-изучите концепцию ООП;n-изучите строение класса;n-разберётесь со свойствами, полями и read only полями;n-изучите методы;n-изучите статические данные.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "df1a2830-f26a-11ea-9f44-0923441816c1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5899cea0c34100178946e6"
//   },
//   "group": "devops-2",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Файловые системы",
//   "additional": "nНа занятии вы:n-узнаете о структурах файловой системы и типах устройств;n-поговорите об организации хранения данных в Linux; n-рассмотрите наиболее распространенные уровни RAID;n-посмотрите на практике реализацию mdadm;n-поработаете с менеджером логических томов LVM2.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "fc961e90-f27a-11ea-9f44-0923441816c1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f589e8ba0c34100178946e8"
//   },
//   "group": "ago-1",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "gRPC (часть 1)",
//   "additional": "nНа лекции вы:n-познакомитесь с  gRPC   —  универсальным высокопроизводительным RPC-фреймворком;n-рассмотрите 2 ключевых и самых важных отличия от структуры и сущностей, которые вы использовали при разработки сервисов с JSON.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "cfa85210-f27d-11ea-9f44-0923441816c1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5927c0a0c34100178946ea"
//   },
//   "group": "py-test",
//   "date": "2020-09-09",
//   "time": "22:10",
//   "teacher": "Андрей Семакин",
//   "lecture": "Работа с библиотекой requests, http запросы",
//   "additional": "Ждем вас онлайн.",
//   "id": "9770b700-f2cf-11ea-9f44-0923441816c1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f592a2ba0c34100178946ef"
//   },
//   "group": "py-test",
//   "date": "2020-09-09",
//   "time": "22:16",
//   "teacher": "Андрей Семакин",
//   "lecture": "Работа с библиотекой requests, http запросы",
//   "additional": "Ждем вас онлайн.",
//   "id": "08c8b780-f2d1-11ea-9f44-0923441816c1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f59432ca0c34100178946f0"
//   },
//   "group": "iqa-12",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "Ждём всех онлайн!",
//   "id": "efbb26b0-f2df-11ea-9f44-0923441816c1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5943eda0c34100178946f1"
//   },
//   "group": "1-ibnet",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Александр Сухарев",
//   "lecture": "Введение в сетевые технологии (модель OSI и стек TCP/IP)",
//   "additional": "Ждём всех онлайн!",
//   "id": "63155540-f2e0-11ea-9f44-0923441816c1",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f59b9eb9b24e800179948c4"
//   },
//   "group": "ios-8",
//   "date": "2020-09-10",
//   "time": "18:00",
//   "teacher": "Артём Новичков",
//   "lecture": "Логические типы и операции с ними",
//   "additional": "Ждем всех онлайн",
//   "id": "b746f8d0-f326-11ea-9ef5-e7ea98d92a3f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f59ba3f9b24e800179948c6"
//   },
//   "group": "ios-7",
//   "date": "2020-09-10",
//   "time": "19:00",
//   "teacher": "Никита Нагайник",
//   "lecture": "Классы и структуры",
//   "additional": "Ждем вас онлайн.",
//   "id": "e96bbbc0-f326-11ea-9ef5-e7ea98d92a3f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5a7ea69b24e800179948c7"
//   },
//   "group": "ibb-2",
//   "date": "2020-09-11",
//   "time": "19:00",
//   "teacher": "Александр Сухарев",
//   "lecture": "Нормативное регулирование",
//   "additional": "Ждём всех онлайн!",
//   "id": "f9ba2d70-f39b-11ea-9ef5-e7ea98d92a3f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5a7f079b24e800179948c8"
//   },
//   "group": "java qa-9",
//   "date": "2020-09-11",
//   "time": "19:30",
//   "teacher": "Любовь Маясова",
//   "lecture": "Объектно-ориентированное      программирование: ключевые принципы",
//   "additional": "ждём всех онлайн!",
//   "id": "33602c50-f39c-11ea-9ef5-e7ea98d92a3f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5a7f4c9b24e800179948c9"
//   },
//   "group": "java qa-10",
//   "date": "2020-09-11",
//   "time": "19:30",
//   "teacher": "Любовь Маясова",
//   "lecture": "Объектно-ориентированное      программирование: ключевые принципы",
//   "additional": "Ждём всех онлайн!",
//   "id": "5cf43f20-f39c-11ea-9ef5-e7ea98d92a3f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5b12dcd48d7f00175c725c"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-11",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На занятии вы узнаете:n- что такое валидация;n- про Position & Metrics;n- про кэширование данных в LocalStorage;n- а также про события Input и Change.",
//   "id": "51330790-f3f4-11ea-99a6-e36958e12fa8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5b2482d48d7f00175c725f"
//   },
//   "group": "dj-12",
//   "date": "2020-09-11",
//   "time": "19:00",
//   "teacher": "Азамат Искаков",
//   "lecture": "Работа с API",
//   "additional": "Ждем вас онлайн.",
//   "id": "d613dc50-f3fe-11ea-99a6-e36958e12fa8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5b24a4d48d7f00175c7260"
//   },
//   "group": "py-32",
//   "date": "2020-09-11",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Python и БД. ORM. Дополнительная лекция",
//   "additional": "Ждем вас онлайн.",
//   "id": "e9ed0990-f3fe-11ea-99a6-e36958e12fa8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5b24ead48d7f00175c7261"
//   },
//   "group": "ios-1",
//   "date": "2020-09-11",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Разбор практического задания № 4",
//   "additional": "Ждем вас онлайн.",
//   "id": "13a964e0-f3ff-11ea-99a6-e36958e12fa8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5b4d8ad48d7f00175c7263"
//   },
//   "group": "git-18",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "4ae52da0-f417-11ea-99a6-e36958e12fa8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5b698ed48d7f00175c7264"
//   },
//   "group": "bcs-1",
//   "date": "2020-09-11",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Знакомство с CSharp: структура программы, переменные и их типы",
//   "additional": "nНа лекции вы:n- научитесь создавать простые программы на C#;n- разберётесь с переменными и типами;n- поэкспериментируете с арифметическими операциями;n- научитесь превращать строки в другие типы;n- научитесь выводить информацию на консоль и получать информацию от пользователя с консоли.n nЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "fd6bbe20-f427-11ea-99a6-e36958e12fa8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5bae97d48d7f00175c7267"
//   },
//   "group": "bcs-1",
//   "date": "2020-09-11",
//   "time": "21:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Функции и их параметры. Кортежи",
//   "additional": "nНа лекции вы:n-научитесь создавать и использовать (вызывать) функции на C#;n-разберётесь с параметрами: по умолчанию и именованными;n-изучите механизм возврата значений;n-изучите новый тип данных — кортеж;n-научитесь применять приведение типов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "23ab7930-f451-11ea-99a6-e36958e12fa8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5c8b2c516fd400179e37c3"
//   },
//   "group": "bcs-1",
//   "date": "2020-09-12",
//   "time": "19:00",
//   "teacher": "Михаил Триполитов",
//   "lecture": "Операторы ветвления. Логические операции",
//   "additional": "nНа занятии вы:n-разберёте логические операторы   | & ^ || && || n-разберёте операторы сравнения   == != < > <= >=  n-научитесь комбинировать операторы в условные выражения;n-узнаете операторы if, switch и тернарный оператор ?:n-разберёте примеры вложенных операторов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9d9ede20-f4d4-11ea-a12c-bd8103f19d98",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5a14cd589c0017c37e07"
//   },
//   "group": "ajs-10",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Платформы: браузер vs Node.js",
//   "additional": "На занятии вы узнаете о:n- платформахn- глобальном объектеnПознакомитесь с Node.js, нюансами работы браузера и многим другим.",
//   "id": "876eba20-f5e8-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5a2fcd589c0017c37e08"
//   },
//   "group": "ajs-10",
//   "date": "2020-09-17",
//   "time": "18:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Unit-тестирование",
//   "additional": "На занятии вы познакомитесь с:n- Unit-тестированиеn- покрытием кодаn- Jestn- Mock'амиn- Data Driven тестами",
//   "id": "976f4110-f5e8-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5a7fcd589c0017c37e09"
//   },
//   "group": "bafe-12",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Вводное занятие с координатором курса",
//   "additional": "На лекции будут раскрыты основные организационные моменты, с которыми вы столкнетесь во время учебы.",
//   "id": "c7a2e260-f5e8-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5aadcd589c0017c37e0a"
//   },
//   "group": "bafe-12",
//   "date": "2020-09-16",
//   "time": "19:30",
//   "teacher": "Алексей Стегура",
//   "lecture": "Как замотивировать себя на учёбу",
//   "additional": "На лекции будут раскрыты вопросы мотивации. Приходите, будет интересно!",
//   "id": "e28a8c90-f5e8-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5ac5cd589c0017c37e0b"
//   },
//   "group": "bhj-13",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Способы поиска нужного HTML-элемента",
//   "additional": "Мы узнаем о $0 в консоли, познакомимся с HTMLCollection и различными доступами к элементам. Ждем вас на вебинаре!",
//   "id": "f1234620-f5e8-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5afbcd589c0017c37e0c"
//   },
//   "group": "bhj-13",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Объект события",
//   "additional": "Преподаватель расскажет, какие проблемы может вызывать использование свойства onclick, и как по-другому можно назначить и удалить обработчики событий элемента. Подробно рассмотрим объект события, содержащий подробную информацию об обрабатываемом событии, свойства событий и обработку событий клавиатуры.nДо встречи на вебинаре!",
//   "id": "11849c70-f5e9-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5b1bcd589c0017c37e0d"
//   },
//   "group": "html-53",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Всплывающие элементы",
//   "additional": "На занятии он:n- расскажет, чем отличаются контентные и декоративные изображения;n- объяснит, как позиционировать элементы на странице;n- научит работать с Adobe Photoshop.",
//   "id": "2450ed90-f5e9-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5b30cd589c0017c37e0e"
//   },
//   "group": "html-53",
//   "date": "2020-09-16",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование flex-элементов",
//   "additional": "На занятии преподаватель:n- научит вас позиционировать flex-элементы;n- объяснит, как фиксировать элементы на странице;n- расскажет, что такое специфичность CSS-селектора и как она считается;n- покажет, как работать со шрифтами и изображениями в Adobe Photoshop.",
//   "id": "30ce8f50-f5e9-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5b46cd589c0017c37e0f"
//   },
//   "group": "html-53",
//   "date": "2020-09-18",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На занятии вы узнаете:n- что из себя представляет работа над дипломным проектом;n- из каких этапов она состоит;n- что нужно сделать, чтобы получить допуск. Большинство из вас прекрасно показали себя на курсе, так что мы уверены, что вы отлично справитесь!",
//   "id": "3e369110-f5e9-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5c7ecd589c0017c37e12"
//   },
//   "group": "lrv-2",
//   "date": "2020-09-14",
//   "time": "19:30",
//   "teacher": "Алексей Стегура",
//   "lecture": "Работа с базой данных",
//   "additional": "На лекции вы узнаете о:n- настройке соединенийn- выполнении sql-запросовn- миграцииn- ORM",
//   "id": "f7c0e360-f5e9-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5cb4cd589c0017c37e14"
//   },
//   "group": "mq-27",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Адаптивные изображения",
//   "additional": "На лекции вы дополните свои знания полезными flexbox-свойствами:n- flex-grow - растяжение элементов;n- flex-shrink - сужение элементов;n- flex-basis - базовая ширина элемента;n- flex - задание базовой ширины и трансформации элемента одним свойством;n- order - порядок отображения элементов.nКроме того, вы познакомитесь с тегом <picture> и рассмотрите пример загрузки различных вариантов фонового изображения для разных разрешений с его помощью. А в заключение вы закрепите тему подготовки графики для разных устройств. nЗанятие будет занимательным, не пропустите!",
//   "id": "17e75390-f5ea-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5cf2cd589c0017c37e15"
//   },
//   "group": "mq-27",
//   "date": "2020-09-16",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "Вы узнаете, что из себя представляет работа над дипломным проектом, какие будут сроки и что нужно сделать, чтобы получить допуск. nБольшинство из вас прекрасно показали себя на курсе, так что мы уверены, что вы отлично справитесь! ",
//   "id": "3d5c6840-f5ea-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5d0dcd589c0017c37e16"
//   },
//   "group": "bjs-14",
//   "date": "2020-09-14",
//   "time": "18:30",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "4cfddf40-f5ea-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5d28cd589c0017c37e17"
//   },
//   "group": "ra-24",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "Жизненный цикл и работа с HTTP",
//   "additional": "На лекции вы узнаете оn- работе с HTTPn- жизненном цикле компонентовn- фазах жизненного циклаn- первоначальной отрисовке компонентовn- изменении состояния компонентаn- построении круговых диаграммn- удалении компонента со страницыnЖдем вас на вебинаре.n",
//   "id": "5d37ecc0-f5ea-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5d48cd589c0017c37e18"
//   },
//   "group": "ra-24",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "HOC",
//   "additional": "На лекции преподаватель познакомит вас с:n- интерфейсом оператора таксиn- чистыми функциями (Pure functions)n- функциями высшего порядка (Higher Order Functions)n- универсальным Logger для компонентовn- компонентом высшего порядка (higher order component)n- возможными сложностями и проблемами HOCn",
//   "id": "7085a2e0-f5ea-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5d62cd589c0017c37e19"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Drag and Drop, Работа с файлами",
//   "additional": "На занятии вы узнаете:n- про генерацию событий;n- про FileAPI;n- а также про реализации Drag and Drop.",
//   "id": "7fdbb900-f5ea-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e5d82cd589c0017c37e1a"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Работа с HTTP",
//   "additional": "На занятии вы узнаете:n- все про http, XMLHttpRequest и SOP;n- как упростить взаимодействие по HTTP с помощью Fetch API;n- а также про принцип построения rest.",
//   "id": "933e2fa0-f5ea-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e7170cd589c0017c37e1b"
//   },
//   "group": "java qa-11",
//   "date": "2020-09-14",
//   "time": "19:30",
//   "teacher": "Ксения Глушкова",
//   "lecture": " Примитивные типы данных, условные операторы, выход за границы типов и погрешность вычислений",
//   "additional": "Ждём всех онлайн!",
//   "id": "74231e80-f5f6-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e7210cd589c0017c37e1c"
//   },
//   "group": "aqa-8",
//   "date": "2020-09-14",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Selenide",
//   "additional": "Ждём всех онлайн!",
//   "id": "d31b19b0-f5f6-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5e7298cd589c0017c37e1d"
//   },
//   "group": "ibb-2",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Александр Сухарев",
//   "lecture": "Классификация и категоризация информации, информационных систем",
//   "additional": "Ждём всех онлайн!",
//   "id": "247eabf0-f5f7-11ea-a3b2-6991c84a933c",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5f1330ff29f800176abae5"
//   },
//   "group": "devops-2",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Компьютерные сети (лекция 1)",
//   "additional": "nНа лекции вы узнаете о:n-классификации сетей по типу используемой среды и типу коммутации;n-истории развития, который привели к появлению двухранговых сетей и двух типов не связанных адресов;n-стеке протоколов TCP/IP и конкретных его представителях;n-важных терминах, применяемых при обсуждении сетей;n-разницы протоколов транспортного уровня TCP и UDP;n-фазах жизни соединения TCP;n-том, как можно посмотреть на сетевое взаимодействие средствами операционной системы как на уровне системных вызовов, так и собирая фреймы на интерфейсе с помощью tcpdump.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "dd444280-f656-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5f1351ff29f800176abae6"
//   },
//   "group": "devops-2",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Компьютерные сети (лекция 2)",
//   "additional": "nНа лекции вы:n-разберётесь в том, как работает маска сети IP, в разных вариантах записи адресов;n-познакомитесь с калькулятором ipcalc;n-узнаете о некоторых важных оптимизациях TCP;n-разберётесь в основах DNS и HTTP.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "f0c98360-f656-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5f136bff29f800176abae7"
//   },
//   "group": "devops-2",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Компьютерные сети (лекция 3)",
//   "additional": "nНа лекции вы:n-посмотрите на практике, как работают виртуальные сетевые интерфейсы в контейнерах;n-разберёте балансировку L4 и L7, познакомитесь с L4 балансером ipvs;n-увидите в работе keepalived в базовой конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "004f5c10-f657-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5f1a50ff29f800176abaeb"
//   },
//   "group": "ios-8",
//   "date": "2020-09-14",
//   "time": "18:00",
//   "teacher": "Артём Новичков",
//   "lecture": "Преобразование типов. Условные конструкции",
//   "additional": "Ждем вас онлайн.",
//   "id": "1c4df7b0-f65b-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5f1a86ff29f800176abaec"
//   },
//   "group": "ios-6",
//   "date": "2020-09-14",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Дизайн и пользовательский интерфейс",
//   "additional": "Ждем вас онлайн.",
//   "id": "3cbf2c80-f65b-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5f1a9bff29f800176abaed"
//   },
//   "group": "py-32",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Оксана Махонина",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "Ждем вас онлайн.",
//   "id": "48af0d30-f65b-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5f1df3ff29f800176abaef"
//   },
//   "group": "ago-1",
//   "date": "2020-09-14",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "gRPC (часть 2)",
//   "additional": "nНа занятии вы:n-изучите API, принципы взаимодействия в них;n-рассмотрите виды в рамках описания методов сервисов (в файлах .proto);n-поработаете с ошибками, Timeout & Cancellation.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "474706d0-f65d-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5fbba6ff29f800176abaf0"
//   },
//   "group": "java qa-9",
//   "date": "2020-09-15",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Объекты с внутренним состоянием, управление состоянием при тестировании",
//   "additional": "Ждём всех онлайн!",
//   "id": "45ec9030-f6bb-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5fc0a1ff29f800176abaf1"
//   },
//   "group": "pb-17",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Функция без параметров. Область видимости",
//   "additional": "nНа лекции мы узнаем:nn  - что такое подпрограммы;n  - к каким переменным есть доступ у функции;n  - как переопределить переменную из другой области видимости.nnдополнительные материалы:nдокументация на MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Functionsnlearnjsnhttps://learn.javascript.ru/function-basics",
//   "id": "3e4f8780-f6be-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5fc141ff29f800176abaf2"
//   },
//   "group": "pb-17",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Николай Лопин",
//   "lecture": "Параметры и возвращаемое значение",
//   "additional": " nНа лекции мы узнаем:n  - как передать данные в функцию через аргументы;n  - как получить данные из функции;n  - сколько значений можно вернуть из функции.",
//   "id": "9d9ea360-f6be-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f5fcda8ff29f800176abaf4"
//   },
//   "group": "lrv-2",
//   "date": "2020-09-18",
//   "time": "19:30",
//   "teacher": "Алексей Стегура",
//   "lecture": "Базы данных. MVC. Модель",
//   "additional": "На лекции вы узнаете о:n- базах данныхn- MVC. МоделиnДетально рассмотрите следующие темы:n- конфигурационный файлn- миграцииn- seedsn- свойства, создание и удаление MVC. Модели, а также отношение",
//   "id": "0205e640-f6c6-11ea-b6b9-9d8fbc96030f",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6072c8a325870017806cea"
//   },
//   "group": "ios-3",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "6e05d550-f728-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f607312a325870017806ceb"
//   },
//   "group": "ios-7",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Никита Нагайник",
//   "lecture": "Свойства и методы объекта",
//   "additional": "Ждем вас онлайн.",
//   "id": "99fdefd0-f728-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f607453a325870017806ced"
//   },
//   "group": "py-33",
//   "date": "2020-09-15",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Введение в базы данных. Типы баз данных",
//   "additional": "Ждем вас онлайн.",
//   "id": "599cceb0-f729-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f60b2e7a325870017806cf1"
//   },
//   "group": "onec-2",
//   "date": "2020-09-22",
//   "time": "19:30",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "XML и JSON",
//   "additional": "nНа вебинаре вы узнаете:n-теоретическую структуру форматов XML и JSON;n-возможность автоматического формирования файлов обмена по данным ИБ;n-возможность автоматического формирования файлов обмена по универсальным коллекциям 1С;n-ручное чтение и запись XML;n-ручное чтение и запись JSON.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "a6011520-f74e-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f60b349a325870017806cf2"
//   },
//   "group": "onec-2",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "HTTP-сервисы и SOAP-сервисы",
//   "additional": "nНа занятии вы узнаете:n-теоретическую часть протоколов SOAP и HTTP;n-создание модели данных с помощью XDTO;n-применение модели данных в веб-сервисе SOAP;n-создание метода (операции) в веб-сервисе;n-структуру http-запроса и http-ответа;n-устройство http-сервиса.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "e0742800-f74e-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f60b3e6a325870017806cf3"
//   },
//   "group": "onec-2",
//   "date": "2020-09-28",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Распределенная информационная база",
//   "additional": "nНа вебинаре вы узнаете про:n-Объект ПланОбмена;n-инфраструктуру регистрации изменений;n-инфраструктуру обмена сообщениями;n-ЧтениеCообщений;n-ЗаписьСообщений;n-способ запроса записей из таблиц регистрации изменений;n-отдельный режим "РИБ", недоступный в учебной версии.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "3dda5fa0-f74f-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6117e5a325870017806cf4"
//   },
//   "group": "iqa-12",
//   "date": "2020-09-16",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию",
//   "additional": "Ждём всех онлайн!",
//   "id": "d84528a0-f78a-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f61181da325870017806cf5"
//   },
//   "group": "ibb-2",
//   "date": "2020-09-16",
//   "time": "19:00",
//   "teacher": "Евгений-Строев",
//   "lecture": "Организация защиты информации (часть 1)",
//   "additional": "Ждём всех онлайн!",
//   "id": "f9885370-f78a-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f611a13a325870017806cf6"
//   },
//   "group": "onec-3",
//   "date": "2020-09-24",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Конструктор запросов",
//   "additional": "nНа занятии вы узнаете:n-что такое запрос и конструктор запросов;n-какие элементы содержит конструктор запросов.nnНаучитесь:n-создавать запрос, используя конструктор запросов;n-получать и проверять результат  запроса;n-делать выборку запроса и обрабатывать записи.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "24aef7b0-f78c-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f611a3ea325870017806cf7"
//   },
//   "group": "onec-3",
//   "date": "2020-09-28",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Условия и подзапросы",
//   "additional": "nНа лекции вы узнаете:n-что такое условия в запросе, где они применяются, какие операторы используют, как формируются в конструкторе запросов;n-что такое подзапросы и как использовать.nnНаучитесь:n-создавать условия, подзапросы в конструкторе запросов;n-изменять и анализировать измененный текст запроса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "3eb8ec10-f78c-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f611a93a325870017806cf8"
//   },
//   "group": "onec-3",
//   "date": "2020-10-02",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Итоги и группировки",
//   "additional": "nНа занятии вы узнаете:n-что такое итоги и группировка в запросе;n-как они формируются в конструкторе запросов. nnНаучитесь:n-создавать текст запроса для итогов и группировок;n-изменять и анализировать измененный текст запроса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "70faace0-f78c-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f611b0da325870017806cf9"
//   },
//   "group": "onec-3",
//   "date": "2020-10-05",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Соединения",
//   "additional": "nНа занятии вы узнаете:n-что такое соединение в запросе;n-какие бывают виды соединений. nnНаучитесь:n-создавать текст запроса с соединениями;n-изменять и анализировать текст запроса.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b9f78530-f78c-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f611b4aa325870017806cfa"
//   },
//   "group": "onec-3",
//   "date": "2020-10-09",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Временные таблицы и пакетные запросы",
//   "additional": "nНа лекции вы узнаете:n-что такое временные таблицы, пакет запросов и менеджер временных таблиц.nnНаучитесь:n-создавать временные таблицы;n-передавать в них данные из кода;n-выполнять пакетные  запросы;n-пользоваться менеджером временных таблиц.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "de201cb0-f78c-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f611b8fa325870017806cfb"
//   },
//   "group": "onec-3",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Введение в СКД",
//   "additional": "nНа занятии вы узнаете:n-что такое система компоновки данных.nnНаучитесь:n-создавать отчеты с помощью конструктора схемы компоновки данных. nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "079583f0-f78d-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f611c50a325870017806cfc"
//   },
//   "group": "onec-3",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Матвей Серегин",
//   "lecture": "Работа в СКД",
//   "additional": "nНа лекции вы узнаете:n-каковы основные объекты СКД;n-как они взаимодействуют при вводе ответа.nnНаучитесь:n-создавать отчет в СКД с использованием набора данных - объект;n-передавать данные из таблицы значений в набор данных - объект.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "7a8ecdd0-f78d-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f611c83a325870017806cfd"
//   },
//   "group": "onec-3",
//   "date": "2020-10-16",
//   "time": "18:30",
//   "teacher": "Алексей Павлов",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nВы узнаете, что из себя представляет дипломная работа, и кто поможет вам в работе над ней. nПоговорите о сроках выполнения работы и обсудите другие вопросы, связанные с завершением первого блока на профессии «1С-разработчик».n nЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях",
//   "id": "99243dc0-f78d-11ea-9cf2-1129bd6d35d3",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f61bbb0f15a860017496f79"
//   },
//   "group": "ios-4",
//   "date": "2020-09-16",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 3",
//   "additional": "Ждем вас онлайн.",
//   "id": "7940e4e0-f7ec-11ea-ae68-dd6739083274",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f624a07f15a860017496f7d"
//   },
//   "group": "aqa-8",
//   "date": "2020-09-17",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Patterns",
//   "additional": "Ждём всех онлайн!",
//   "id": "50a0ce60-f841-11ea-ae68-dd6739083274",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f624a39f15a860017496f7e"
//   },
//   "group": "1-ibnet",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Иван Чупров",
//   "lecture": "Организация сети (ключевые устройства) и их работа",
//   "additional": "Ждём всех онлайн!",
//   "id": "6e8c1ba0-f841-11ea-ae68-dd6739083274",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f624bf6f15a860017496f7f"
//   },
//   "group": "java qa-11",
//   "date": "2020-09-18",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Testability, авто-тесты, введение в ООП: объекты и методы",
//   "additional": "Ждём всех онлайн!",
//   "id": "774e1f80-f842-11ea-ae68-dd6739083274",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f624c43f15a860017496f80"
//   },
//   "group": "java qa-9",
//   "date": "2020-09-18",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Композиция и зависимость объектов. Mockito при создании авто-тестов",
//   "additional": "Ждём всех онлайн!",
//   "id": "a56c0030-f842-11ea-ae68-dd6739083274",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f624c62f15a860017496f81"
//   },
//   "group": "java qa-10",
//   "date": "2020-09-18",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Композиция и зависимость объектов. Mockito при создании авто-тестов",
//   "additional": "Ждём всех онлайн!",
//   "id": "b7fafa30-f842-11ea-ae68-dd6739083274",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f62532df15a860017496f82"
//   },
//   "group": "iqa-12",
//   "date": "2020-09-18",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Артефакты тестирования. Дефекты",
//   "additional": "Ждём всех онлайн!",
//   "id": "c426ae90-f846-11ea-ae68-dd6739083274",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f62546af15a860017496f83"
//   },
//   "group": "1-ibnet",
//   "date": "2020-09-18",
//   "time": "19:00",
//   "teacher": "Евгений-Строев",
//   "lecture": "Протоколы канального уровня",
//   "additional": "Ждём всех онлайн!",
//   "id": "816a5f60-f847-11ea-ae68-dd6739083274",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f62ffe73656c2001747a683"
//   },
//   "group": "ago-1",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "Микросервисная архитектура",
//   "additional": "nНа лекции вы:n-познакомитесь с архитектурными подходами при разработке сервисов;n-рассмотрите преимущества и недостатки микросервисной архитектуры.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b8a938f0-f8ad-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6305083656c2001747a687"
//   },
//   "group": "ios-8",
//   "date": "2020-09-17",
//   "time": "18:00",
//   "teacher": "Артём Новичков",
//   "lecture": "Опциональные типы и преобразование",
//   "additional": "Ждем вас онлайн.",
//   "id": "c6c763f0-f8b0-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f63052d3656c2001747a688"
//   },
//   "group": "ios-6",
//   "date": "2020-09-17",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Инструменты для разработки интерфейса",
//   "additional": "Ждем вас онлайн.",
//   "id": "dd44fd40-f8b0-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6305423656c2001747a689"
//   },
//   "group": "dj-12",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Оксана Махонина",
//   "lecture": "Консультация по дипломной работе Django",
//   "additional": "Ждем вас онлайн.",
//   "id": "e985bd10-f8b0-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f63055c3656c2001747a68a"
//   },
//   "group": "ios-7",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Никита Нагайник",
//   "lecture": "Замыкания",
//   "additional": "Ждем вас онлайн.",
//   "id": "f8df2e90-f8b0-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6306d03656c2001747a68b"
//   },
//   "group": "py-33",
//   "date": "2020-09-17",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Работа с PostgreSQL. Создание БД",
//   "additional": "Ждем вас онлайн.",
//   "id": "d6e6c810-f8b1-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f631c473656c2001747a68d"
//   },
//   "group": "lrv-2",
//   "date": "2020-09-18",
//   "time": "19:30",
//   "teacher": "Алексей Стегура",
//   "lecture": "MVC. View и Controller. Аутентификация",
//   "additional": "На лекции вы рассмотрите следующие темы:n- Viewn    - Наследование и разделыn    - Работа с переменнымиn    - Конструкции if-elsen    - Циклыn    - Кастомные страницы ошибокn- Controllern    - Созданиеn    - Работа с запросамиn    - Валидацияn- Аутентификацияn    - Жизнь до Laravel 8n    - Laravel 8 - Laravel Jetstreamn    - Общий функционал",
//   "id": "a20bd2e0-f8be-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6330023656c2001747a68e"
//   },
//   "group": "devops-2",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Элементы безопасности информационных систем",
//   "additional": "nНа лекции вы познакомитесь с:n- TLS и технологиями, обеспечивающими защищенные соединения: симметричной и асимметричной криптографией, хеш-функциями;n-понятием PKI – Public Key Infrastructure на примере набора скриптов easy-rsa и самоподписанного ЦА;n-протоколом ACME и ЦА Let’s encrypt;n-применением ключей для SSH.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "64e3bbb0-f8ca-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f63302c3656c2001747a68f"
//   },
//   "group": "devops-2",
//   "date": "2020-09-28",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Командная оболочка Bash: практические навыки",
//   "additional": "nНа лекции вы:n-узнаете для чего нужен  bash в DevOps;n-познакомитесь с основами его синтаксиса;n-узнаете, как написать первый скрипт;n-научитесь правильно экранировать операции с переменными.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "7deba960-f8ca-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f63305f3656c2001747a690"
//   },
//   "group": "devops-2",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Использование Python для решения типовых DevOps задач",
//   "additional": "nНа занятии вы:n-узнаете, для каких DevOps-задач можно использовать Python;n-поработаете с синтаксисом;n-познакомитесь с двумя модулями для работы с системой;n-напишите скрипт.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9c359160-f8ca-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6330903656c2001747a691"
//   },
//   "group": "devops-2",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Языки разметки JSON и YAML",
//   "additional": "nНа лекции вы:n-узнаете, что такое языки разметки;n-узнаете, для чего они нужны;n-познакомитесь с синтаксисом двух языков;n-познакомитесь с возможностями их обработки при помощи Python/nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b96074d0-f8ca-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6334893656c2001747a692"
//   },
//   "group": "onec-5",
//   "date": "2020-09-22",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Модули",
//   "additional": "nНа вебинаре вы узнаете:n-какими бывают общие модули;n-что такое директивы компиляции и инструкции препроцессора;n-для чего служат модули форм, модули объектов и модули менеджеров;n-каковы основные события модулей объектов и модулей менеджеров.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "17b05e40-f8cd-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6338c93656c2001747a693"
//   },
//   "group": "onec-5",
//   "date": "2020-10-01",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Даты и строки",
//   "additional": "nНа лекции вы узнаете:n-как задаются параметры дат и строк для хранения в ИБ;n-какие операции определены для дат и строк.nnА еще научитесь:n-выполнять простые операции с датами и строками.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. n",
//   "id": "9fcfb5d0-f8cf-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633ab13656c2001747a694"
//   },
//   "group": "onec-5",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Условия",
//   "additional": "nНа занятии вы узнаете:n-что такое оператор условного выполнения и тернарный оператор;n-чем хороша декларативность в коде.nnНаучитесь:n-писать простые и вложенные операторы условного выполнения;n-переписывать их на тернарные операторы;n-проверять заполненность значений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. nn",
//   "id": "c2f36b00-f8d0-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633c0c3656c2001747a695"
//   },
//   "group": "onec-5",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Циклы",
//   "additional": "nНа занятии вы узнаете:n-что такое цикл;n-какими способами можно организовать цикл;n-как прервать и продолжить выполнение цикла;n-что такое синтаксический сахар.nnА ещё вы научитесь:n-организовывать простейшие циклы.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "9174b6a0-f8d1-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633c263656c2001747a696"
//   },
//   "group": "onec-5",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Универсальные коллекции",
//   "additional": "nНа занятии вы узнаете:n-что такое универсальная коллекция;n-какие коллекции поддерживает встроенный язык.nnНаучитесь:n-создавать массивы, списки значений, структуры, соответствия, таблицы и деревья значений;n-наполнять их, сортировать, выполнять обход и поиск.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "a1276bb0-f8d1-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633c3f3656c2001747a697"
//   },
//   "group": "onec-5",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Андрей Овсянкин",
//   "lecture": "Объекты платформы",
//   "additional": "nНа вебинаре вы узнаете:n-как создаются объекты платформы;n-что такое конструктор и метод;n-для чего нужны объекты ТабличныйДокумент и ТекстовыйДокумент.nnТакже научитесь:n-создавать цвета, шрифты и собирать из них форматированные строки;n-использовать генератор случайных чисел;n-программно создавать, находить и изменять пользователей ИБ.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b01faa60-f8d1-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633c793656c2001747a698"
//   },
//   "group": "onec-5",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Процедуры и функции",
//   "additional": "nНа лекции вы узнаете:n-что такое процедуры и функции как подпрограммы, побочный эффект, рекурсия;n-какие бывают имена и параметры;n-для чего нужны - возврат значений, передача по значению, повторное использование, комментарии.nnНаучитесь:n-создавать процедуры и функции;n-определять параметры и использовать возврат значений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "d2f55c10-f8d1-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633d623656c2001747a699"
//   },
//   "group": "onec-4",
//   "date": "2020-09-22",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Справочники",
//   "additional": "nНа занятии вы узнаете:n-что такое справочник;n-для чего служат его реквизиты и табличные части;n-как определять, на какие справочники лучше делить сущности предметной области.nnНаучитесь:n-переопределять установку кода, получение представления и ввод по строке;n-создавать, удалять и изменять элементы;n-создавать и получать предопределенные элементы.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "5d938130-f8d2-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633d943656c2001747a69a"
//   },
//   "group": "onec-4",
//   "date": "2020-09-25",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Иерархия и подчинение",
//   "additional": "nНа занятии вы узнаете:n-зачем нужна иерархия;n-чем отличается иерархия элементов от иерархии групп;n-как она отображается в списках;n-зачем нужно подчинение;n-чем оно лучше просто реквизита-ссылки.nnНаучитесь:n-удалять, искать и отбирать элементы по иерархии;n-создавать элементы справочников с циклическими ссылками друг на друга.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "7b1cd850-f8d2-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633db53656c2001747a69b"
//   },
//   "group": "onec-4",
//   "date": "2020-09-28",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Формы справочников",
//   "additional": "nНаучитесь:n-изменять элемент справочника перед записью и записывать вместе с ним другие данные;n-реализовывать подбор;n-скрывать помеченные на удаление элементы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "8f1d3ca0-f8d2-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633dd53656c2001747a69c"
//   },
//   "group": "onec-4",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Регистры сведений",
//   "additional": "nНа занятии вы узнаете:n-что такое “регистр сведений” и зачем он нужен;n-что такое измерения, и чем отличается ресурс от реквизита;n-что такое “ведущее измерение” и когда добавлять индексы.nnНаучитесь:n-программно открывать форму записи и форму списка с отбором;n-делать простейший отчет по регистру.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "a1e2fe10-f8d2-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633def3656c2001747a69d"
//   },
//   "group": "onec-4",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Запись и чтение регистров",
//   "additional": "nНа занятии вы узнаете:n-что такое менеджер регистра, менеджер записи и набор записей;n-когда использовать менеджер записи, а когда -- набор.nnНаучитесь:n-читать, записывать, изменять и удалять данные регистров с помощью менеджеров записи и наборов записей;n-переопределять события модуля набора записей.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "b154b280-f8d2-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f633e0b3656c2001747a69e"
//   },
//   "group": "onec-4",
//   "date": "2020-10-07",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nНа занятии вы узнаете:n-что такое виртуальные таблицы;n-как получать срез первых и срез последних.nnНаучитесь:n-строить простые отчеты по виртуальным таблицам регистров сведений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c22114f0-f8d2-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f63bff93656c2001747a69f"
//   },
//   "group": "ra-24",
//   "date": "2020-09-18",
//   "time": "18:30",
//   "teacher": "Владимир Языков",
//   "lecture": "HOC",
//   "additional": "На лекции преподаватель познакомит вас с:n- интерфейсом оператора таксиn- чистыми функциями (Pure functions)n- функциями высшего порядка (Higher Order Functions)n- универсальным Logger для компонентовn- компонентом высшего порядка (higher order component)n- возможными сложностями и проблемами HOCn",
//   "id": "3428f2f0-f920-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f63c0923656c2001747a6a0"
//   },
//   "group": "ajs-10",
//   "date": "2020-09-18",
//   "time": "18:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Unit-тестирование",
//   "additional": "На занятии вы познакомитесь с:n- Unit-тестированиеn- покрытием кодаn- Jestn- Mock'амиn- Data Driven тестами",
//   "id": "8f547cd0-f920-11ea-bfdf-31c5c9dd5a56",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f64814bbc12870017bf94a9"
//   },
//   "group": "SD_15",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Новое знакомство с компьютером",
//   "additional": "n",
//   "id": "6e43fe80-f993-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f648160bc12870017bf94aa"
//   },
//   "group": "SD_15",
//   "date": "2020-09-25",
//   "time": "19:00",
//   "teacher": "Ирина Хомутова",
//   "lecture": "Общаемся с компьютером",
//   "additional": "n",
//   "id": "7b287860-f993-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f648175bc12870017bf94ab"
//   },
//   "group": "SD_15",
//   "date": "2020-09-30",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Три кита веба: HTML, CSS, JS",
//   "additional": "n",
//   "id": "876e6850-f993-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f64818bbc12870017bf94ac"
//   },
//   "group": "SD_15",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Интернет — большая библиотека",
//   "additional": "n",
//   "id": "9456d9d0-f993-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f64819ebc12870017bf94ad"
//   },
//   "group": "SD_15",
//   "date": "2020-10-09",
//   "time": "19:00",
//   "teacher": "Ирина Хомутова",
//   "lecture": "Вся правда о профессии разработчика",
//   "additional": "n",
//   "id": "a01bb2e0-f993-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f648286bc12870017bf94ae"
//   },
//   "group": "java-15",
//   "date": "2020-09-21",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Массивы одномерные",
//   "additional": "n",
//   "id": "2a033230-f994-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f64829abc12870017bf94af"
//   },
//   "group": "java-15",
//   "date": "2020-09-24",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Массивы многомерные",
//   "additional": "n",
//   "id": "35e11180-f994-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6482b7bc12870017bf94b0"
//   },
//   "group": "java-15",
//   "date": "2020-09-30",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Модификаторы доступа, наследование",
//   "additional": "n",
//   "id": "47367a10-f994-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6482cebc12870017bf94b1"
//   },
//   "group": "java-15",
//   "date": "2020-10-02",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Полиморфизм",
//   "additional": "n",
//   "id": "553e1730-f994-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6482e5bc12870017bf94b2"
//   },
//   "group": "java-15",
//   "date": "2020-10-06",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Абстракции и интерфейсы",
//   "additional": "n",
//   "id": "62bdbfa0-f994-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6482fbbc12870017bf94b3"
//   },
//   "group": "java-15",
//   "date": "2020-10-08",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Исключения, Stacktrace",
//   "additional": "n",
//   "id": "6f9679b0-f994-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f64830cbc12870017bf94b4"
//   },
//   "group": "java-15",
//   "date": "2020-10-12",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач",
//   "additional": "n",
//   "id": "79c9dd50-f994-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f64966abc12870017bf94b5"
//   },
//   "group": "virt-1",
//   "date": "2020-09-21",
//   "time": "20:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Основы виртуализации",
//   "additional": "nНа занятии вы:n-узнаете, что такое виртуализация;n-узнаете о преимуществах виртуализации;n-подробно рассмотрите каждый из видов преимущества виртуализации;n-рассмотрите виды виртуализации и сравните их;n-рассмотрите плюсы и минусы виртуализации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "05033000-f9a0-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f649740bc12870017bf94b7"
//   },
//   "group": "virt-1",
//   "date": "2020-09-24",
//   "time": "20:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Системы управления виртуализацией",
//   "additional": "nНа лекции вы:n-познакомитесь с основными системами управления виртуализацией, их классификацией, преимуществами и недостатками каждой из них, а также понятием гипервизора и его типами;n-узнаете о более комплексном подходе для виртуализации таким, как инфраструктура как сервис и его реализациях в виде публичных и приватных облаков.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "84c97420-f9a0-11ea-9d18-018cfcfce5f2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f673748ad02d200179cf392"
//   },
//   "group": "ajs-10",
//   "date": "2020-09-22",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Прототипы, конструкторы, классы и наследование",
//   "additional": "На занятии вы узнаете о:n- конструкторахn- использовании прототиповn- привязке контекстаn- иерархии наследованияn- классах и наследовании",
//   "id": "14470770-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f673761ad02d200179cf393"
//   },
//   "group": "ajs-10",
//   "date": "2020-09-25",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Object, Reflection и Proxy",
//   "additional": "На лекции:n- разберём методы Objectn- познакомимся с устройством свойств объектов в JS и дескрипторами свойствn- поговорим о тонкостях, которые спрашивают на собеседованияхn- разберём Proxy и Reflection API",
//   "id": "237fd190-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f673776ad02d200179cf394"
//   },
//   "group": "bafe-12",
//   "date": "2020-09-23",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "На лекции будут раскрыты следующие вопросы:n- как работает интернетn- протокол HTTPn- что такое серверnи многое другое.nЖдем вас на лекции!",
//   "id": "2ffb5070-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f673787ad02d200179cf395"
//   },
//   "group": "bafe-12",
//   "date": "2020-09-25",
//   "time": "19:00",
//   "teacher": "Александр Шлейко",
//   "lecture": "Путь frontend-разработчика",
//   "additional": "Вы узнаете о том, из чего состоит путь разработчика, какие есть перспективы. Приходите, будет увлекательно!",
//   "id": "39d94110-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f67379fad02d200179cf396"
//   },
//   "group": "bhj-13",
//   "date": "2020-09-22",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "DOM",
//   "additional": "Мы познакомимся и научимся работать с событиями  загрузки DOM, навигацией, различными атрибутами. Приходите, будет интересно!",
//   "id": "487b7080-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6737b3ad02d200179cf397"
//   },
//   "group": "bhj-13",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На лекции рассмотрим, какие бывают события. Остановимся на работе с input и output. Ждем вас на вебинаре!n",
//   "id": "54404990-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6737c5ad02d200179cf398"
//   },
//   "group": "ra-24",
//   "date": "2020-09-22",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "hooks, Context API",
//   "additional": "На лекции вы изучите:n- хукиn- useStaten- useEffectn- useRefn- кастомные хукиn- useContext & Context API",
//   "id": "5ed10f70-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6737ebad02d200179cf399"
//   },
//   "group": "ra-24",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Михаил Ларченко",
//   "lecture": "React Router",
//   "additional": "На лекции вы изучите:n- router, Routen- вложенность Routen- linkn- состояние ссылокn- switchn- route с параметрамиn- redirectnЖдем вас на вебинаре!",
//   "id": "759a57c0-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f673806ad02d200179cf39a"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-22",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "EventSource, Websockets",
//   "additional": "На занятии вы узнаете:n- про технологию Server Sent Events;n- а также как работать с протоколом связи WebSocket.",
//   "id": "860623a0-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f673823ad02d200179cf39b"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Анимация и CSS",
//   "additional": "На занятии вы узнаете:n- что такое анимация;n- разницу между css animation и css transform;n- про transition и animation events;n- а также про requestAnimationFrame.",
//   "id": "96f35480-fb31-11ea-8aa1-ab45e7397e51",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f68504fdd0ecf0017e131e4"
//   },
//   "group": "ibb-2",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Евгений-Строев",
//   "lecture": "Организация защиты информации (часть 2)",
//   "additional": "Ждём всех онлайн!",
//   "id": "95b27630-fbd8-11ea-ae32-fbf328c00f6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f685123dd0ecf0017e131e5"
//   },
//   "group": "iqa-12",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Артефакты тестирования. Тестовая документация",
//   "additional": "Ждём всех онлайн!",
//   "id": "144fcab0-fbd9-11ea-ae32-fbf328c00f6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f68516add0ecf0017e131e6"
//   },
//   "group": "aqa-8",
//   "date": "2020-09-21",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Behaviour Driven Development",
//   "additional": "Ждём всех онлайн!",
//   "id": "3ee5e430-fbd9-11ea-ae32-fbf328c00f6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f685213dd0ecf0017e131e7"
//   },
//   "group": "java qa-11",
//   "date": "2020-09-21",
//   "time": "19:30",
//   "teacher": "Ксения Глушкова",
//   "lecture": "Система сборки Maven, управление зависимостями, автотесты на JUnit5",
//   "additional": "ждём всех онлайн!",
//   "id": "a38ca540-fbd9-11ea-ae32-fbf328c00f6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f685582dd0ecf0017e131e8"
//   },
//   "group": "pb-17",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nМы узнаем: n  - как получить допуск к дипломной работе;n  - что из себя представляет дипломный проект и кто поможет нам в работе над ним;n  - Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса.nnБудем рады видеть вас онлайн!",
//   "id": "af49a430-fbdb-11ea-ae32-fbf328c00f6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6855d2dd0ecf0017e131ea"
//   },
//   "group": "ios-6",
//   "date": "2020-09-21",
//   "time": "18:00",
//   "teacher": "Артём Новичков",
//   "lecture": "Навигация в iOS и жизненный цикл UIViewController",
//   "additional": "Ждем вас онлайн.",
//   "id": "df0a5f70-fbdb-11ea-ae32-fbf328c00f6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6855f6dd0ecf0017e131eb"
//   },
//   "group": "ios-7",
//   "date": "2020-09-21",
//   "time": "19:00",
//   "teacher": "Алексей Рочев",
//   "lecture": "Наследование. Переопределение",
//   "additional": "Ждем вас онлайн.",
//   "id": "f45e93f0-fbdb-11ea-ae32-fbf328c00f6d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f696eb272f6b20017a8bcf2"
//   },
//   "group": "java qa-9",
//   "date": "2020-09-22",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Наследование и расширяемость систем. Проблемы наследования",
//   "additional": "Ждём всех онлайн!",
//   "id": "49194690-fc83-11ea-8853-2f3efc537783",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f696eff72f6b20017a8bcf3"
//   },
//   "group": "1-ibnet",
//   "date": "2020-09-22",
//   "time": "19:00",
//   "teacher": "Евгений-Строев",
//   "lecture": "IPv4, IPv6",
//   "additional": "Ждём всех онлайн!",
//   "id": "76d4bbf0-fc83-11ea-8853-2f3efc537783",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f699e9272f6b20017a8bcf5"
//   },
//   "group": "ios-8",
//   "date": "2020-09-22",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Коллекции: массив, словарь. Обход по коллекциям на примере for-in",
//   "additional": "Ждем вас онлайн.",
//   "id": "d26cb280-fc9f-11ea-8853-2f3efc537783",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f699ea372f6b20017a8bcf6"
//   },
//   "group": "py-33",
//   "date": "2020-09-22",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Проектирование БД. Связи. 3НФ",
//   "additional": "Ждем вас онлайн.",
//   "id": "dc7e3640-fc9f-11ea-8853-2f3efc537783",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f699eb772f6b20017a8bcf7"
//   },
//   "group": "py-34",
//   "date": "2020-09-22",
//   "time": "20:00",
//   "teacher": "Артём Черняков",
//   "lecture": "ООП: объекты и классы. Взаимодействие между ними",
//   "additional": "Ждем вас онлайн.",
//   "id": "e84ea810-fc9f-11ea-8853-2f3efc537783",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6ba0352414d40017e86ad0"
//   },
//   "group": "iqa-12",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Инструменты тестирования для работы с документацией",
//   "additional": "Ждём всех онлайн!",
//   "id": "f8dc70d0-fdd1-11ea-9906-cbcba7db05bf",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c4d4a8a145d0017eabf5c"
//   },
//   "group": "ios-6",
//   "date": "2020-09-24",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Базовые UI компоненты",
//   "additional": "Ждем вас онлайн.",
//   "id": "23392500-fe39-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c4d658a145d0017eabf5d"
//   },
//   "group": "ios-8",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Кортеж и множество",
//   "additional": "Ждем вас онлайн.",
//   "id": "33275c70-fe39-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c4d898a145d0017eabf5e"
//   },
//   "group": "ios-7",
//   "date": "2020-09-24",
//   "time": "19:00",
//   "teacher": "Алексей Рочев",
//   "lecture": "Протоколы и расширения",
//   "additional": "Ждем вас онлайн.",
//   "id": "48a18f80-fe39-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c4d9f8a145d0017eabf5f"
//   },
//   "group": "py-34",
//   "date": "2020-09-24",
//   "time": "20:00",
//   "teacher": "Артем Черняков",
//   "lecture": "ООП: наследование, инкапсуляция и полиморфизм",
//   "additional": "Ждем вас онлайн.",
//   "id": "55c70a00-fe39-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c66ec8a145d0017eabf61"
//   },
//   "group": "java-16",
//   "date": "2020-09-29",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Первая программа на Java",
//   "additional": "n",
//   "id": "6a7a1eb0-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c67048a145d0017eabf62"
//   },
//   "group": "java-16",
//   "date": "2020-10-01",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Структура программы",
//   "additional": "n",
//   "id": "78bc53d0-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c67398a145d0017eabf63"
//   },
//   "group": "java-16",
//   "date": "2020-10-06",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Условные операторы и циклы",
//   "additional": "n",
//   "id": "98175db0-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c674e8a145d0017eabf64"
//   },
//   "group": "java-16",
//   "date": "2020-10-07",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "n",
//   "id": "a4d62720-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c67608a145d0017eabf65"
//   },
//   "group": "java-16",
//   "date": "2020-10-08",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Типы данных в Java: примитивы",
//   "additional": "n",
//   "id": "af955000-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c67748a145d0017eabf66"
//   },
//   "group": "java-16",
//   "date": "2020-10-13",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Типы данных в Java: объекты",
//   "additional": "n",
//   "id": "bb6f85d0-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c67968a145d0017eabf67"
//   },
//   "group": "java-16",
//   "date": "2020-10-16",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структура класса",
//   "additional": "n",
//   "id": "d00b8de0-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c67aa8a145d0017eabf68"
//   },
//   "group": "java-16",
//   "date": "2020-10-20",
//   "time": "20:00",
//   "teacher": "Анатолий Корсаков",
//   "lecture": "Разбор задач и основы работы в IDE",
//   "additional": "n",
//   "id": "db66cfb0-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c67d48a145d0017eabf69"
//   },
//   "group": "java-16",
//   "date": "2020-10-27",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Массивы одномерные",
//   "additional": "n",
//   "id": "f4a27790-fe48-11ea-8ced-c7b04a99f8e0",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f6c67ea8a145d0017eabf6a"
//   },
//   "group": "java-16",
//   "date": "2020-10-30",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Массивы многомерные",
//   "additional": "n",
//   "id": "01da68a0-fe49-11ea-8ced-c7b04a99f8e0",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f6c68b48a145d0017eabf6b"
//   },
//   "group": "jd-2",
//   "date": "2020-09-28",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Порождающие шаблоны. Builder, Singleton, Factory Method, Abstract Factory, Prototype",
//   "additional": "n",
//   "id": "7a5526d0-fe49-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c68cb8a145d0017eabf6c"
//   },
//   "group": "jd-2",
//   "date": "2020-10-01",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Структурные шаблоны. Adapter, Proxy, Decorator, Facade, Flyweight",
//   "additional": "n",
//   "id": "87fb9120-fe49-11ea-8ced-c7b04a99f8e0",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f6c68e08a145d0017eabf6d"
//   },
//   "group": "jd-2",
//   "date": "2020-10-05",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Поведенческие шаблоны. Command, CoR, Observer, Iterator",
//   "additional": "n",
//   "id": "94424460-fe49-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6c68f38a145d0017eabf6e"
//   },
//   "group": "jd-2",
//   "date": "2020-10-09",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Magics, DRY, SOLID",
//   "additional": "n",
//   "id": "9f987d20-fe49-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6cdc1c8a145d0017eabf75"
//   },
//   "group": "virt-1",
//   "date": "2020-09-28",
//   "time": "20:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Контейнеризация на примере Docker",
//   "additional": "nНа занятии вы:n-познакомитесь с основными системами управления виртуализацией, их классификацией, преимуществами и недостатками каждой из них, а также понятием гипервизора и его типами;n-узнаете о более комплексном подходе для виртуализации таким, как инфраструктура как сервис и его реализациях в виде публичных и приватных облаков nnnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "43ab91b0-fe8e-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6cdc638a145d0017eabf76"
//   },
//   "group": "virt-1",
//   "date": "2020-10-05",
//   "time": "20:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Практические навыки работы с Docker",
//   "additional": "nНа лекции вы:n-познакомитесь с синтаксисом Dockerfile и принципами корректного использования основных инструкций;n-научитесь собирать и публиковать образ;n-научитесь реализовывать манифесты Dockerfile и собирать соответствующие образы по практическим задачам. nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "6df9ccc0-fe8e-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6cdf948a145d0017eabf77"
//   },
//   "group": "devops-3",
//   "date": "2020-09-28",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Введение в DevOps",
//   "additional": "nНа вебинаре вы:n-обсудите принципы учебы на курсе;n-разберётесь, что включает в себя DevOps;n-поговорите об  инструментах;n-разберётесь в основных подходах к разработке.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "5506b4b0-fe90-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6cdfd08a145d0017eabf78"
//   },
//   "group": "devops-3",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Системы контроля версий",
//   "additional": "nНа вебинаре вы научитесь:n-создавать и клонировать репозитории;n-определять и изменять состояния файлов;n-записывать изменения в репозиторий;n-удалять и перемещать файлы в репозитории.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "7912c380-fe90-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6cdffb8a145d0017eabf79"
//   },
//   "group": "devops-3",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Основы Git",
//   "additional": "nНа лекции вы научитесь:n-работать с историей коммитов;n-отменять изменения;n-работать с удаленными репозиториями;n-создавать и использовать теги;n-работать с ветвлениями.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9236ebc0-fe90-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6ce0478a145d0017eabf7a"
//   },
//   "group": "devops-3",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Ветвления в Git",
//   "additional": "nНа лекции вы:n-узнаете, как работают ветки и мержи;n-научитесь работать с удаленными ветками;n-освоите инструмент Rebase;n-узнаете, как использовать хуки.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c015eeb0-fe90-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6ce0788a145d0017eabf7b"
//   },
//   "group": "devops-3",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Андрей Борю",
//   "lecture": "Инструменты Git",
//   "additional": "nНа лекции вы научитесь:n-работать с полными и сокращенными хэшами ревизий;n-работать с диапазоном коммитов;n-“прятать” изменения локально и удалять все лишние файлы;n-поиску виновных в ошибках, поиск текста в коде и истории коммитов;n-отменять коммиты и исправлять историю. nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "dcd62970-fe90-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6ce0ac8a145d0017eabf7c"
//   },
//   "group": "devops-3",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Работа в терминале (лекция 1)",
//   "additional": "nНа лекции вы:n-познакомитесь с терминалом и интерактивным режимом командной строки;n-узнаете о некоторых особенностях стандарта FHS;n-научитесь перемещаться по директориям, создавать, перемещать и удалять их;  делать аналогичные действия с файлами;n-научитесь просматривать файлы разными способами;n-научитесь искать документацию встроенными средствами ОС;n-научитесь изменять рабочее окружение для удобства;n-научитесь управлять выполняемыми задачами и планировать выполнение в будущем.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "fbe165a0-fe90-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6ce0db8a145d0017eabf7d"
//   },
//   "group": "devops-3",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Роман Гершкович",
//   "lecture": "Работа в терминале (лекция 2)",
//   "additional": "nНа лекции вы узнаете о:n-процессах и некоторых их атрибутах;n-предоставляемых операционной системой абстракциях на примере стандартных потоков ввода-вывода;n-служебных файловых системах /dev и /proc;n-том, как посмотреть открытые процессом файлы с помощью lsof;n-развитии и типах терминалов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "17d72470-fe91-11ea-8ced-c7b04a99f8e0",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f6d02b48a145d0017eabf7e"
//   },
//   "group": "java qa-9",
//   "date": "2020-09-25",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Исключительные ситуации и их обработка. Тестирование исключений.",
//   "additional": "Ждём всех онлайн!",
//   "id": "44edb730-fea5-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6d02d88a145d0017eabf7f"
//   },
//   "group": "java qa-10",
//   "date": "2020-09-25",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Исключительные ситуации и их обработка. Тестирование исключений.",
//   "additional": "Ждём всех онлайн!",
//   "id": "59f09760-fea5-11ea-8ced-c7b04a99f8e0",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6da3889b48270017298023"
//   },
//   "group": "py-33",
//   "date": "2020-09-25",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Select-запросы, выборки из одной таблицы",
//   "additional": "Ждём вас онлайн.",
//   "id": "21644440-ff05-11ea-a9bd-6d63596ccf8e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6da4279b48270017298024"
//   },
//   "group": "py-34",
//   "date": "2020-09-25",
//   "time": "20:00",
//   "teacher": "Артем Черняков",
//   "lecture": "ООП: наследование, инкапсуляция и полиморфизм",
//   "additional": "Ждем вас онлайн.",
//   "id": "7fd33950-ff05-11ea-a9bd-6d63596ccf8e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6e1c139b48270017298026"
//   },
//   "group": "onec-2",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Базовые понятия учета",
//   "additional": "nНа лекции вы узнаете:n-зачем нужна двойная запись;n-что такое счета и проводки;n-что такое активы и пассивы, и как их изменяет дебет и кредит проводок;n-как выглядит и из чего собирается баланс.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях",
//   "id": "fa5763d0-ff4c-11ea-a9bd-6d63596ccf8e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6e1c4a9b48270017298027"
//   },
//   "group": "onec-2",
//   "date": "2020-10-05",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Планы счетов и регистры бухгалтерии",
//   "additional": "nНа занятии вы узнаете:n-что такое план счетов и регистр бухгалтерии;n-что такое субсчета и забалансовые счета;n-на что влияют признаки учета;n-как формировать проводки по регистрам с корреспонденцией и без нее.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "1b768be0-ff4d-11ea-a9bd-6d63596ccf8e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6e1c8a9b48270017298028"
//   },
//   "group": "onec-2",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Субконто",
//   "additional": "nНа лекции вы узнаете:n-что такое план видов характеристик и субконто;n-как указать привязать план счетов к плану видов характеристик и задать виды субконто у счета;n-на что влияют признаки учета субконто;n-как заполнять субконто при формировании проводок.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях",
//   "id": "41cf22c0-ff4d-11ea-a9bd-6d63596ccf8e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6e1cb59b48270017298029"
//   },
//   "group": "onec-2",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Виртуальные таблицы остатков и оборотов",
//   "additional": "nНа занятии вы узнаете:n-каковы реальные таблицы регистра бухгалтерии;n-каковы его виртуальные таблицы;n-как использовать их в запросах, задавая параметры.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "5ae408c0-ff4d-11ea-a9bd-6d63596ccf8e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6f2b4b926435553c9d7fc0"
//   },
//   "group": "test",
//   "date": "2020-09-27",
//   "time": "23:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Базовый синтаксис",
//   "additional": "На лекции вы узнаете:n1. Переменные и константы, допустимые имена, правила именованияn2. Выражения, операторы и операндыn3. DevTools и console.logn4. Числаn5. Строки",
//   "id": "a338cf10-ffee-11ea-8d71-ef129ab9a30b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6f30c98ef4d65574d497c6"
//   },
//   "group": "unknown",
//   "date": "2020-09-27",
//   "time": "15:14",
//   "teacher": "234234",
//   "lecture": "5435345",
//   "additional": "asdasd",
//   "id": "e93f1c50-fff1-11ea-bd51-6fdd16cac624",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f6f318a9a8bc366d4d85c20"
//   },
//   "group": "unknown",
//   "date": "2020-09-26",
//   "time": "15:18",
//   "teacher": "234234",
//   "lecture": "234234",
//   "additional": "234234",
//   "id": "5c562760-fff2-11ea-a827-2190bc59c853",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70c9d6b6e26a00174d6c5b"
//   },
//   "group": "ajs-10",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Регулярные выражения",
//   "additional": "На лекции разберем:n- регулярные выраженияn- методы объекта Regexp и StringnА также поговорим о том, когда метод Regexp использовать не стоит",
//   "id": "b9738ac0-00e5-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70ca0ab6e26a00174d6c5c"
//   },
//   "group": "ajs-10",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Контейнеры",
//   "additional": "На лекции разберем:n- Setn- Mapn- WeakSet, WeakMap",
//   "id": "d83bca80-00e5-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70ca70b6e26a00174d6c5d"
//   },
//   "group": "bhj-13",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Изменение структуры HTML-документа",
//   "additional": "На лекции мы познакомимся с содержимым HTML-документа, узнаем о представлении элемента и научимся управлять различными элементами. Не пропустите вебинар, чтобы задать интересующие вопросу лектору лично.n",
//   "id": "1544ca80-00e6-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70ca8bb6e26a00174d6c5e"
//   },
//   "group": "bhj-13",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Асинхронные запросы",
//   "additional": "Преподаватель расскажет нам о принципах асинхронности, рассмотрит FormData и отправку данных формы. И это только небольшая часть того, что будет освещено на лекции. Приходите, будет увлекательно!n",
//   "id": "25240dd0-00e6-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70caabb6e26a00174d6c5f"
//   },
//   "group": "bjs-15",
//   "date": "2020-09-29",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Базовый синтаксис",
//   "additional": "На лекции вы узнаете:n1. Переменные и константы, допустимые имена, правила именованияn2. Выражения, операторы и операндыn3. DevTools и console.logn4. Числаn5. Строки",
//   "id": "387f3170-00e6-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70caf3b6e26a00174d6c60"
//   },
//   "group": "bjs-15",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Расширенный синтаксис JavaScript",
//   "additional": "На лекции вы узнаете:n1. Современный стандарт, ""use strict""n2. Операторы разделителиn3. Типы данных null и undefinedn4. Управляющие конструкцииn5. Массивы, циклы",
//   "id": "63a15e50-00e6-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70cb09b6e26a00174d6c61"
//   },
//   "group": "ra-24",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Redux",
//   "additional": "На занятии вы познакомитесь сn- Reduxn- React Reduxn- Хуками useSelector , useDispatchn- connectnЖдем вас на вебинаре!",
//   "id": "70c13380-00e6-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70cb23b6e26a00174d6c62"
//   },
//   "group": "ra-24",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Redux и Redux Thunk",
//   "additional": "На вебинаре лектор познакомит вас с:n- Reduxn- React Reduxn- хуками useSelector , useDispatchn- connectn- асинхронными действиямиn- Middlewaren- Redux ThunknЖдем вас на вебинаре, будет интересно!",
//   "id": "7ff39500-00e6-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70cb43b6e26a00174d6c63"
//   },
//   "group": "ahj-8",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Geolocation, Notification, Media",
//   "additional": "На занятии вы узнаете:n- все про Geolocation и Notification API;n- а также про спецификацию Media Capture & Streams.",
//   "id": "932844e0-00e6-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f70cb61b6e26a00174d6c64"
//   },
//   "group": "ahj-8",
//   "date": "2020-10-01",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "RxJS",
//   "additional": "На занятии вы узнаете:n- что такое синхронная функция, callback, Promise;n- что делать когда данных много?tttttn- про паттерн Observer;ttttn- как может помочь RxJS.",
//   "id": "a4c25790-00e6-11eb-8959-f985b18dd7a2",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7193313a5c2e0017c12594"
//   },
//   "group": "py-34",
//   "date": "2020-09-28",
//   "time": "19:00",
//   "teacher": "Дмитрий Демидов",
//   "lecture": "Открытие и чтение файла, запись в файл",
//   "additional": "Ждем вас онлайн.",
//   "id": "bdef8770-015d-11eb-98ce-553304690c22",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7193483a5c2e0017c12595"
//   },
//   "group": "ios-8",
//   "date": "2020-09-28",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Функции и области видимости",
//   "additional": "Ждем вас онлайн.",
//   "id": "cbc1e3c0-015d-11eb-98ce-553304690c22",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7193893a5c2e0017c12596"
//   },
//   "group": "ios-3",
//   "date": "2020-09-28",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 3",
//   "additional": "Ждем вас онлайн.",
//   "id": "f244bef0-015d-11eb-98ce-553304690c22",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f71959d3a5c2e0017c12598"
//   },
//   "group": "ios-9",
//   "date": "2020-09-28",
//   "time": "18:00",
//   "teacher": "Артем Новичков",
//   "lecture": "Вебинар по теме Среда разработки и основные понятия",
//   "additional": "Ждем вас онлайн.",
//   "id": "2fb60130-015f-11eb-98ce-553304690c22",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f72544e3e630f0017b91d65"
//   },
//   "group": "1-ibnet",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Роман Жуков",
//   "lecture": "VPN и IPSec",
//   "additional": "Ждём всех онлайн!",
//   "id": "d8aa0ae0-01d0-11eb-9085-a75abfb0cae4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7255223e630f0017b91d66"
//   },
//   "group": "java qa-9",
//   "date": "2020-09-29",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Интерфейсы для организации малой связности. Обобщённое программирование (Generics)",
//   "additional": "Ждём всех онлайн!",
//   "id": "5729ec50-01d1-11eb-9085-a75abfb0cae4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7255523e630f0017b91d67"
//   },
//   "group": "java qa-10",
//   "date": "2020-09-29",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Интерфейсы для организации малой связности. Обобщённое программирование (Generics)",
//   "additional": "Ждём всех онлайн!",
//   "id": "7394db20-01d1-11eb-9085-a75abfb0cae4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7255913e630f0017b91d68"
//   },
//   "group": "aqa-8",
//   "date": "2020-09-29",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Docker и Docker Compose",
//   "additional": "Ждём всех онлайн!",
//   "id": "993ac3d0-01d1-11eb-9085-a75abfb0cae4",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f72ad5adec31c00172f0921"
//   },
//   "group": "unknown",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Василий Дорохин",
//   "lecture": "Интерфейсы для организации малой связности. Обобщённое программирование (Generics)",
//   "additional": "Ждём всех онлайн!",
//   "id": "ec6f9600-0205-11eb-aaa1-8f52c19e42cc",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f72dd2ddec31c00172f0923"
//   },
//   "group": "ios-4",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Разбор вопросов по курсовому заданию",
//   "additional": "Ждем вас онлайн.",
//   "id": "6dc012e0-0222-11eb-aaa1-8f52c19e42cc",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f72dd5adec31c00172f0924"
//   },
//   "group": "ios-7",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Алексей Рочев",
//   "lecture": "Как создавать свои ошибки",
//   "additional": "Ждем вас онлайн.",
//   "id": "88a1f0b0-0222-11eb-aaa1-8f52c19e42cc",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f72dd77dec31c00172f0925"
//   },
//   "group": "ios-6",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Артем Новичков",
//   "lecture": "Верстка экранов для iOS. Auto Layout",
//   "additional": "Ждем вас онлайн.",
//   "id": "99a345d0-0222-11eb-aaa1-8f52c19e42cc",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f72dd92dec31c00172f0926"
//   },
//   "group": "ios-9",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "Ждем вас онлайн.",
//   "id": "a9e28370-0222-11eb-aaa1-8f52c19e42cc",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f735702dec31c00172f0929"
//   },
//   "group": "ago-1",
//   "date": "2020-09-29",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Микросервисы: Synchronous Communication",
//   "additional": "nЖдём вас на занятии. Свои вопросы и пожелания оставляйте в комментариях.",
//   "id": "0bbe28e0-026b-11eb-aaa1-8f52c19e42cc",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7432988fe78600177cd7a8"
//   },
//   "group": "py-33",
//   "date": "2020-09-30",
//   "time": "19:00",
//   "teacher": "Олег Булыгин",
//   "lecture": "Группировки, выборки из нескольких таблиц",
//   "additional": "Ждем вас онлайн.",
//   "id": "edc4bb50-02ed-11eb-84cd-41f980fde7b5",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f746ed08fe78600177cd7a9"
//   },
//   "group": "onec-4",
//   "date": "2020-10-12",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Документы",
//   "additional": "nНа лекции вы:n-узнаете, что такое документы, изучите структуру документа;n-изучите реквизиты;n-изучите табличные части;n-узнаете, какие бывают формы;n-узнаете, для чего нужны команды и макеты.nnНаучитесь:n-создавать печатные формы документов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "d284fbb0-0311-11eb-84cd-41f980fde7b5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7470488fe78600177cd7aa"
//   },
//   "group": "onec-4",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Табличные части",
//   "additional": "nНа лекции вы узнаете:n-что такое табличная часть и командная панель документа;n-о взаимодействии с реквизитами в ТЧ.nnНаучитесь:n-создавать и изменять командную панель и табличную часть документа;n-обращаться к ТЧ с клиента и сервера.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b2a255d0-0312-11eb-84cd-41f980fde7b5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7470d08fe78600177cd7ab"
//   },
//   "group": "onec-4",
//   "date": "2020-10-19",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Проведение и движение",
//   "additional": "nНа занятии вы узнаете:n-что такое движения, режим записи документа;n-отличия оперативного и неоперативного проведений;n-отличие регистра накоплений и сведений;n-про активность в регистрах.nnНаучитесь:n-создавать движения документов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "03a48e30-0313-11eb-84cd-41f980fde7b5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f74710d8fe78600177cd7ac"
//   },
//   "group": "onec-4",
//   "date": "2020-10-26",
//   "time": "19:30",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nНа занятии вы узнаете:n-что такое виртуальные таблицы;n-как получать срез первых и срез последних.nnНаучитесь:n-строить простые отчеты по виртуальным таблицам регистров сведений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "27b38330-0313-11eb-84cd-41f980fde7b5",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7471278fe78600177cd7ad"
//   },
//   "group": "onec-4",
//   "date": "2020-10-29",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Последовательность и журналы",
//   "additional": "nНа занятии вы узнаете о:n-последовательности;n-хронологии;n-примерах использования;n-журналах документов.nnНаучитесь:n-создавать журналы документов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "37637920-0313-11eb-84cd-41f980fde7b5",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7471518fe78600177cd7ae"
//   },
//   "group": "onec-4",
//   "date": "2020-11-02",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Файлы",
//   "additional": "nНа вебинаре вы узнаете о (об):n-общих принципах работы с файлами;n-механизме временных файлов;n-принципе работы с интерактивным диалогом выбора файлов;n-передаче файлов с клиента на сервер и обратно.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "507096f0-0313-11eb-84cd-41f980fde7b5",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7471838fe78600177cd7af"
//   },
//   "group": "onec-4",
//   "date": "2020-11-05",
//   "time": "19:30",
//   "teacher": "Андрей Чередников",
//   "lecture": "Текстовые документы",
//   "additional": "nНа занятии вы узнаете о:n-текстовых документах;n-редакторе текста и модуля.nnНаучитесь:n-работать с текстовыми документами.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "6e4af440-0313-11eb-84cd-41f980fde7b5",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7471af8fe78600177cd7b0"
//   },
//   "group": "onec-4",
//   "date": "2020-11-09",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Двоичные данные",
//   "additional": "nНа лекции вы узнаете о:n-двоичных данных;n-хранилище значения;n-потоках.nnНаучитесь:n-работать с двоичными данными.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "88705fe0-0313-11eb-84cd-41f980fde7b5",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7472008fe78600177cd7b1"
//   },
//   "group": "onec-2",
//   "date": "2020-10-15",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Планы видов расчета и регистры расчета",
//   "additional": "nНа лекции вы узнаете:n-что такое план видов расчета и регистр расчета;n-что такое период действия и период регистрации;n-как настраиваются базовые виды расчета и ведущие виды расчета.nnНаучитесь:n-формировать простейшие движения по регистру расчета.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "b88bbe40-0313-11eb-84cd-41f980fde7b5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f74722f8fe78600177cd7b2"
//   },
//   "group": "onec-2",
//   "date": "2020-11-20",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Вытеснение",
//   "additional": "nНа занятии вы узнаете:n-что такое фактический период действия;n-как работает вытеснение и как при этом учитывается сторно.nnНаучитесь:n-получать данные графиков с учетом вытеснения;n-рассчитывать оплату по окладу с учетом фактически отработанного времени;n-получать базу для расчета;n-рассчитывать премию процентом от базы.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях",
//   "id": "d4dfc9b0-0313-11eb-84cd-41f980fde7b5",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f74727a8fe78600177cd7b4"
//   },
//   "group": "onec-2",
//   "date": "2020-10-23",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виртуальные таблицы",
//   "additional": "nНа занятии вы узнаете:n-что такое виртуальные таблицы;n-как получать срез первых и срез последних.nnНаучитесь:n-строить простые отчеты по виртуальным таблицам регистров сведений.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "0140df30-0314-11eb-84cd-41f980fde7b5",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7477998fe78600177cd7b6"
//   },
//   "group": "ago-1",
//   "date": "2020-10-02",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Микросервисы: Event-Driven Communication",
//   "additional": "nНа занятии вы:n-познакомитесь с event driven подходом;n-посмотрите на его реализацию на базе Apache Kafka.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "0f1752d0-0317-11eb-84cd-41f980fde7b5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f74a90c8fe78600177cd7b7"
//   },
//   "group": "qa-13-iqa",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "Ждём всех онлайн!",
//   "id": "88976ce0-0334-11eb-84cd-41f980fde7b5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f74a9a88fe78600177cd7b8"
//   },
//   "group": "aqa-8",
//   "date": "2020-10-01",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "SQL",
//   "additional": "Ждём всех онлайн!",
//   "id": "e51c1e20-0334-11eb-84cd-41f980fde7b5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f74aa2a8fe78600177cd7b9"
//   },
//   "group": "java qa-11",
//   "date": "2020-10-01",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Разбор задач",
//   "additional": "Ждём всех онлайн!",
//   "id": "32b0a700-0335-11eb-84cd-41f980fde7b5",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f75769cc085400017bf0327"
//   },
//   "group": "ios-9",
//   "date": "2020-10-01",
//   "time": "18:00",
//   "teacher": "Артем Новичков",
//   "lecture": "Знакомство со Swift в Playground. Переменные и константы. Числовые и строковые типы",
//   "additional": "Ждем вас онлайн.",
//   "id": "0ee486f0-03af-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f757747c085400017bf032a"
//   },
//   "group": "py-34",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Елена Никитина",
//   "lecture": "Работа с разными форматами данных",
//   "additional": "Ждем вас онлайн.",
//   "id": "74624710-03af-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f757af5c085400017bf032c"
//   },
//   "group": "dj-13",
//   "date": "2020-10-01",
//   "time": "19:00",
//   "teacher": "Максим Филипенко ",
//   "lecture": "Знакомство с Django. Подготовка и запуск проекта",
//   "additional": "Ждем вас онлайн.",
//   "id": "a5fe4010-03b1-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f757f0cc085400017bf032d"
//   },
//   "group": "ios-6",
//   "date": "2020-10-01",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "UITableView, UIScrollView, datasource и delegate",
//   "additional": "Ждем вас онлайн.n",
//   "id": "16627540-03b4-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759a3dc085400017bf032f"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-02",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Лямбда-выражения и функциональные интерфейсы",
//   "additional": "n",
//   "id": "4b4182f0-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759a52c085400017bf0330"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-09",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Stream API. Потоки, повторные вызовы, основные методы",
//   "additional": "n",
//   "id": "577a5380-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759a65c085400017bf0331"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-13",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Потоки ввода-вывода. Работа с файлами. Сериализация",
//   "additional": "n",
//   "id": "62ee9b90-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759a7ac085400017bf0332"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-16",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Сборка проектов. Maven и Gradle",
//   "additional": "n",
//   "id": "6f760150-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759a91c085400017bf0333"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-20",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Работа с файлами CSV, XML, JSON",
//   "additional": "n",
//   "id": "7d184cf0-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759aa5c085400017bf0334"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-23",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Тестирование кода и Unit-тесты",
//   "additional": "n",
//   "id": "88f31f00-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759abcc085400017bf0335"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-27",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Тестирование программы. Mockito",
//   "additional": "n",
//   "id": "96fc90e0-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759ad7c085400017bf0336"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-30",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Основы работы с сетью. Модель OSI",
//   "additional": "n",
//   "id": "a73bf590-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759aebc085400017bf0337"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-11-03",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Протокол HTTP. Вызовы удаленных серверов",
//   "additional": "n",
//   "id": "b30a6b90-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759b02c085400017bf0338"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-11-06",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "JVM. Организация памяти, сборщики мусора, VisualVM",
//   "additional": "n",
//   "id": "c0cd5e90-03c4-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759d18c085400017bf033a"
//   },
//   "group": "an_14_kt",
//   "date": "2020-10-05",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Рабочее окружение: Gradle, Plugins, IntelliJ IDEA",
//   "additional": "n",
//   "id": "feefa150-03c5-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759d39c085400017bf033b"
//   },
//   "group": "an_14_kt",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Отличия от Java: immutability, переменные, типы данных, операторы и приведение типов",
//   "additional": "n",
//   "id": "12c59a40-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759d4ec085400017bf033c"
//   },
//   "group": "an_14_kt",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Иван Лавров",
//   "lecture": "Управляющие конструкции: if, switch, циклы. Работа с отладчиком",
//   "additional": "n",
//   "id": "1f241b40-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759d63c085400017bf033d"
//   },
//   "group": "an_14_kt",
//   "date": "2020-10-15",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Функции, автотесты и Continuous Integration",
//   "additional": "n",
//   "id": "2b541230-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759d75c085400017bf033e"
//   },
//   "group": "an_14_kt",
//   "date": "2020-10-19",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "ООП: Объекты и классы",
//   "additional": "n",
//   "id": "364b6210-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f759d87c085400017bf033f"
//   },
//   "group": "an_14_kt",
//   "date": "2020-10-22",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "ООП: Композиция, наследование и интерфейсы",
//   "additional": "n",
//   "id": "40fc8130-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759d9ac085400017bf0340"
//   },
//   "group": "an_14_kt",
//   "date": "2020-10-26",
//   "time": "19:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Исключения",
//   "additional": "n",
//   "id": "4c98eab0-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759dafc085400017bf0341"
//   },
//   "group": "an_14_kt",
//   "date": "2020-10-29",
//   "time": "19:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Generics и коллекции",
//   "additional": "n",
//   "id": "58aa5d20-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759dc3c085400017bf0342"
//   },
//   "group": "an_14_kt",
//   "date": "2020-11-02",
//   "time": "19:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Лямбды, extension-функции, операторы",
//   "additional": "n",
//   "id": "64a169c0-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f759ddfc085400017bf0343"
//   },
//   "group": "an_14_kt",
//   "date": "2020-11-05",
//   "time": "19:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Sequences",
//   "additional": "n",
//   "id": "759a0c50-03c6-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a01cc085400017bf0344"
//   },
//   "group": "an_13_and",
//   "date": "2020-10-05",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Android Studio, SDK, эмулятор и первое приложение",
//   "additional": "n",
//   "id": "cb440560-03c7-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f75a02fc085400017bf0345"
//   },
//   "group": "an_13_and",
//   "date": "2020-10-09",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Ресурсы, View и ViewGroup",
//   "additional": "n",
//   "id": "d69471c0-03c7-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f75a040c085400017bf0346"
//   },
//   "group": "an_13_and",
//   "date": "2020-10-12",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "ConstraintLayout",
//   "additional": "n",
//   "id": "e0a1fde0-03c7-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f75a050c085400017bf0347"
//   },
//   "group": "an_13_and",
//   "date": "2020-10-15",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Обработка событий в Android",
//   "additional": "n",
//   "id": "e9f8bd20-03c7-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f75a061c085400017bf0348"
//   },
//   "group": "an_13_and",
//   "date": "2020-10-19",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Архитектура: MVVM",
//   "additional": "n",
//   "id": "f46c3700-03c7-11eb-b6ee-1dfad808df3d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f75a076c085400017bf0349"
//   },
//   "group": "an_13_and",
//   "date": "2020-10-22",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Отображение списков: RecyclerView",
//   "additional": "n",
//   "id": "007e1ea0-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a08bc085400017bf034a"
//   },
//   "group": "an_13_and",
//   "date": "2020-10-27",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "CRUD: списки, добавление, удаление, изменение, фильтрация",
//   "additional": "n",
//   "id": "0d20ad80-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a0a2c085400017bf034b"
//   },
//   "group": "an_13_and",
//   "date": "2020-11-05",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Material Design",
//   "additional": "n",
//   "id": "1b2f0160-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a0b6c085400017bf034c"
//   },
//   "group": "an_13_and",
//   "date": "2020-11-09",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Lifecycle и организация навигации (перемещение между Activity)",
//   "additional": "n",
//   "id": "26c0e390-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a0c9c085400017bf034d"
//   },
//   "group": "an_13_and",
//   "date": "2020-11-12",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "SharedPreferences, Intents",
//   "additional": "n",
//   "id": "31e84420-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a0dcc085400017bf034e"
//   },
//   "group": "an_13_and",
//   "date": "2020-11-16",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Fragments, FragmentManager",
//   "additional": "n",
//   "id": "3d6788b0-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a0eec085400017bf034f"
//   },
//   "group": "an_13_and",
//   "date": "2020-11-19",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "SQL и SQLite",
//   "additional": "n",
//   "id": "483c5c70-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a0ffc085400017bf0350"
//   },
//   "group": "an_13_and",
//   "date": "2020-11-23",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Библиотека Room",
//   "additional": "n",
//   "id": "52720a00-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f75a110c085400017bf0351"
//   },
//   "group": "an_13_and",
//   "date": "2020-11-26",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Notifications & Pushes",
//   "additional": "n",
//   "id": "5c7ed2d0-03c8-11eb-b6ee-1dfad808df3d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f76a2e2539be80017a47143"
//   },
//   "group": "ibb-2",
//   "date": "2020-10-02",
//   "time": "19:00",
//   "teacher": "Иван Чупров",
//   "lecture": "Симметричные криптосистемы",
//   "additional": "Ждём всех онлайн!",
//   "id": "0883bed0-0462-11eb-99ad-531f2e51139b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f76a319539be80017a47144"
//   },
//   "group": "iqa-12",
//   "date": "2020-10-02",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Жизненный цикл разработки ПО. Гибкие методологии разработки ПО",
//   "additional": "Ждём всех онлайн!",
//   "id": "29d3e1f0-0462-11eb-99ad-531f2e51139b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f76a353539be80017a47145"
//   },
//   "group": "java qa-9",
//   "date": "2020-10-02",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Collections Framework. CRUD и тестирование систем, управляющих набором объектов",
//   "additional": "Ждём всех онлайн!",
//   "id": "4be495f0-0462-11eb-99ad-531f2e51139b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f76a37c539be80017a47146"
//   },
//   "group": "java qa-10",
//   "date": "2020-10-02",
//   "time": "19:30",
//   "teacher": "Василий Дорохин",
//   "lecture": "Collections Framework. CRUD и тестирование систем, управляющих набором объектов",
//   "additional": "Ждём всех онлайн!",
//   "id": "64b54700-0462-11eb-99ad-531f2e51139b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f76d246539be80017a47148"
//   },
//   "group": "py-33",
//   "date": "2020-10-02",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Python и БД. ORM",
//   "additional": "Ждем всех онлайн.",
//   "id": "47e67c90-047e-11eb-99ad-531f2e51139b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f76d2be539be80017a47149"
//   },
//   "group": "ios-1",
//   "date": "2020-10-02",
//   "time": "18:00",
//   "teacher": "Разбор курсового задания",
//   "lecture": "Разбор курсового задания",
//   "additional": "Ждем вас онлайн.",
//   "id": "8f4471f0-047e-11eb-99ad-531f2e51139b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f76d384539be80017a4714b"
//   },
//   "group": "ios-1",
//   "date": "2020-10-02",
//   "time": "18:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Разбор курсового задания",
//   "additional": "Ждем вас онлайн.",
//   "id": "05ac0790-047f-11eb-99ad-531f2e51139b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7a1ca8c4cf2900178dc8f5"
//   },
//   "group": "ajs-10",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "ArrayBuffer",
//   "additional": "На лекции вы узнаете о:n- типизированных массивахn- ArrayBuffern- DataViewn- «многопоточности» в JSn- SharedArrayBuffer",
//   "id": "6141d750-0674-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a1ccbc4cf2900178dc8f6"
//   },
//   "group": "ajs-10",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Promises, async/await, timers and event loop",
//   "additional": "На лекции вы узнаете о:n- длительных операцияхn- Event Loopn- Web Workersn- CallBack Helln- Promisesn- async/awaitn- тестировании асинхронного кода",
//   "id": "768cbd00-0674-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a1ce4c4cf2900178dc8f7"
//   },
//   "group": "bhj-13",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Хранение состояния на клиенте и отправка на сервер",
//   "additional": "Преподаватель расскажет нам о document.cookie и localStorage. Осветит тему XHR: для чего и где используется. Приходите, будет интересно!n",
//   "id": "8569d290-0674-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a1cfbc4cf2900178dc8f8"
//   },
//   "group": "bhj-13",
//   "date": "2020-10-07",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "Мы узнаем, что из себя представляет дипломный проект и кто поможет нам в работе над ним. Поговорим про итоговый документ и обсудим другие вопросы, связанные с завершением курса. nБудем рады видеть вас онлайн!nn",
//   "id": "92c243f0-0674-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a1eccc4cf2900178dc8f9"
//   },
//   "group": "bhj-14",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "Возможности JavaScript в браузере",
//   "additional": "На этом занятии вы познакомитесь с:n1. Принципом построения DOM в браузереn2. С объектами HTML-теговn3. BOM. Объект WindownЖдём вас на вебинаре!",
//   "id": "a8466ca0-0675-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a1ee3c4cf2900178dc8fa"
//   },
//   "group": "bhj-14",
//   "date": "2020-10-09",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Способы поиска нужного HTML-элемента",
//   "additional": "Мы узнаем о $0 в консоли, познакомимся с HTMLCollection и различными доступами к элементам. Ждем вас на вебинаре!",
//   "id": "b584c650-0675-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a1efbc4cf2900178dc8fb"
//   },
//   "group": "bjs-15",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Типы данных",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Типы данныхn2. Примитивы и объекты. Данные по значению и по ссылкеn3. Обертки для примитивовn4. Методы типов данныхn5. Проверка и преобразование типов",
//   "id": "c42a2a10-0675-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a1f62c4cf2900178dc8fc"
//   },
//   "group": "bjs-15",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Функции, объекты в JavaScript",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Функцииn2. Аргументы и rest операторn3. Функциональные выраженияn4. Стрелочные функцииn5. Объекты и их свойства",
//   "id": "019a7760-0676-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a2186c4cf2900178dc8fe"
//   },
//   "group": "html-54",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Вводное занятие",
//   "additional": "На лекции будут раскрыты основные организационные моменты, с которыми вы столкнетесь во время учебы.",
//   "id": "480ba650-0677-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a21a4c4cf2900178dc8ff"
//   },
//   "group": "html-54",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Введение в HTML и CSS",
//   "additional": "На занятии преподаватель расскажет:n- что такое вёрстка и HTML;n- какие бывают теги;n- что такое CSS и для чего он нужен;n- как написать CSS-правило.",
//   "id": "59acbde0-0677-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a21b6c4cf2900178dc900"
//   },
//   "group": "html-54",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Контентные теги",
//   "additional": "На занятии преподаватель расскажет:n- какие есть теги для разметки контента на странице (заголовков, параграфов текста, картинок и т.д.);n- какие есть свойства у этих тегов;n- что такое селектор по идентификатору и селектор по классу и чем они отличаются.",
//   "id": "64d4bab0-0677-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a21f4c4cf2900178dc901"
//   },
//   "group": "mq-28",
//   "date": "2020-10-09",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Верстка резинового макета",
//   "additional": "Преподаватель расскажет вам, что из себя представляет резиновая верстка, затронет тему процентов как единиц измерения, а также особенности их применения в разных случаях. nТакже на этой лекции углубимся в технологию Флексбоксов. Разберёмся с основной и дополнительной осью, научимся выстраивать флекс-элементы в колонку одной строкой.nЖдём вас сегодня на открытии курса!",
//   "id": "89a726c0-0677-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a220cc4cf2900178dc902"
//   },
//   "group": "ra-24",
//   "date": "2020-10-05",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Redux Observable",
//   "additional": "На вебинаре лектор познакомит вас с:n1. RxJSn2. Observablen3. RxJS операторыn4. Higher Order Observablesn5. Redux Observablen6. Epicsn7. Обработка ошибокnnЖдем вас на вебинаре.",
//   "id": "983b2560-0677-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a2231c4cf2900178dc903"
//   },
//   "group": "ra-24",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Redux Saga",
//   "additional": "На вебинаре преподаватель расскажет о:n- Side Effectsn- Generatorsn- Redux Sagan- Sagasn- Effectsn- Watchers and Workersn- Вызове APIn- Обработке ошибокn- RetrynБудет интересно. Ждем вас на вебинаре!)",
//   "id": "ade4a5d0-0677-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a24bcc4cf2900178dc905"
//   },
//   "group": "1-ibnet",
//   "date": "2020-10-05",
//   "time": "18:00",
//   "teacher": "Роман Жуков",
//   "lecture": "Wi-Fi",
//   "additional": "Ждём всех онлайн!",
//   "id": "31d82370-0679-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a24eec4cf2900178dc906"
//   },
//   "group": "ibb-2",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Виктор Ерёменко",
//   "lecture": "Ассиметричные криптосистемы",
//   "additional": "Ждём всех онлайн!",
//   "id": "5002c3a0-0679-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a251fc4cf2900178dc907"
//   },
//   "group": "aqa-8",
//   "date": "2020-10-05",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Репортинг: Report Portal",
//   "additional": "Ждём всех онлайн!",
//   "id": "6d0d9bf0-0679-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a255ec4cf2900178dc908"
//   },
//   "group": "java qa-11",
//   "date": "2020-10-05",
//   "time": "19:30",
//   "teacher": "Любовь Маясова",
//   "lecture": "Объектно-ориентированное      программирование и проектирование",
//   "additional": "Ждём всех онлайн!",
//   "id": "92dba610-0679-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7a2581c4cf2900178dc909"
//   },
//   "group": "qa-13-iqa",
//   "date": "2020-10-05",
//   "time": "19:30",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Тестирование ПО. Многообразие тестирования",
//   "additional": "Ждём всех онлайн!",
//   "id": "a7aa56e0-0679-11eb-b9e2-59ff44fd1093",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7abf59e427650017630e39"
//   },
//   "group": "ago-1",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Микросервисы: Service Discovery, Distributed Tracing",
//   "additional": "nНа лекции вы:n-познакомитесь с Service Discovery и Distributed Tracing. Эти подходы позволяют удобнее конфигурировать и отлаживать микросервисы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "59dc1b90-06d5-11eb-a7e4-5dcfc07d4926",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7ace50e427650017630e3c"
//   },
//   "group": "ios-6",
//   "date": "2020-10-05",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "UITableView, UIScrollView, datasource и delegate",
//   "additional": "Ждем вас онлайн.n",
//   "id": "45937490-06de-11eb-a7e4-5dcfc07d4926",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7ace75e427650017630e3d"
//   },
//   "group": "ios-8",
//   "date": "2020-10-05",
//   "time": "19:00",
//   "teacher": "Максим Абакумов",
//   "lecture": "Основы ООП",
//   "additional": "Ждем вас онлайн.",
//   "id": "5b6898e0-06de-11eb-a7e4-5dcfc07d4926",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7acf43e427650017630e3e"
//   },
//   "group": "py-33",
//   "date": "2020-10-05",
//   "time": "19:30",
//   "teacher": "Евгений Шмаргунов",
//   "lecture": "Модули, пакеты, импорты в Python",
//   "additional": "Ждем вас онлайн.",
//   "id": "d6b7fae0-06de-11eb-a7e4-5dcfc07d4926",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7ae295e427650017630e3f"
//   },
//   "group": "jd_3_javacore",
//   "date": "2020-10-06",
//   "time": "20:00",
//   "teacher": "Никита Шумский",
//   "lecture": "Generics в коллекциях и методах",
//   "additional": "n",
//   "id": "5a879140-06ea-11eb-a7e4-5dcfc07d4926",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7b0e73e427650017630e44"
//   },
//   "group": "virt-1",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Типы и структура СУБД",
//   "additional": "nНа занятии вы:n-рассмотрите, какие бывают СУБД;n-научитесь определять тип СУБД по CAP/PACELC теоремам;n-ознакомитесь с понятием транзакций;n-узнаете, что такое ACID/BASE принципы;n-рассмотрите популярные NoSQL решения и их характеристики.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "7ff9e800-0704-11eb-a7e4-5dcfc07d4926",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7b0e99e427650017630e45"
//   },
//   "group": "virt-1",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "SQL",
//   "additional": "nНа лекции вы:n-узнаете, что такое SQL;n-ознакомитесь с базовыми операторами SQL;n-рассмотрите механизм связи таблиц в БД;n-научитесь делать сложные выборки;n-изучите механизм индексации данных;n-узнаете, как профилировать SQL запросы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "96c52c20-0704-11eb-a7e4-5dcfc07d4926",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7b0f2ae427650017630e47"
//   },
//   "group": "virt-1",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Работа с MySQL",
//   "additional": "nНа занятии вы узнаете, что MySQL:n-по теореме Брюера может быть как CA, так и CP системой;n-имеет множество “движков”, под разные виды задач;n-обеспечивает безопасность системой ACL;n-для восстановления используются файлы бэкапов и бинарные log-файлы;n-позволяет расширять свой функционал;n-в обеспечение производительности и отказоустойчивости возможны гибкие настройки шардинга и репликации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "ed4e7e20-0704-11eb-a7e4-5dcfc07d4926",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7b1005e427650017630e49"
//   },
//   "group": "bgo-2",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Андрей Богатырёв",
//   "lecture": "Работа с сетью, HTTP",
//   "additional": "nНа лекции вы:n-поговорите о сетевом взаимодействии;n-немного затронете протоколы ТСР/IС;n-начнете рассматривать НТТР.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "6fa88c80-0705-11eb-a7e4-5dcfc07d4926",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7b1050e427650017630e4a"
//   },
//   "group": "bgo-2",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Андрей Богатырёв",
//   "lecture": "HTTP: разработка клиента и интеграция со сторонними сервисами",
//   "additional": "nНа лекции вы:n-поговорите о том, как использовать НТТР для интеграции со сторонними сервисами.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9c9a2230-0705-11eb-a7e4-5dcfc07d4926",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7b1084e427650017630e4b"
//   },
//   "group": "bgo-2",
//   "date": "2020-10-20",
//   "time": "19:00",
//   "teacher": "Андрей Богатырёв",
//   "lecture": "HTTP: разработка сервера",
//   "additional": "nНа лекции вы:n-поговорите о том, как можно создавать Web APIn-сделаете первые шаги по получению работающего сервера, который развернёте в публичном облаке Heroku.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "bb99c5a0-0705-11eb-a7e4-5dcfc07d4926",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7c0b66a042de0017622a69"
//   },
//   "group": "ahj-8",
//   "date": "2020-10-07",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "WebWorkers, ServiceWorkers",
//   "additional": "На занятии вы узнаете:n- про API Web Workers и как он позволяет исполнять скрипты в фоновом режиме, независимо от скриптов, работающих с пользовательским интерфейсом;n- про ограничения связанные с Web Workers;n- посмотрите на примеры работы Worker’ов;n- а также узнаете как использовать Service Worker на практике.",
//   "id": "44cad180-079b-11eb-a149-6b7a47612f45",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7c1457a042de0017622a6a"
//   },
//   "group": "ios-9",
//   "date": "2020-10-06",
//   "time": "18:00",
//   "teacher": "Артём Новичков",
//   "lecture": "Логические типы и операции с ними",
//   "additional": "Ждем всех онлайн",
//   "id": "997d9c80-07a0-11eb-a149-6b7a47612f45",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7c1468a042de0017622a6b"
//   },
//   "group": "py-34",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Андрей Семакин",
//   "lecture": "Работа с библиотекой requests, http запросы",
//   "additional": "Ждем вас онлайн.",
//   "id": "a3772b70-07a0-11eb-a149-6b7a47612f45",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7c1488a042de0017622a6c"
//   },
//   "group": "dj-13",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Обработка запросов",
//   "additional": "Ждем вас онлайн.",
//   "id": "b6823340-07a0-11eb-a149-6b7a47612f45",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7c198aa042de0017622a6e"
//   },
//   "group": "qa-13-iqa",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "Ждём всех онлайн!",
//   "id": "b30b54a0-07a3-11eb-a149-6b7a47612f45",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7c1cb0a042de0017622a6f"
//   },
//   "group": "1-ibnet",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Андрей Прошин",
//   "lecture": "Работа сети Интернет (часть 1): BGP, DNS",
//   "additional": "Ждём всех онлайн!",
//   "id": "9348c470-07a5-11eb-a149-6b7a47612f45",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7c1e37a042de0017622a70"
//   },
//   "group": "iqa-12",
//   "date": "2020-10-06",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Разбор задач",
//   "additional": "Ждём всех онлайн!",
//   "id": "7c373310-07a6-11eb-a149-6b7a47612f45",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7d73241ef88b001779ed8e"
//   },
//   "group": "devops-2",
//   "date": "2020-10-14",
//   "time": "19:00",
//   "teacher": "Булат Замилов",
//   "lecture": "Разбор задач и ответы на вопросы",
//   "additional": "nНа занятии лектор разберёт домашние задания, вызвавшие у вас трудности при их решении, а также ответит на вопросы по пройденному материалу.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "b14c0cd0-0871-11eb-a75f-4717cf0bfaeb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7d821b1ef88b001779ed90"
//   },
//   "group": "onec-6",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Введение в платформу",
//   "additional": "nНа вебинаре вы узнаете о:n-том, что такое «платформа» и для чего она создавалась;n-предметно-ориентированном «Встроенном языке»;n-фирме «1С» и истории платформы;n-прикладных решениях;n-среде исполнения;n-лицензии и учебной версии;n-среде разработки;n-а также об информационной базе и конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9c9fc200-087a-11eb-a75f-4717cf0bfaeb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7d82521ef88b001779ed91"
//   },
//   "group": "onec-6",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Андрей Чередников",
//   "lecture": "Среда разработки и конфигурация",
//   "additional": "nНа лекции вы узнаете:n-что такое конфигуратор для чего его используют;n-конфигурации, модулях и основных свойствах конфигурации; n-видах и обновлениях конфигурации.nnНаучитесь:n-сравнивать и объединять;n-обновлять и проверять конфигурации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "bddaaf70-087a-11eb-a75f-4717cf0bfaeb",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7d82841ef88b001779ed92"
//   },
//   "group": "onec-6",
//   "date": "2020-10-26",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Дерево метаданных",
//   "additional": "nНа занятии вы узнаете:n-что такое дерево метаданных и объект метаданных;n-какими бывают общие метаданные;n-зачем нужны подсистемы, картинки, элементы стиля, функциональные опции, -константы, справочники и перечисления.nnК тому же вы научитесь:n-создавать функциональные опции и константы;n-создавать перечисления;n-создавать справочники.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "db418a70-087a-11eb-a75f-4717cf0bfaeb",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7d82ab1ef88b001779ed93"
//   },
//   "group": "onec-6",
//   "date": "2020-10-29",
//   "time": "19:30",
//   "teacher": "Андрей Чередников",
//   "lecture": "Виды клиентов и режимы работы",
//   "additional": "nНа занятии вы узнаете:n-что такое обычное и управляемое приложение;n-что такое управляемые формы;n-чем отличаются тонкий клиент, толстый клиент, веб-клиент и мобильный клиент.nnА так же научитесь:n-делать простейшие управляемые формы;n-публиковать веб-клиент.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "f2b6ca30-087a-11eb-a75f-4717cf0bfaeb",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7d82dc1ef88b001779ed94"
//   },
//   "group": "onec-6",
//   "date": "2020-11-02",
//   "time": "17:00",
//   "teacher": "Степан Шипицын",
//   "lecture": "Пользователи и отладка",
//   "additional": "nНа занятии вы узнаете:n-что такое пользователи ИБ и их роли;n-что такое журнал регистрации;n-что такое отладка и точка останова;n-что такое система взаимодействия.nnТакже научитесь:n-создавать пользователей ИБ, роли и назначать их пользователям;n-искать ошибки в журнале регистрации;n-использовать отладчик для расследования ошибок;n-подключать систему взаимодействия.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "0f9b55d0-087b-11eb-a75f-4717cf0bfaeb",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7d83071ef88b001779ed95"
//   },
//   "group": "onec-6",
//   "date": "2020-11-05",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Внешние отчеты, обработки и расширения",
//   "additional": "nНа занятии вы узнаете:n-что такое внешние отчеты и обработки, и в чем разница между ними;n-что такое расширения конфигурации.nnНаучитесь:n-создавать простейшие внешние отчеты, обработки и расширения.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "295136c0-087b-11eb-a75f-4717cf0bfaeb",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7ddb3a1ef88b001779ed96"
//   },
//   "group": "qa-13-iqa",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Анастасия Шарикова",
//   "lecture": "Артефакты тестирования. Дефекты",
//   "additional": "Ждём всех онлайн!",
//   "id": "bb704c10-08af-11eb-a75f-4717cf0bfaeb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7ddf211ef88b001779ed97"
//   },
//   "group": "java qa-9",
//   "date": "2020-10-08",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Основы автоматизации",
//   "additional": "Ждём всех онлайн!",
//   "id": "0f2d73d0-08b2-11eb-a75f-4717cf0bfaeb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7ddf541ef88b001779ed98"
//   },
//   "group": "java qa-10",
//   "date": "2020-10-08",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Основы автоматизации",
//   "additional": "Ждём всех онлайн!",
//   "id": "2d898440-08b2-11eb-a75f-4717cf0bfaeb",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7eae16c7a37f00176c9055"
//   },
//   "group": "ios-3",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 4",
//   "additional": "Ждем вас онлайн.",
//   "id": "6a470670-092d-11eb-b91b-1df5c1dbb585",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7eae58c7a37f00176c9056"
//   },
//   "group": "ios-8",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Максим Абакумов",
//   "lecture": "Объекты в ООП",
//   "additional": "Ждём вас онлайн.",
//   "id": "91b4dde0-092d-11eb-b91b-1df5c1dbb585",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7eae89c7a37f00176c9057"
//   },
//   "group": "py-33",
//   "date": "2020-10-08",
//   "time": "19:30",
//   "teacher": "Кирилл Табельский",
//   "lecture": "Итераторы, генераторы",
//   "additional": "Ждем вас онлайн.",
//   "id": "aedcb410-092d-11eb-b91b-1df5c1dbb585",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7eba8cc7a37f00176c9059"
//   },
//   "group": "ago-1",
//   "date": "2020-10-08",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Микросервисы: обеспечение безопасности",
//   "additional": "nНа занятии вы:n-познакомитесь с JWT (JSON Web Token) - компактное, URL-безопасное представление "утверждений" (claims) между двумя сторонами;n-узнаете про желательность использования стандарта TLS, пусть даже и с помощью самоподписанных сертификатов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "d77524a0-0934-11eb-b91b-1df5c1dbb585",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7ecad0c7a37f00176c905a"
//   },
//   "group": "an_13_and",
//   "date": "2020-10-30",
//   "time": "20:00",
//   "teacher": "Юрий Москалев",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "89691640-093e-11eb-b91b-1df5c1dbb585",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7ecae8c7a37f00176c905b"
//   },
//   "group": "an_13_and",
//   "date": "2020-11-30",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "980a0d30-093e-11eb-b91b-1df5c1dbb585",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7ecd75c7a37f00176c905c"
//   },
//   "group": "an_14_kt",
//   "date": "2020-11-10",
//   "time": "20:00",
//   "teacher": "Анатолий Спитченко",
//   "lecture": "Разбор задач",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "1cc399f0-0940-11eb-b91b-1df5c1dbb585",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f7ee416c7a37f00176c905e"
//   },
//   "group": "git-19",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Александр Ульянцев",
//   "lecture": "Разбор задач и вопросов",
//   "additional": "nПожалуйста напишите в треде под этим постом свои вопросы. А также самые сложные темы/моменты в заданиях.nТак мы сможем подготовить для вас полезный вебинар!",
//   "id": "99c21fa0-094d-11eb-b91b-1df5c1dbb585",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7f4807c7a37f00176c905f"
//   },
//   "group": "ibb-2",
//   "date": "2020-10-09",
//   "time": "19:00",
//   "teacher": "Роман Жуков",
//   "lecture": "Криптография: нормативное регулирование",
//   "additional": "Ждём всех онлайн!",
//   "id": "2c050c70-0989-11eb-b91b-1df5c1dbb585",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7f483cc7a37f00176c9060"
//   },
//   "group": "1-ibnet",
//   "date": "2020-10-09",
//   "time": "19:00",
//   "teacher": "Андрей Прошин",
//   "lecture": "Работа сети Интернет (часть 2): HTTP, HTTPS, HTTP2",
//   "additional": "Ждём всех онлайн!",
//   "id": "4b2493f0-0989-11eb-b91b-1df5c1dbb585",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7f4877c7a37f00176c9061"
//   },
//   "group": "aqa-8",
//   "date": "2020-10-09",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Заключительная лекция",
//   "additional": "Ждём всех онлайн!",
//   "id": "6e789d60-0989-11eb-b91b-1df5c1dbb585",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f7f48b0c7a37f00176c9062"
//   },
//   "group": "java qa-11",
//   "date": "2020-10-09",
//   "time": "19:30",
//   "teacher": "Любовь Маясова",
//   "lecture": "Объектно-ориентированное     программирование: ключевые принципы",
//   "additional": "Ждём всех онлайн!",
//   "id": "90c7b9f0-0989-11eb-b91b-1df5c1dbb585",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f800d6c9a81660017da3d49"
//   },
//   "group": "ios-9",
//   "date": "2020-10-09",
//   "time": "18:00",
//   "teacher": "Артём Новичков",
//   "lecture": "Преобразование типов. Условные конструкции",
//   "additional": "Ждем вас онлайн.",
//   "id": "d3fe1780-09fe-11eb-b53e-25623ec7c53d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f800d819a81660017da3d4a"
//   },
//   "group": "dj-13",
//   "date": "2020-10-09",
//   "time": "19:00",
//   "teacher": "Александр Иванов",
//   "lecture": "Динамическое формирование страниц на основе шаблонов",
//   "additional": "Ждем вас онлайн.",
//   "id": "e012be40-09fe-11eb-b53e-25623ec7c53d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8050c49a81660017da3d4c"
//   },
//   "group": "WM_60",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Дарья Смирнова",
//   "lecture": "Вводная лекция",
//   "additional": "n",
//   "id": "f7f16700-0a26-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8050e49a81660017da3d4d"
//   },
//   "group": "WM_60",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для разметки текста и аттрибуты",
//   "additional": "n",
//   "id": "0af3e350-0a27-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8050fa9a81660017da3d4e"
//   },
//   "group": "WM_60",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Семен Бойко",
//   "lecture": "Списки и таблицы",
//   "additional": "n",
//   "id": "17f0a020-0a27-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8051119a81660017da3d4f"
//   },
//   "group": "WM_60",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Селекторы и свойства",
//   "additional": "n",
//   "id": "256f1010-0a27-11eb-b53e-25623ec7c53d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8051269a81660017da3d50"
//   },
//   "group": "WM_60",
//   "date": "2020-10-26",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Оформление текстовых блоков с использованием CSS",
//   "additional": "n",
//   "id": "3243d280-0a27-11eb-b53e-25623ec7c53d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f80513d9a81660017da3d51"
//   },
//   "group": "WM_60",
//   "date": "2020-10-29",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Основы клиент-серверного взаимодействия",
//   "additional": "n",
//   "id": "3f7cfc10-0a27-11eb-b53e-25623ec7c53d",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f80775a9a81660017da3d53"
//   },
//   "group": "ajs-10",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Символы, итераторы, генераторы",
//   "additional": "На занятии вы узнаете:n- что такое символы и как их использоватьn- для чего нужны итераторыn- как реализовать свой итераторnА также познакомитесь с подпрограммами, тонкими материями генераторов.",
//   "id": "f78678c0-0a3d-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8079329a81660017da3d54"
//   },
//   "group": "ajs-10",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "TypeScript",
//   "additional": "На занятии вы познакомитесь с:n- TypeScriptn- рабочим окружениемn- типизациейn- интерфейсамиn- классами.",
//   "id": "109b1b30-0a3f-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8079799a81660017da3d55"
//   },
//   "group": "bhj-14",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Объект события",
//   "additional": "Преподаватель расскажет, какие проблемы может вызывать использование свойства onclick, и как по-другому можно назначить и удалить обработчики событий элемента. Подробно рассмотрим объект события, содержащий подробную информацию об обрабатываемом событии, свойства событий и обработку событий клавиатуры.nДо встречи на вебинаре!",
//   "id": "3b2b1a30-0a3f-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8079ed9a81660017da3d56"
//   },
//   "group": "bhj-14",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Илья Меджидов",
//   "lecture": "DOM",
//   "additional": "Мы познакомимся и научимся работать с событиями  загрузки DOM, навигацией, различными атрибутами. Приходите, будет интересно!",
//   "id": "803cfcb0-0a3f-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807a5a9a81660017da3d57"
//   },
//   "group": "bjs-15",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Прототип и конструктор объекта",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Контекст выполненияn2. Конструктор объектаn3. Прототип объектаn4. Конструктор Objectn5. Конструктор Date и его методыn6. Методы объекта Math",
//   "id": "c16c26c0-0a3f-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807a919a81660017da3d58"
//   },
//   "group": "bjs-15",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "ООП в JS (ES6)",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Классыn2. Свойстваn3. Конструктор, методы, статические методыn4. Наследование и supern5. Нововведения последних версий ES",
//   "id": "e1aef890-0a3f-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807acd9a81660017da3d59"
//   },
//   "group": "html-54",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "На занятии вы узнаете как правильно искать информацию на просторах интернета и пользоваться ей.",
//   "id": "05e8ce20-0a40-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807b109a81660017da3d5a"
//   },
//   "group": "html-54",
//   "date": "2020-10-14",
//   "time": "19:00",
//   "teacher": "Денис Ежков",
//   "lecture": "Теги для вёрстки структуры контента",
//   "additional": "На занятии лектор расскажет:n- про группировку элементов на странице;n- как правильно задавать имена для классов;n- про теги, которые отвечают за структуру страницы;n- чем отличаются блочные и строчные элементы, и как их центрировать на странице.",
//   "id": "2d7d4060-0a40-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807b3f9a81660017da3d5b"
//   },
//   "group": "html-54",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Позиционирование блочных элементов",
//   "additional": "На занятии Семён Бойко расскажет:n- про flex-контейнеры и их особенности;n- про элементы nav, header и footer;n- про схлопывание отступов.",
//   "id": "49ca9510-0a40-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807bb59a81660017da3d5c"
//   },
//   "group": "mq-28",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Резиновые изображения",
//   "additional": "На этом занятии преподаватель познакомит вас с полезной функцией calc() для расчёта размеров. Вы рассмотрите понятие резиновых изображений и узнаете, в чём заключаются отличия в использовании контентных и фоновых изображений. 😉nТакже будут затронуты особенности применения протоколов mailto и tel в HTML-элементах и вопросы взаимодействия с дизайнером по размерам изображений для резиновой верстки. nЖдём вас на лекции!",
//   "id": "900a7040-0a40-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807c179a81660017da3d5d"
//   },
//   "group": "mq-28",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Введение в медиазапросы",
//   "additional": "Следующий пункт нашего путешествия – освоение мобильной вёрстки. На занятии преподаватель расскажет вам о мобильной версии как подходе к верстке, плюсах и минусах этого подхода, разберёт медиазапросы для различных типов устройств и особенности их использования. nТакже будет уделено внимание специальному режиму эмуляции устройств в веб-инспекторе браузера для тестирования отображения сайта в различных условиях. И в дополнение к изученным ранее свойствам Flexbox будут ещё рассмотрено такое полезное свойство как flex-wrap, которое отвечает за перенос строк внутри флекс-контейнера. nЖдём вас на лекции!",
//   "id": "caacd080-0a40-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807c739a81660017da3d5e"
//   },
//   "group": "ahj-9",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Рабочее окружение",
//   "additional": "На занятии вы узнаете:n- про пакетные менеджеры: npm, yarn;n- про необходимые инструменты разработки;n- а также про тестирование, сборку и deployment.n",
//   "id": "0159b3a0-0a41-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807ca89a81660017da3d5f"
//   },
//   "group": "ahj-9",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Работа с DOM (объектная модель документа)",
//   "additional": "На занятии вы узнаете:n- про browser environment;n- про обработку документа;n- что такое интерфейсы и базовые селекторы;n- а также про атрибуты.",
//   "id": "21113560-0a41-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807cfa9a81660017da3d60"
//   },
//   "group": "ahj-8",
//   "date": "2020-10-12",
//   "time": "18:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "51d57df0-0a41-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f807d2e9a81660017da3d61"
//   },
//   "group": "ra-24",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "70a9a490-0a41-11eb-b53e-25623ec7c53d",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f83f89d6b3f750017f42ae9"
//   },
//   "group": "ago-1",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Даниил Зиненко",
//   "lecture": "Kubernetes: основы",
//   "additional": "nНа лекции вы:n-кратко познакомитесь с Kubernetes —  инструментом для оркестрации контейнеров;n-в рамках ДЗ осуществите пошаговую настройку и развёртывание своего первого сервиса в кластере Kubernetes.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c6ee3c20-0c54-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8404b66b3f750017f42aed"
//   },
//   "group": "ios-6",
//   "date": "2020-10-12",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "CollectionView",
//   "additional": "Ждем вас онлайн.",
//   "id": "fc93bd30-0c5b-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8404cb6b3f750017f42aee"
//   },
//   "group": "py-34",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Дмитрий Демидов",
//   "lecture": "Работа с классами на примере API VK",
//   "additional": "Ждем вас онлайн.n",
//   "id": "090c07c0-0c5c-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8404d66b3f750017f42aef"
//   },
//   "group": "dj-13",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Работа с ORM",
//   "additional": "Ждем вас онлайн.",
//   "id": "0fdc4330-0c5c-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8404e56b3f750017f42af0"
//   },
//   "group": "py-35",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Евгений Шмаргунов",
//   "lecture": "Python. Знакомство с консолью",
//   "additional": "Ждем вас онлайн.",
//   "id": "18749470-0c5c-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f841ad26b3f750017f42af2"
//   },
//   "group": "pb-18",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Базовые понятия. Переменные и числа",
//   "additional": "nДополнительные материалыnпочитать:nКак работает интернетnhttps://developer.mozilla.org/ru/docs/Learn/How_the_Internet_worksnВыражения и операторыnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/Expressions_and_Operators#%D0%9E%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80%D1%8B_%D0%BF%D1%80%D0%B8%D1%81%D0%B2%D0%B0%D0%B8%D0%B2%D0%B0%D0%BD%D0%B8%D1%8FnВведение в javascriptnhttps://learn.javascript.ru/intronnпосмотреть:nЕще одна лекция о числах в javascriptnhttps://www.youtube.com/watch?v=aGTjRU7Dp20&list=PLo6puixMwuSNxJCgadaaavKqq4-ocKPrRnКак работает javascriptnhttps://www.youtube.com/watch?v=H6G63NKRSi8&feature=youtu.benhttps://www.youtube.com/watch?v=fXi49EkrMPI",
//   "id": "2a625980-0c69-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f841b936b3f750017f42af3"
//   },
//   "group": "pb-18",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Логический тип и ветвление",
//   "additional": "nНа лекции мы узнаем:nкак делать программы нелинейными — выполнять различный блок кода в зависимости от состояния программыnкак удобно хранить информацию о признаках вида «да/нет»nчто такое логические операции.nnДополнительные материалы.nпочитать:nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Логические_операторыnhttps://learn.javascript.ru/logical-opsnhttps://learn.javascript.ru/comparisonnпосмотреть:nхороший обзор nhttps://www.youtube.com/watch?v=B4ZCFdrBmbEnеще один обзор с конкретными примерами, но уже на английскомnhttps://www.youtube.com/watch?v=2cGleL5FMZMnпараллельно даются несколько полезных советов для работы в консоле веб-разработчикаnhttps://www.youtube.com/watch?v=Gy87ZS5sb1w",
//   "id": "9d66ee00-0c69-11eb-b05d-8135900d0f1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f841ecd6b3f750017f42af4"
//   },
//   "group": "qa-13-iqa",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": " Анастасия Шарикова",
//   "lecture": "Артефакты тестирования. Тестовая документация",
//   "additional": "Ждём всех онлайн!",
//   "id": "89c4eb70-0c6b-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f841f566b3f750017f42af5"
//   },
//   "group": "java qa-11",
//   "date": "2020-10-12",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Объекты с внутренним состоянием, управление состоянием при тестировании",
//   "additional": "Ждём всех онлайн!",
//   "id": "db2a0450-0c6b-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f84224f6b3f750017f42af7"
//   },
//   "group": "sib-3-ibb",
//   "date": "2020-10-12",
//   "time": "19:00",
//   "teacher": "Роман Жуков",
//   "lecture": "Информационная безопасность",
//   "additional": "Ждём всех онлайн!",
//   "id": "a0a24610-0c6d-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f842f326b3f750017f42afa"
//   },
//   "group": "onec-5",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Антон Чаусов",
//   "lecture": "Интерфейс конфигурации",
//   "additional": "nНа вебинаре вы узнаете:n-из каких частей состоит управляемый интерфейс;n-как настраивается каждая часть интерфейса;n-как связаны подсистемы и пользовательский интерфейс;n-как команды размещаются в интерфейсе;n-как настроить расположение основных панелей;n-что такое команда и как она размещается в интерфейсе;n-что такое «основная форма;n-как настроить отображение названий объектов.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "4f27afc0-0c75-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f842f5d6b3f750017f42afb"
//   },
//   "group": "onec-5",
//   "date": "2020-10-26",
//   "time": "19:00",
//   "teacher": "Антон Чаусов",
//   "lecture": "Формы, их реквизиты и данные",
//   "additional": "nНа лекции вы узнаете:n-почему управляемая форма делится на серверную и клиентскую части;n-из каких частей состоит форма;n-что такое реквизиты формы;n-что такое элементы формы;n-что такое параметры формы;n-что такое команды формы;n-как располагать элементы горизонтально и выделять группы элементов визуально;n-как писать клиентские и серверные методы;n-что такое «с контекстом» и «без контекста».nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "69136dc0-0c75-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f842f886b3f750017f42afc"
//   },
//   "group": "onec-5",
//   "date": "2020-10-29",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Элементы управления",
//   "additional": "nНа лекции вы узнаете про:n-общие свойства элементов управления и их иерархию;n-декоративные элементы;n-флажки, переключатели, тумблеры;n-поля ввода и управляющие кнопки полей ввода;n-свойство «СписокВвода» и его влияние на элемент;n-механику выбора значений;n-страницы форм.  nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "825d9490-0c75-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f842fb66b3f750017f42afd"
//   },
//   "group": "onec-6",
//   "date": "2020-11-02",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Команды",
//   "additional": "nНа лекции вы:n-углубите знания по командам;n-изучите особенности модуля команд, директив компиляции;n-рассмотрите назначение параметра ПараметрыВыполненияКоманды;n-рассмотрите отличия общих (глобальных) команд и команд, подчиненных объекту метаданных;n-рассмотрите  командный интерфейс формы;n-рассмотрите  наиболее частые сценарии открытия форм из модуля команды;n-изучите служебные системные параметры открытия форм.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9dd94160-0c75-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f842fe36b3f750017f42afe"
//   },
//   "group": "onec-5",
//   "date": "2020-11-03",
//   "time": "19:00",
//   "teacher": "Алексей Павлов",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "nВы узнаете, что из себя представляет дипломная работа, и кто поможет вам в работе над ней. nПоговорите о сроках выполнения работы и обсудите другие вопросы, связанные с завершением первого блока на профессии «1С-разработчик».n nЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях",
//   "id": "b8d31400-0c75-11eb-b05d-8135900d0f1e",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f84c1096b3f750017f42b00"
//   },
//   "group": "java qa-9",
//   "date": "2020-10-13",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Управление состоянием, Continuous Integration",
//   "additional": "Ждём всех онлайн!",
//   "id": "3c8c2010-0ccc-11eb-b05d-8135900d0f1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f84c1326b3f750017f42b01"
//   },
//   "group": "java qa-10",
//   "date": "2020-10-13",
//   "time": "19:30",
//   "teacher": "Оксана Мельникова",
//   "lecture": "Управление состоянием, Continuous Integration",
//   "additional": "Ждём всех онлайн!",
//   "id": "555026f0-0ccc-11eb-b05d-8135900d0f1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f84c1736b3f750017f42b02"
//   },
//   "group": "ibb-2",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Роман Жуков",
//   "lecture": "Финансовые системы",
//   "additional": "Ждём всех онлайн!",
//   "id": "7b8be700-0ccc-11eb-b05d-8135900d0f1e",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8547cec72558001701e66b"
//   },
//   "group": "ios-9",
//   "date": "2020-10-13",
//   "time": "18:00",
//   "teacher": "Артем Новичков",
//   "lecture": "Опциональные типы и преобразование",
//   "additional": "Ждем вас онлайн.",
//   "id": "90d25180-0d1c-11eb-8084-1b271fe3630b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8547dfc72558001701e66c"
//   },
//   "group": "py-34",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Оксана Махонина",
//   "lecture": "Консультация по дипломной работе",
//   "additional": "Ждем вас онлайн.",
//   "id": "9b2b1770-0d1c-11eb-8084-1b271fe3630b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8547eac72558001701e66d"
//   },
//   "group": "py-35",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Валерий Хаслер",
//   "lecture": "Как правильно искать информацию?",
//   "additional": "Ждем вас онлайн.",
//   "id": "a195da50-0d1c-11eb-8084-1b271fe3630b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f854802c72558001701e66e"
//   },
//   "group": "ios-8",
//   "date": "2020-10-13",
//   "time": "19:00",
//   "teacher": "Максим Абакумов",
//   "lecture": "ООП: Интерфейс и реализация. Переопределение методов",
//   "additional": "Ждем вас онлайн.",
//   "id": "afeca8e0-0d1c-11eb-8084-1b271fe3630b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f85482fc72558001701e66f"
//   },
//   "group": "py-33",
//   "date": "2020-10-13",
//   "time": "19:30",
//   "teacher": "Кирилл Табельский",
//   "lecture": "Декораторы",
//   "additional": "Ждем вас онлайн.",
//   "id": "ca6f28a0-0d1c-11eb-8084-1b271fe3630b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f86bbd276a3ee0017eeac12"
//   },
//   "group": "onec-4",
//   "date": "2020-10-22",
//   "time": "18:30",
//   "teacher": "Матвей Серегин",
//   "lecture": "Формы документов",
//   "additional": "nНа лекции вы узнаете виды форм документов:n-форма документа;n-форма списка;n-форма выбора.nnНаучитесь: n-создавать формы документа.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "4e256230-0dfa-11eb-9238-753eddbf5ec8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f86bc8476a3ee0017eeac13"
//   },
//   "group": "onec-5",
//   "date": "2020-11-02",
//   "time": "19:00",
//   "teacher": "Станислав Вильф",
//   "lecture": "Команды",
//   "additional": "nНа лекции вы:n-углубите знания по командам;n-изучите особенности модуля команд, директив компиляции;n-рассмотрите назначение параметра ПараметрыВыполненияКоманды;n-рассмотрите отличия общих (глобальных) команд и команд, подчиненных объекту метаданных;n-рассмотрите  командный интерфейс формы;n-рассмотрите  наиболее частые сценарии открытия форм из модуля команды;n-изучите служебные системные параметры открытия форм.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "b806ca90-0dfa-11eb-9238-753eddbf5ec8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f875adc76a3ee0017eeac14"
//   },
//   "group": "qa-13-iqa",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Инструменты тестирования для работы с документацией",
//   "additional": "Ждём всех онлайн!",
//   "id": "1954fb10-0e59-11eb-9238-753eddbf5ec8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f875b1876a3ee0017eeac15"
//   },
//   "group": "1-ibnet",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Андрей Прошин",
//   "lecture": "Основы сетевой безопасности",
//   "additional": "Ждём всех онлайн!",
//   "id": "3cdee190-0e59-11eb-9238-753eddbf5ec8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f875b5b76a3ee0017eeac16"
//   },
//   "group": "java qa-9",
//   "date": "2020-10-15",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Тестирование веб-интерфейсов, Selenium и Selenide",
//   "additional": "Ждём всех онлайн!",
//   "id": "64fc0bd0-0e59-11eb-9238-753eddbf5ec8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f875b7e76a3ee0017eeac17"
//   },
//   "group": "java qa-10",
//   "date": "2020-10-15",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Тестирование веб-интерфейсов, Selenium и Selenide",
//   "additional": "Ждём всех онлайн!",
//   "id": "7a233ce0-0e59-11eb-9238-753eddbf5ec8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f87fea6ea959e00178ee321"
//   },
//   "group": "ios-6",
//   "date": "2020-10-15",
//   "time": "18:00",
//   "teacher": "Артем Новичков",
//   "lecture": "Жесты и анимация",
//   "additional": "Ждем вас онлайн.",
//   "id": "b96d3520-0eba-11eb-b18c-c572b85662e8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8800ffea959e00178ee323"
//   },
//   "group": "dj-13",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Работа с ORM, 2 часть",
//   "additional": "Ждем вас онлайн.",
//   "id": "1ff8c650-0ebc-11eb-b18c-c572b85662e8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f880ae0ea959e00178ee324"
//   },
//   "group": "ios-9",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Коллекции: массив, словарь. Обход по коллекциям на примере for-in",
//   "additional": "Ждем вас онлайн.",
//   "id": "032cbd00-0ec2-11eb-b18c-c572b85662e8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f880be0ea959e00178ee325"
//   },
//   "group": "ios-8",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Никита Нагайник",
//   "lecture": "Классы и структуры",
//   "additional": "Ждем вас онлайн.",
//   "id": "9bce87a0-0ec2-11eb-b18c-c572b85662e8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f880d34ea959e00178ee326"
//   },
//   "group": "ios-4",
//   "date": "2020-10-15",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 1",
//   "additional": "Занятие состоится в Zoom. ссылка будет размещена в группе.",
//   "id": "66535140-0ec3-11eb-b18c-c572b85662e8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f880df1ea959e00178ee327"
//   },
//   "group": "py-33",
//   "date": "2020-10-15",
//   "time": "19:30",
//   "teacher": "Евгений Шмаргунов",
//   "lecture": "Разработка тестов",
//   "additional": "Ждем вас онлайн.n",
//   "id": "d748dbe0-0ec3-11eb-b18c-c572b85662e8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f88667cea959e00178ee328"
//   },
//   "group": "onec-5",
//   "date": "2020-10-15",
//   "time": "18:30",
//   "teacher": "Антон Чаусов",
//   "lecture": "Объекты платформы",
//   "additional": "nНа вебинаре вы узнаете:n-как создаются объекты платформы;n-что такое конструктор и метод;n-для чего нужны объекты ТабличныйДокумент и ТекстовыйДокумент.nnТакже научитесь:n-создавать цвета, шрифты и собирать из них форматированные строки;n-использовать генератор случайных чисел;n-программно создавать, находить и изменять пользователей ИБ.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "9d77bb40-0ef8-11eb-b18c-c572b85662e8",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f88ae08ea959e00178ee329"
//   },
//   "group": "java qa-11",
//   "date": "2020-10-16",
//   "time": "19:30",
//   "teacher": "Анна Юшина",
//   "lecture": "Композиция и зависимость объектов. Mockito при создании авто-тестов",
//   "additional": "Ждём всех онлайн!",
//   "id": "42de50b0-0f23-11eb-b18c-c572b85662e8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f88ae74ea959e00178ee32a"
//   },
//   "group": "ibb-2",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Павел Волчков",
//   "lecture": "Международные и отраслевые стандарты (часть 1)",
//   "additional": "Ждём всех онлайн!",
//   "id": "837ad7b0-0f23-11eb-b18c-c572b85662e8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f88aee6ea959e00178ee32b"
//   },
//   "group": "sib-3-ibb",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Роман Жуков",
//   "lecture": "Информация с ограниченным доступом (тайны)",
//   "additional": "Ждём всех онлайн!",
//   "id": "c6f99710-0f23-11eb-b18c-c572b85662e8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f88af1aea959e00178ee32c"
//   },
//   "group": "1-ibnet",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Иван Чупров",
//   "lecture": "Атаки (часть 1)",
//   "additional": "Ждём всех онлайн!",
//   "id": "e5f47f90-0f23-11eb-b18c-c572b85662e8",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f89436974ab70001757eb67"
//   },
//   "group": "ios-3",
//   "date": "2020-10-16",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 5",
//   "additional": "Ждем вас онлайн.n",
//   "id": "4c62d940-0f7c-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89437a74ab70001757eb68"
//   },
//   "group": "py-35",
//   "date": "2020-10-16",
//   "time": "19:30",
//   "teacher": "Олег Булыгин",
//   "lecture": "Условные конструкции. Операции сравнения",
//   "additional": "Ждем вас онлайн.",
//   "id": "562eef90-0f7c-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89a9c774ab70001757eb69"
//   },
//   "group": "jd_2_jadv",
//   "date": "2020-10-19",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Многопоточное (параллельное) программирование. Создание и запуск потоков",
//   "additional": "n",
//   "id": "50716ff0-0fb9-11eb-a273-593c7119ecaa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f89a9dc74ab70001757eb6a"
//   },
//   "group": "jd_2_jadv",
//   "date": "2020-10-22",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Работа с синхронизацией. Synchronization, wait, notify, sleep, lock",
//   "additional": "n",
//   "id": "5cab03d0-0fb9-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89a9f274ab70001757eb6b"
//   },
//   "group": "jd_2_jadv",
//   "date": "2020-10-27",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Volatile, threadlocal atomics",
//   "additional": "n",
//   "id": "69fdf6f0-0fb9-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89aa0674ab70001757eb6c"
//   },
//   "group": "jd_2_jadv",
//   "date": "2020-10-29",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллекции для параллельной (конкурирующей) работы",
//   "additional": "n",
//   "id": "76068fc0-0fb9-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89aa1d74ab70001757eb6d"
//   },
//   "group": "jd_2_jadv",
//   "date": "2020-11-03",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Клиент-серверное взаимодействие. Blocking и Non-Blocking IO",
//   "additional": "n",
//   "id": "83b4e950-0fb9-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89aa3574ab70001757eb6e"
//   },
//   "group": "jd_2_jadv",
//   "date": "2020-11-05",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Функциональное программирование",
//   "additional": "n",
//   "id": "91e432b0-0fb9-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89aa4b74ab70001757eb6f"
//   },
//   "group": "jd_2_jadv",
//   "date": "2020-11-10",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Методология разработки. TDD, DDD",
//   "additional": "n",
//   "id": "9f230190-0fb9-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89ab8374ab70001757eb70"
//   },
//   "group": "jd_1_jspr",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Евгений Грязнов",
//   "lecture": "HTTP и современный Web",
//   "additional": "n",
//   "id": "59212450-0fba-11eb-a273-593c7119ecaa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f89ab9c74ab70001757eb71"
//   },
//   "group": "jd_1_jspr",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Евгений Грязнов",
//   "lecture": "Формы и форматы передача данных",
//   "additional": "n",
//   "id": "67a6f220-0fba-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89abb374ab70001757eb72"
//   },
//   "group": "jd_1_jspr",
//   "date": "2020-10-26",
//   "time": "19:00",
//   "teacher": "Евгений Грязнов",
//   "lecture": "JS, Ajax, REST, JSON, CORS",
//   "additional": "n",
//   "id": "75989640-0fba-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89abca74ab70001757eb73"
//   },
//   "group": "jd_1_jspr",
//   "date": "2020-10-29",
//   "time": "20:00",
//   "teacher": "Иван Бочаров",
//   "lecture": "Servlets Containers",
//   "additional": "n",
//   "id": "8318daf0-0fba-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89abe474ab70001757eb74"
//   },
//   "group": "jd_1_jspr",
//   "date": "2020-11-02",
//   "time": "20:00",
//   "teacher": "Илья Сухачев ",
//   "lecture": "Dependency Lookup, Dependency Injection, IoC, Spring, Application Context",
//   "additional": "n",
//   "id": "92e77c70-0fba-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89abf574ab70001757eb75"
//   },
//   "group": "jd_1_jspr",
//   "date": "2020-11-09",
//   "time": "20:00",
//   "teacher": "Илья Сухачев",
//   "lecture": "Spring Web MVC",
//   "additional": "n",
//   "id": "9d147770-0fba-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89d6b974ab70001757eb76"
//   },
//   "group": "bgo-2",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "Docker and Docker Compose: управление сервисами и упаковка приложений",
//   "additional": "nНа лекции вы:n-поговорите о системах виртуализации и контейнеризации;n-поработаете с Docker & Docker Compose.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "1a3338e0-0fd4-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89d6f574ab70001757eb77"
//   },
//   "group": "bgo-2",
//   "date": "2020-10-26",
//   "time": "19:00",
//   "teacher": "Константин Макаров",
//   "lecture": "Реляционные базы данных — SQL",
//   "additional": "nНа лекции вы изучите необходимый минимум, который позволит вам с помощью Docker:n-создать БД для разработки и тестирования;n-создать в БД таблицы (при необходимости модифицировать или удалить их);n-вставить в таблицы первые записи, познакомиться с механизмами удаления и обновления.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "3deb3440-0fd4-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89d79574ab70001757eb78"
//   },
//   "group": "bgo-2",
//   "date": "2020-10-29",
//   "time": "19:00",
//   "teacher": "Андрей Богатырёв",
//   "lecture": "Реляционные базы данных  — использование из Go",
//   "additional": "nНа лекции вы:n-поговорите о возможностях работы с PostgreSQL из Go с помощью драйвера pgx;n-рассмотрите возможности базовые возможности запроса SELECT.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "9d9df3f0-0fd4-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89d7cc74ab70001757eb79"
//   },
//   "group": "bgo-2",
//   "date": "2020-11-03",
//   "time": "19:00",
//   "teacher": "Андрей Богатырёв",
//   "lecture": "REST",
//   "additional": "nНа лекции вы:n-изучите основные принципы REST, поскольку вы либо сами будете писать различные системы, либо интегрироваться с ними.n-ознакомитесь со всем рядовым инструментарием создания веб-приложений: от обработки запросов, загрузки файлов, до тестирования, REST и работы с СУБД.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "be2cc2e0-0fd4-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89dfa074ab70001757eb7a"
//   },
//   "group": "ajs-10",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Татьяна Демьяненко",
//   "lecture": "Консультация по диплому",
//   "additional": "На этом занятии вы узнаете об условиях допуска к диплому, сроках выполнения дипломной работы и о том, как вы будете работать над дипломом.",
//   "id": "68cd0a80-0fd9-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89dfd674ab70001757eb7b"
//   },
//   "group": "bhj-14",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Михаил Кузнецов",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На лекции рассмотрим, какие бывают события. Остановимся на работе с input и output. Ждем вас на вебинаре!n",
//   "id": "88acfbd0-0fd9-11eb-a273-593c7119ecaa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f89e01b74ab70001757eb7c"
//   },
//   "group": "bhj-14",
//   "date": "2020-10-23",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Изменение структуры HTML-документа",
//   "additional": "На лекции мы познакомимся с содержимым HTML-документа, узнаем о представлении элемента и научимся управлять различными элементами. Не пропустите вебинар, чтобы задать интересующие вопросу лектору лично.n",
//   "id": "b21088c0-0fd9-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89e23074ab70001757eb7e"
//   },
//   "group": "bjs-15",
//   "date": "2020-10-22",
//   "time": "18:00",
//   "teacher": "Евгений Шек",
//   "lecture": "Прототип массива, функции высшего порядка",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Константы и массивыn2. Поиск в массивеn3. Функции высшего порядкаn4. Расширенный поиск в массивеn5. Преобразование массива",
//   "id": "ef99e6e0-0fda-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89e2ad74ab70001757eb7f"
//   },
//   "group": "html-54",
//   "date": "2020-10-19",
//   "time": "18:00",
//   "teacher": "Алексей Кулагин",
//   "lecture": "Вёрстка форм",
//   "additional": "Вы узнаете:n- для чего используются формы и какие поля у них есть;n- как задать минимальную и максимальную высоту/ширину элемента;n- как сделать эффекты при наведении на элемент.",
//   "id": "3a871d80-0fdb-11eb-a273-593c7119ecaa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f89e2e374ab70001757eb80"
//   },
//   "group": "html-54",
//   "date": "2020-10-22",
//   "time": "18:00",
//   "teacher": "Александр Фитискин",
//   "lecture": "Нестандартные элементы форм",
//   "additional": "На занятии лектор расскажет:n- что такое строчно-блочные элементы и какие у них есть особенности;n- как можно стилизовать фон элементов;n- что такое соседний и родственный селектор и для чего они используются;n- про абсолютное позиционирование элементов;n- про псевдоэлементы ::before и ::after.",
//   "id": "5a77d7b0-0fdb-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89e40074ab70001757eb82"
//   },
//   "group": "bjs-15",
//   "date": "2020-10-20",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Обработка ошибок и замыкания",
//   "additional": "На лекции будут раскрыты следующие темы:n1. Внутренние исключения выполненияn2. Создание собственных исключенийn3. Перехват исключенийn4. Консольные методы для удобной работыn5. Области видимостиn6. Замыканияn7. Конструкция delete",
//   "id": "046f31f0-0fdc-11eb-a273-593c7119ecaa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f89e53174ab70001757eb85"
//   },
//   "group": "ahj-9",
//   "date": "2020-10-20",
//   "time": "19:00",
//   "teacher": "Алексей Дацков",
//   "lecture": "Обработка событий",
//   "additional": "На занятии вы узнаете:n- все про события;n- про метод prevent default;n- а также разницу между фазами Capturing и Bubbling.",
//   "id": "ba409af0-0fdc-11eb-a273-593c7119ecaa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f89e56c74ab70001757eb86"
//   },
//   "group": "ahj-9",
//   "date": "2020-10-23",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Организация тестирования (Unit, E2E)",
//   "additional": "На занятии вы узнаете:n- про пирамиду тестирования;n- что такое unit- и E2E-тестирование;n- про компоненты;n- а также JSDOM.",
//   "id": "dd186f80-0fdc-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f89e80c74ab70001757eb88"
//   },
//   "group": "mq-28",
//   "date": "2020-10-20",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Медиа-функции",
//   "additional": "На лекции преподаватель подробно расскажет о медиа-функциях, позволяющих проверить различные характеристики устройства, на котором открыта страничка. Вы познакомитесь с относительной единицей измерения em, которая пригодится при создании адаптивного сайта. nЖдём вас на лекции! ",
//   "id": "6dbf6bf0-0fde-11eb-a273-593c7119ecaa",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f89e8f474ab70001757eb8a"
//   },
//   "group": "mq-28",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Семён Бойко",
//   "lecture": "Особенности верстки графики для мобильных устройств",
//   "additional": "На этом занятии преподаватель поведает о нюансах разработки для гаджетов от Apple на базе операционной системы iOS, а также для устройств, имеющих экраны с повышенной плотностью пикселей. Кроме того, будет затронута тема иконочных шрифтов и SVG (векторной) графики. nА в заключение вас ждут ещё несколько удобных свойств Flexbox:n- justify-content (определяет, как браузер распределяет пространство вокруг флекс-элементов вдоль главной оси контейнера);n- align-items (выравнивает флекс-элементы внутри контейнера в перпендикулярном направлении);n-️ align-self (выравнивает флекс-элементы текущей строки, переписывая значение align-items).nЖдём вас на занятии! ",
//   "id": "f820fd40-0fde-11eb-a273-593c7119ecaa",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c82a783884c0017cc4d3d"
//   },
//   "group": "virt-1",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Elasticsearch",
//   "additional": "nНа занятии вы узнаете, что Elasticsearch:n-PA+EL система;n-хранит данные в индексах и шардах;n-имеет множество настроек для оптимизации своей работы;n-предоставляет REST API для мониторинга своего состояния;n-имеет best practice по кластеризации;n-обладает встроенным механизмом бэкапа и восстановления.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c17d9da0-116b-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c82de83884c0017cc4d3e"
//   },
//   "group": "virt-1",
//   "date": "2020-10-26",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Troubleshooting",
//   "additional": "nНа лекции вы рассмотрите типовые проблемы с серверами БД:n-MongoDB;n-Redis;n-MySQL;n-PostgreSQL;n-Elasticsearch.nnТакже узнаете возможные пути решения этих проблем.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "e2cb76d0-116b-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c83f183884c0017cc4d3f"
//   },
//   "group": "virt-1",
//   "date": "2020-10-20",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "PostgreSQL",
//   "additional": "nНа лекции вы:n-познакомитесь с объектно-реляционной системой управления базами данных — PostgreSQL;n-узнаете о наборе задач, решаемых PostgreSQL;n-о гибких настройках шардинга и репликации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "86563970-116c-11eb-9b85-3f6d2df4e00b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8c845583884c0017cc4d40"
//   },
//   "group": "virt-2",
//   "date": "2020-10-20",
//   "time": "20:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Основы виртуализации",
//   "additional": "nНа занятии вы:n-узнаете, что такое виртуализация;n-узнаете о преимуществах виртуализации;n-подробно рассмотрите каждый из видов преимущества виртуализации;n-рассмотрите виды виртуализации и сравните их;n-рассмотрите плюсы и минусы виртуализации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "c20c0580-116c-11eb-9b85-3f6d2df4e00b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8c847e83884c0017cc4d41"
//   },
//   "group": "virt-2",
//   "date": "2020-10-22",
//   "time": "20:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Системы управления виртуализацией",
//   "additional": "nНа лекции вы:n-познакомитесь с основными системами управления виртуализацией, их классификацией, преимуществами и недостатками каждой из них, а также понятием гипервизора и его типами;n-узнаете о более комплексном подходе для виртуализации таким, как инфраструктура как сервис и его реализациях в виде публичных и приватных облаков.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "dab49520-116c-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c84a483884c0017cc4d42"
//   },
//   "group": "virt-2",
//   "date": "2020-10-27",
//   "time": "20:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Контейнеризация на примере Docker",
//   "additional": "nНа занятии вы:n-познакомитесь с основными системами управления виртуализацией, их классификацией, преимуществами и недостатками каждой из них, а также понятием гипервизора и его типами;n-узнаете о более комплексном подходе для виртуализации таким, как инфраструктура как сервис и его реализациях в виде публичных и приватных облаков nnnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "f1286a70-116c-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c84da83884c0017cc4d43"
//   },
//   "group": "virt-2",
//   "date": "2020-10-29",
//   "time": "20:00",
//   "teacher": "Дмитрий Власенко",
//   "lecture": "Практические навыки работы с Docker",
//   "additional": "nНа лекции вы:n-познакомитесь с синтаксисом Dockerfile и принципами корректного использования основных инструкций;n-научитесь собирать и публиковать образ;n-научитесь реализовывать манифесты Dockerfile и собирать соответствующие образы по практическим задачам. nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "1162b0c0-116d-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c850b83884c0017cc4d44"
//   },
//   "group": "virt-2",
//   "date": "2020-11-02",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Типы и структура СУБД",
//   "additional": "nНа занятии вы:n-рассмотрите, какие бывают СУБД;n-научитесь определять тип СУБД по CAP/PACELC теоремам;n-ознакомитесь с понятием транзакций;n-узнаете, что такое ACID/BASE принципы;n-рассмотрите популярные NoSQL решения и их характеристики.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "2e777420-116d-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c853b83884c0017cc4d45"
//   },
//   "group": "virt-2",
//   "date": "2020-11-05",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "SQL",
//   "additional": "nНа лекции вы:n-узнаете, что такое SQL;n-ознакомитесь с базовыми операторами SQL;n-рассмотрите механизм связи таблиц в БД;n-научитесь делать сложные выборки;n-изучите механизм индексации данных;n-узнаете, как профилировать SQL запросы.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях.",
//   "id": "4b0ad280-116d-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c857983884c0017cc4d46"
//   },
//   "group": "virt-2",
//   "date": "2020-11-10",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "MySQL",
//   "additional": "nНа занятии вы узнаете, что MySQL:n-по теореме Брюера может быть как CA, так и CP системой;n-имеет множество “движков”, под разные виды задач;n-обеспечивает безопасность системой ACL;n-для восстановления используются файлы бэкапов и бинарные log-файлы;n-позволяет расширять свой функционал;n-в обеспечение производительности и отказоустойчивости возможны гибкие настройки шардинга и репликации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "70232130-116d-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c85ad83884c0017cc4d47"
//   },
//   "group": "virt-2",
//   "date": "2020-11-12",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "PostgreSQL",
//   "additional": "nНа лекции вы:n-познакомитесь с объектно-реляционной системой управления базами данных — PostgreSQL;n-узнаете о наборе задач, решаемых PostgreSQL;n-о гибких настройках шардинга и репликации.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "8f2387f0-116d-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c85df83884c0017cc4d48"
//   },
//   "group": "virt-2",
//   "date": "2020-11-16",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Elasticsearch",
//   "additional": "nНа занятии вы узнаете, что Elasticsearch:n-PA+EL система;n-хранит данные в индексах и шардах;n-имеет множество настроек для оптимизации своей работы;n-предоставляет REST API для мониторинга своего состояния;n-имеет best practice по кластеризации;n-обладает встроенным механизмом бэкапа и восстановления.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "acaf01f0-116d-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c861883884c0017cc4d49"
//   },
//   "group": "virt-2",
//   "date": "2020-11-18",
//   "time": "19:00",
//   "teacher": "Алексей Метляков",
//   "lecture": "Troubleshooting",
//   "additional": "nНа лекции вы рассмотрите типовые проблемы с серверами БД:n-MongoDB;n-Redis;n-MySQL;n-PostgreSQL;n-Elasticsearch.nnТакже узнаете возможные пути решения этих проблем.nnЖдем вас онлайн. Свои вопросы оставляйте в комментариях. ",
//   "id": "cee602a0-116d-11eb-9b85-3f6d2df4e00b",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8c8dd883884c0017cc4d4a"
//   },
//   "group": "ibb-2",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Павел Волчков",
//   "lecture": "Международные и отраслевые стандарты (часть 2)",
//   "additional": "Ждём всех онлайн!",
//   "id": "6d81a910-1172-11eb-9b85-3f6d2df4e00b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8c8f6583884c0017cc4d4b"
//   },
//   "group": "java qa-11",
//   "date": "2020-10-19",
//   "time": "19:30",
//   "teacher": "Ксения Глушкова",
//   "lecture": "Наследование и расширяемость систем. Проблемы наследования",
//   "additional": "Ждём всех онлайн!",
//   "id": "59f2aec0-1173-11eb-9b85-3f6d2df4e00b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8c8fab83884c0017cc4d4c"
//   },
//   "group": "java qa-9",
//   "date": "2020-10-19",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Selenide",
//   "additional": "Ждём всех онлайн!",
//   "id": "83ca8150-1173-11eb-9b85-3f6d2df4e00b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8c8fdb83884c0017cc4d4d"
//   },
//   "group": "java qa-10",
//   "date": "2020-10-19",
//   "time": "19:30",
//   "teacher": "Артём Романов",
//   "lecture": "Selenide",
//   "additional": "Ждём всех онлайн!",
//   "id": "a06d21f0-1173-11eb-9b85-3f6d2df4e00b",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8d405aef0f3b0017cc5e98"
//   },
//   "group": "ios-7",
//   "date": "2020-10-19",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Дизайн и пользовательский интерфейс",
//   "additional": "Ждем вас онлайн.",
//   "id": "d3b4f060-11dc-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d4079ef0f3b0017cc5e99"
//   },
//   "group": "ios-9",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Максим Солдатов",
//   "lecture": "Кортеж и множество",
//   "additional": "Ждем вас онлайн.",
//   "id": "e6417960-11dc-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d40b2ef0f3b0017cc5e9a"
//   },
//   "group": "py-33",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Елена Никитина",
//   "lecture": "Регулярные выражения",
//   "additional": "Ждем вас онлайн.",
//   "id": "081dfe00-11dd-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d40efef0f3b0017cc5e9b"
//   },
//   "group": "ios-8",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Никита Нагайник",
//   "lecture": "Свойства и методы объекта",
//   "additional": "Ждем вас онлайн.",
//   "id": "2c7c7290-11dd-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d4110ef0f3b0017cc5e9c"
//   },
//   "group": "ios-4",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Никита Казаков",
//   "lecture": "Подготовка к практическому заданию № 2",
//   "additional": "Ждем вас онлайн.",
//   "id": "3ff35b90-11dd-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d4139ef0f3b0017cc5e9d"
//   },
//   "group": "dj-13",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Максим Филипенко",
//   "lecture": "Вебинар с разбором вопросов",
//   "additional": "Ждем вас онлайн.n",
//   "id": "584f03b0-11dd-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d6e2aef0f3b0017cc5e9e"
//   },
//   "group": "sib-3-ibb",
//   "date": "2020-10-19",
//   "time": "19:00",
//   "teacher": "Иван Чупров",
//   "lecture": "Нормативное регулирование",
//   "additional": "Ждём всех онлайн!",
//   "id": "220f4600-11f8-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d90cfef0f3b0017cc5e9f"
//   },
//   "group": "onec-3",
//   "date": "2020-10-30",
//   "time": "19:00",
//   "teacher": "Антон Чаусов",
//   "lecture": "XML и JSON",
//   "additional": "nНа вебинаре вы узнаете:n-теоретическую структуру форматов XML и JSON;n-возможность автоматического формирования файлов обмена по данным ИБ;n-возможность автоматического формирования файлов обмена по универсальным коллекциям 1С;n-ручное чтение и запись XML;n-ручное чтение и запись JSON.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "c84f4d80-120c-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d90f7ef0f3b0017cc5ea0"
//   },
//   "group": "onec-3",
//   "date": "2020-11-02",
//   "time": "19:30",
//   "teacher": "Андрей Чередников",
//   "lecture": "HTTP-сервисы и SOAP-сервисы",
//   "additional": "nНа занятии вы узнаете:n-теоретическую часть протоколов SOAP и HTTP;n-создание модели данных с помощью XDTO;n-применение модели данных в веб-сервисе SOAP;n-создание метода (операции) в веб-сервисе;n-структуру http-запроса и http-ответа;n-устройство http-сервиса.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "e06958c0-120c-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8d911def0f3b0017cc5ea1"
//   },
//   "group": "onec-3",
//   "date": "2020-11-05",
//   "time": "19:00",
//   "teacher": "Антон Чаусов",
//   "lecture": "Распределенная информационная база",
//   "additional": "nНа вебинаре вы узнаете про:n-Объект ПланОбмена;n-инфраструктуру регистрации изменений;n-инфраструктуру обмена сообщениями;n-ЧтениеCообщений;n-ЗаписьСообщений;n-способ запроса записей из таблиц регистрации изменений;n-отдельный режим "РИБ", недоступный в учебной версии.nnЖдем Вас на вебинаре. Свои вопросы и пожелания оставляйте в комментариях ",
//   "id": "f6f1c780-120c-11eb-a4b9-0b9334963b68",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8dae2eef0f3b0017cc5ea2"
//   },
//   "group": "bhj-14",
//   "date": "2020-10-20",
//   "time": "19:00",
//   "teacher": "Александр Русаков",
//   "lecture": "Работа с HTML-формами",
//   "additional": "На лекции рассмотрим, какие бывают события. Остановимся на работе с input и output. Ждем вас на вебинаре!n",
//   "id": "49cde040-121e-11eb-a4b9-0b9334963b68",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8e19ccef0f3b0017cc5ea5"
//   },
//   "group": "qa-13-iqa",
//   "date": "2020-10-20",
//   "time": "19:00",
//   "teacher": "Владимир Тесленко",
//   "lecture": "Инструменты тестирования. Клиент-Сервер",
//   "additional": "Ждём всех онлайн!",
//   "id": "6f2d2ef0-125e-11eb-a4b9-0b9334963b68",
//   "isSent": true
// },{
//   "_id": {
//     "$oid": "5f8e867908ff8000175a2f90"
//   },
//   "group": "pb-18",
//   "date": "2020-10-20",
//   "time": "19:00",
//   "teacher": "Константин Полянский",
//   "lecture": "Строки. Алгоритмы. Как отлаживать код",
//   "additional": "nНа лекции мы узнаем:n  - как работают строки в JS;n  - что такое алгоритмы и как их сравнивать;n  - какие существуют приемы отладки кода;n  - как читать ошибки интерпретатора.nnДополнительные материалыnпочитать:nклассическая документация от MDNnhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Stringnразбор от Ильи Кантораnhttps://learn.javascript.ru/stringnnпосмотреть:n20 методов, которые помогут вам жонглировать строками в JS, как настоящий PROnhttps://www.youtube.com/watch?v=VRz0nbax0uInхороший обзор (на английском)nhttps://www.youtube.com/watch?v=DljZQyNwdOgnпро типы ошибок в JS и то как с ними боротьсяnhttps://stepik.org/lesson/99598/step/1?unit=75361nувлекательнейшая лекция по алгоритмам (в рамках легендарного курса CS50 от Harvard University)nhttps://www.youtube.com/watch?v=U9o49qwa6hknкурс от Computer Science Center на stepiknhttps://stepik.org/course/217/nеще немного про алгоритмы (How Binary Search Works)nhttps://www.youtube.com/watch?v=JQhciTuD3E8",
//   "id": "35ec49f0-129f-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8e86d408ff8000175a2f91"
//   },
//   "group": "pb-18",
//   "date": "2020-10-22",
//   "time": "19:00",
//   "teacher": "Владимир Языков",
//   "lecture": "Массивы и базовые методы работы с ними",
//   "additional": "nНа лекции мы узнаем:n  - что такое массивы.n  - для чего используются массивыn  - какие методы мы можем применять для работы с массивамиnnnДополнительные материалы.nпочитать:nпо традиции - документация на MDN.nhttps://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array nопять же, по традиции learn.javascriptnhttps://learn.javascript.ru/array nnпосмотреть:nотличный обзор того, что мы сегодня обсудили (и даже больше) от Sorax.nhttps://www.youtube.com/watch?v=3OjuRfR8RNg nхороший обзор на английском.nhttps://www.youtube.com/watch?v=orAS-MBh5f4 ",
//   "id": "6bc78530-129f-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8e8cf108ff8000175a2f93"
//   },
//   "group": "ios-6",
//   "date": "2020-10-20",
//   "time": "18:00",
//   "teacher": "Александр Коловатов",
//   "lecture": "Разбор вопросов по модулю",
//   "additional": "Ждем вас онлайн.",
//   "id": "107f9ce0-12a3-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ea8db08ff8000175a2f95"
//   },
//   "group": "java-15",
//   "date": "2020-10-20",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Generics в коллекциях и методах",
//   "additional": "n",
//   "id": "b418eb30-12b3-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec49508ff8000175a2f97"
//   },
//   "group": "SD_16",
//   "date": "2020-10-26",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Новое знакомство с компьютером",
//   "additional": "n",
//   "id": "3b195ce0-12c4-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec4aa08ff8000175a2f98"
//   },
//   "group": "SD_16",
//   "date": "2020-10-29",
//   "time": "19:00",
//   "teacher": "Алексей Судничников",
//   "lecture": "Общаемся с компьютером",
//   "additional": "n",
//   "id": "4793f160-12c4-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec4bf08ff8000175a2f99"
//   },
//   "group": "SD_16",
//   "date": "2020-11-03",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Три кита веба: HTML, CSS, JS",
//   "additional": "n",
//   "id": "53b96100-12c4-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec4d008ff8000175a2f9a"
//   },
//   "group": "SD_16",
//   "date": "2020-11-05",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Интернет — большая библиотека",
//   "additional": "n",
//   "id": "5e39ac20-12c4-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec4e308ff8000175a2f9b"
//   },
//   "group": "SD_16",
//   "date": "2020-11-10",
//   "time": "19:00",
//   "teacher": "Владимир Чебукин",
//   "lecture": "Вся правда о профессии разработчика",
//   "additional": "n",
//   "id": "6968fbf0-12c4-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec5b708ff8000175a2f9c"
//   },
//   "group": "java-15",
//   "date": "2020-10-23",
//   "time": "20:00",
//   "teacher": "Филипп Воронов",
//   "lecture": "Коллекции List",
//   "additional": "n",
//   "id": "e7df6780-12c4-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec5d308ff8000175a2f9d"
//   },
//   "group": "java-15",
//   "date": "2020-10-28",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллекции Queue",
//   "additional": "n",
//   "id": "f84c92f0-12c4-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec5e808ff8000175a2f9e"
//   },
//   "group": "java-15",
//   "date": "2020-10-30",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции HashSet и HashMap",
//   "additional": "n",
//   "id": "051f0b70-12c5-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec5fc08ff8000175a2f9f"
//   },
//   "group": "java-15",
//   "date": "2020-11-04",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Коллеции TreeSet и TreeMap",
//   "additional": "n",
//   "id": "11077210-12c5-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8ec64208ff8000175a2fa0"
//   },
//   "group": "java-15",
//   "date": "2020-11-09",
//   "time": "20:00",
//   "teacher": "Юрий Пеньков",
//   "lecture": "Разбор задач",
//   "additional": "nn",
//   "id": "3a869d50-12c5-11eb-8945-73e99f48be92",
//   "isSent": false
// },{
//   "_id": {
//     "$oid": "5f8efeb008ff8000175a2fa2"
//   },
//   "group": "1-ibnet",
//   "date": "2020-10-21",
//   "time": "19:30",
//   "teacher": "Алексей Федин",
//   "lecture": "Атаки (часть 2)",
//   "additional": "Ждём всех онлайн!",
//   "id": "dcc04be0-12e6-11eb-8945-73e99f48be92",
//   "isSent": false
// }]`


export default lession;
